microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_adc.h
/*LICENSE *****************************************************************************************
 *
 * Software License Agreement
 *
 * Copyright (R) 2012 Microchip Technology Inc.  All rights reserved. Microchip licenses to you the
 * right to use, modify, copy and distribute Software only when embedded on a Microchip 
 * microcontroller or digital signal controller, which is integrated into your product or third 
 * party product (pursuant to the sublicense terms in the accompanying license agreement).
 *
 * You should refer to the license agreement accompanying this Software for additional information 
 * regarding your rights and obligations.
 *
 * SOFTWARE AND DOCUMENTATION ARE PROVIDED "AS IS" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR 
 * IMPLIED, INCLUDING WITHOUT LIMITATION, ANY WARRANTY OF MERCHANTABILITY, TITLE, NON-INFRINGEMENT 
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT SHALL MICROCHIP OR ITS LICENSORS BE LIABLE OR
 * OBLIGATED UNDER CONTRACT, NEGLIGENCE, STRICT LIABILITY, CONTRIBUTION, BREACH OF WARRANTY, OR 
 * OTHER LEGAL EQUITABLE THEORY ANY DIRECT OR INDIRECT DAMAGES OR EXPENSES INCLUDING BUT NOT  
 * LIMITED TO ANY INCIDENTAL, SPECIAL, INDIRECT, PUNITIVE OR CONSEQUENTIAL DAMAGES, LOST PROFITS  
 * OR LOST DATA, COST OF PROCUREMENT OF SUBSTITUTE GOODS, TECHNOLOGY, SERVICES, OR ANY CLAIMS BY  
 * THIRD PARTIES (INCLUDING BUT NOT LIMITED TO ANY DEFENSE THEREOF), OR OTHER SIMILAR COSTS.
 *
 * ***********************************************************************************************/

#ifndef MCAL_P33SMPS_HSADC_H
#define MCAL_P33SMPS_HSADC_H

#include <xc.h> // include processor files - each processor file is guarded.  
#include <stdint.h> // include standard integer types header file
#include <stdbool.h> // include standard boolean types header file
#include <math.h> // include standard math library header file

#if defined (__MA330049_dsPIC33CH_DPPIM__) || defined (__MA330048_dsPIC33CK_DPPIM__)


/*!p33SMPS_hsadc.h
 * ************************************************************************************************
 * Summary:
 * Header file with additional defines for the dsPIC33FxxGS-ADC SFRs
 *
 * Description:
 * The SMPS ADC module offers a number of registers and configuration options. This additional
 * header file contains defines for all required bit-settings. This additional
 * header file contains defines for all required bit-settings of all related registers.
 * This file is an additional header file on top of the generic device header file.
 * ***********************************************************************************************/

// Device-specific Defines

#if defined (__P33SMPS_CH202__) || defined (__P33SMPS_CH202S1__) || \
    defined (__P33SMPS_CH502__) || defined (__P33SMPS_CH502S1__)

    #if defined (__P33SMPS_CH_MSTR__)

        #define ADC_CORE_COUNT          1					// Number of ADC Cores available
        #define ADC_ANINPUT_COUNT       12                  // Number of analog inputs
        #define ADC_SHARED_CORE_INDEX   (ADC_CORE_COUNT - 1)    // Arteficially assigned index for shared ADC core

        #define REG_ADC_CHANNEL_L_MSK   0b0000111111111111
        #define REG_ADC_CHANNEL_H_MSK   0b0000000000000000

    #elif defined (__P33SMPS_CH_SLV1__)

        #define ADC_CORE_COUNT          3					// Number of ADC Cores available
        #define ADC_ANINPUT_COUNT       11                  // Number of analog inputs
        #define ADC_SHARED_CORE_INDEX   (ADC_CORE_COUNT - 1)    // Arteficially assigned index for shared ADC core

        #define REG_ADC_CHANNEL_L_MSK   0b0000011111111111
        #define REG_ADC_CHANNEL_H_MSK   0b0000000000000000

    #endif

#elif defined (__P33SMPS_CH203__) || defined (__P33SMPS_CH205__) || \
      defined (__P33SMPS_CH203S1__) || defined (__P33SMPS_CH205S1__) || \
      defined (__P33SMPS_CH503__) || defined (__P33SMPS_CH505__) || \
      defined (__P33SMPS_CH503S1__) || defined (__P33SMPS_CH505S1__)

    #if defined (__P33SMPS_CH_MSTR__)

        #define ADC_CORE_COUNT          1					// Number of ADC Cores available
        #define ADC_ANINPUT_COUNT       16                  // Number of analog inputs
        #define ADC_SHARED_CORE_INDEX   (ADC_CORE_COUNT - 1)    // Arteficially assigned index for shared ADC core

        #define REG_ADC_CHANNEL_L_MSK   0b1111111111111111
        #define REG_ADC_CHANNEL_H_MSK   0b0000000000000000

    #elif defined (__P33SMPS_CH_SLV1__)

        #define ADC_CORE_COUNT          3					// Number of ADC Cores available
        #define ADC_ANINPUT_COUNT       15                  // Number of analog inputs
        #define ADC_SHARED_CORE_INDEX   (ADC_CORE_COUNT - 1)    // Arteficially assigned index for shared ADC core

        #define REG_ADC_CHANNEL_L_MSK   0b0111111111111111
        #define REG_ADC_CHANNEL_H_MSK   0b0000000000000000

    #endif

#elif defined (__P33SMPS_CH206__) || defined (__P33SMPS_CH208__) || \
      defined (__P33SMPS_CH206S1__) || defined (__P33SMPS_CH208S1__) || \
      defined (__P33SMPS_CH506__) || defined (__P33SMPS_CH508__) || \
      defined (__P33SMPS_CH506S1__) || defined (__P33SMPS_CH508S1__)

    #if defined (__P33SMPS_CH_MSTR__)

        #define ADC_CORE_COUNT          1					// Number of ADC Cores available
        #define ADC_ANINPUT_COUNT       16                  // Number of analog inputs
        #define ADC_SHARED_CORE_INDEX   (ADC_CORE_COUNT - 1)    // Arteficially assigned index for shared ADC core

        #define ADC_ADCMP_COUNT         4 // Number of ADC Digital Comparators
        #define ADC_ADFL_COUNT          4 // Number of ADC Digital Filters

        #define REG_ADC_CHANNEL_L_MSK   0b1111111111111111
        #define REG_ADC_CHANNEL_H_MSK   0b0000000000000000
    
    #elif defined (__P33SMPS_CH_SLV1__)

        #define ADC_CORE_COUNT          3					// Number of ADC Cores available
        #define ADC_ANINPUT_COUNT       18                  // Number of analog inputs
        #define ADC_SHARED_CORE_INDEX   (ADC_CORE_COUNT - 1)    // Arteficially assigned index for shared ADC core

        #define ADC_ADCMP_COUNT         4 // Number of ADC Digital Comparators
        #define ADC_ADFL_COUNT          4 // Number of ADC Digital Filters

        #define REG_ADC_CHANNEL_L_MSK   0b1111111111111111
        #define REG_ADC_CHANNEL_H_MSK   0b0000000000000011

    #endif

#elif defined (__MA330048_dsPIC33CK_DPPIM__)

    #define ADC_CORE_COUNT          3 // Number of ADC Cores available
    #define ADC_SHARED_CORE_INDEX   (uint16_t)(ADC_CORE_COUNT - 1) // Arteficially assigned index for shared ADC core

    #define ADC_ADCMP_COUNT         4 // Number of ADC Digital Comparators
    #define ADC_ADFL_COUNT          4 // Number of ADC Digital Filters

    #if defined (__P33SMPS_CK202__) || defined (__P33SMPS_CK502__)
        #define ADC_ANINPUT_COUNT       12                  // Number of analog inputs without alternative or internal ports
        #define REG_ADC_CHANNEL_L_MSK   0b0000111111111111
        #define REG_ADC_CHANNEL_H_MSK   0b0000001100000000
    #elif defined (__P33SMPS_CK203__) || defined (__P33SMPS_CK503__)
        #define ADC_ANINPUT_COUNT       16                  // Number of analog inputs without alternative or internal ports
        #define REG_ADC_CHANNEL_L_MSK   0b1111111111111111
        #define REG_ADC_CHANNEL_H_MSK   0b0000001100000000
    #elif defined (__P33SMPS_CK205__) || defined (__P33SMPS_CK505__)
        #define ADC_ANINPUT_COUNT       19                  // Number of analog inputs without alternative or internal ports
        #define REG_ADC_CHANNEL_L_MSK   0b1111111111111111
        #define REG_ADC_CHANNEL_H_MSK   0b0000001100000111
    #elif defined (__P33SMPS_CK206__) || defined (__P33SMPS_CK506__)
        #define ADC_ANINPUT_COUNT       20                  // Number of analog inputs without alternative or internal ports
        #define REG_ADC_CHANNEL_L_MSK   0b1111111111111111
        #define REG_ADC_CHANNEL_H_MSK   0b0000001100001111
    #elif defined (__P33SMPS_CK208__) || defined (__P33SMPS_CK508__)
        #define ADC_ANINPUT_COUNT       24                  // Number of analog inputs without alternative or internal ports
        #define REG_ADC_CHANNEL_L_MSK   0b1111111111111111
        #define REG_ADC_CHANNEL_H_MSK   0b0000001111111111
    #endif
    

    // All devices

    #define ADC_CORE_ANA0  0  // ADC input is assigned to dedicated ADC core (#0) => Alternative input to ADC Core #0
    #define ADC_CORE_ANA1  1  // ADC input is assigned to dedicated ADC core (#1) => Alternative input to ADC Core #1

    #define ADC_CORE_AN24  2  // ADC input is assigned to shared ADC core (#2) => Temperature Sensor
    #define ADC_CORE_AN25  2  // ADC input is assigned to shared ADC core (#2) => Bandgap Reference

