microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_adc.h
    #define ADC_CORE_AN0   0  // ADC input is assigned to dedicated ADC core (#0)
    #define ADC_CORE_AN1   1  // ADC input is assigned to dedicated ADC core (#1)
    #define ADC_CORE_AN2   2  // ADC input is assigned to shared ADC core (#2)
    #define ADC_CORE_AN3   2  // ADC input is assigned to shared ADC core (#3)
    #define ADC_CORE_AN4   2  // ADC input is assigned to shared ADC core (#4)
    #define ADC_CORE_AN5   2  // ADC input is assigned to shared ADC core (#5)
    #define ADC_CORE_AN6   2  // ADC input is assigned to shared ADC core (#6)
    #define ADC_CORE_AN7   2  // ADC input is assigned to shared ADC core (#7)
    #define ADC_CORE_AN8   2  // ADC input is assigned to shared ADC core (#8)
    #define ADC_CORE_AN9   2  // ADC input is assigned to shared ADC core (#9)
    #define ADC_CORE_AN10  2  // ADC input is assigned to shared ADC core (#10)
    #define ADC_CORE_AN11  2  // ADC input is assigned to shared ADC core (#11)


    #if defined (__P33SMPS_CK203__) || defined (__P33SMPS_CK503__) || \
        defined (__P33SMPS_CK205__) || defined (__P33SMPS_CK505__) || \
        defined (__P33SMPS_CK206__) || defined (__P33SMPS_CK506__) || \
        defined (__P33SMPS_CK208__) || defined (__P33SMPS_CK508__)
    // 36-/48-/64-/80-pin devices only
    #define ADC_CORE_AN12  2  // ADC input is assigned to shared ADC core (#12)
    #define ADC_CORE_AN13  2  // ADC input is assigned to shared ADC core (#13)
    #define ADC_CORE_AN14  2  // ADC input is assigned to shared ADC core (#14)
    #define ADC_CORE_AN15  2  // ADC input is assigned to shared ADC core (#15)
    #endif

    #if defined (__P33SMPS_CK205__) || defined (__P33SMPS_CK505__) || \
        defined (__P33SMPS_CK206__) || defined (__P33SMPS_CK506__) || \
        defined (__P33SMPS_CK208__) || defined (__P33SMPS_CK508__)
    // 48-/64-/80-pin devices only
    #define ADC_CORE_AN16  2  // ADC input is assigned to shared ADC core (#16)
    #define ADC_CORE_AN17  2  // ADC input is assigned to shared ADC core (#17)
    #define ADC_CORE_AN18  2  // ADC input is assigned to shared ADC core (#19)
    #endif

    #if defined (__P33SMPS_CK206__) || defined (__P33SMPS_CK506__) || \
        defined (__P33SMPS_CK208__) || defined (__P33SMPS_CK508__)
    // 64-/80-pin devices only
    #define ADC_CORE_AN19  2  // ADC input is assigned to shared ADC core (#20)
    #endif
    
    #if defined (__P33SMPS_CK208__) || defined (__P33SMPS_CK508__)
    // 80-pin devices only
    #define ADC_CORE_AN20  2  // ADC input is assigned to shared ADC core (#21)
    #define ADC_CORE_AN21  2  // ADC input is assigned to shared ADC core (#22)
    #define ADC_CORE_AN22  2  // ADC input is assigned to shared ADC core (#23)
    #define ADC_CORE_AN23  2  // ADC input is assigned to shared ADC core (#24)
    #endif

    typedef enum {
        ADCORE_AN0  = 0,  // ADC input is assigned to dedicated ADC core (#0)
        ADCORE_ANA0 = 0,  // ADC input is assigned to dedicated ADC core (#0)
        ADCORE_AN1  = 1,  // ADC input is assigned to dedicated ADC core (#1)
        ADCORE_ANA1 = 1,  // ADC input is assigned to dedicated ADC core (#1)
        ADCORE_AN2  = 2,  // ADC input is assigned to shared ADC core (#2)
        ADCORE_AN3  = 2,  // ADC input is assigned to shared ADC core (#3)
        ADCORE_AN4  = 2,  // ADC input is assigned to shared ADC core (#4)
        ADCORE_AN5  = 2,  // ADC input is assigned to shared ADC core (#5)
        ADCORE_AN6  = 2,  // ADC input is assigned to shared ADC core (#6)
        ADCORE_AN7  = 2,  // ADC input is assigned to shared ADC core (#7)
        ADCORE_AN8  = 2,  // ADC input is assigned to shared ADC core (#8)
        ADCORE_AN9  = 2,  // ADC input is assigned to shared ADC core (#9)
        ADCORE_AN10 = 2,  // ADC input is assigned to shared ADC core (#10)
        ADCORE_AN11 = 2,  // ADC input is assigned to shared ADC core (#11)
    #if defined (__P33SMPS_CK203__) || defined (__P33SMPS_CK503__) || \
        defined (__P33SMPS_CK205__) || defined (__P33SMPS_CK505__) || \
        defined (__P33SMPS_CK206__) || defined (__P33SMPS_CK506__) || \
        defined (__P33SMPS_CK208__) || defined (__P33SMPS_CK508__)
        ADCORE_AN12 = 2,  // ADC input is assigned to shared ADC core (#12)
        ADCORE_AN13 = 2,  // ADC input is assigned to shared ADC core (#13)
        ADCORE_AN14 = 2,  // ADC input is assigned to shared ADC core (#14)
        ADCORE_AN15 = 2,  // ADC input is assigned to shared ADC core (#15)
    #endif

    #if defined (__P33SMPS_CK205__) || defined (__P33SMPS_CK505__) || \
        defined (__P33SMPS_CK206__) || defined (__P33SMPS_CK506__) || \
        defined (__P33SMPS_CK208__) || defined (__P33SMPS_CK508__)
        ADCORE_AN16 = 2,  // ADC input is assigned to shared ADC core (#16)
        ADCORE_AN17 = 2,  // ADC input is assigned to shared ADC core (#17)
        ADCORE_AN18 = 2,  // ADC input is assigned to shared ADC core (#18)
    #endif

    #if defined (__P33SMPS_CK206__) || defined (__P33SMPS_CK506__) || \
        defined (__P33SMPS_CK208__) || defined (__P33SMPS_CK508__)
        ADCORE_AN19 = 2,  // ADC input is assigned to shared ADC core (#19)
    #endif
    
    #if defined (__P33SMPS_CK208__) || defined (__P33SMPS_CK508__)
        ADCORE_AN20 = 2,  // ADC input is assigned to shared ADC core (#20)
        ADCORE_AN21 = 2,  // ADC input is assigned to shared ADC core (#21)
        ADCORE_AN22 = 2,  // ADC input is assigned to shared ADC core (#22)
        ADCORE_AN23 = 2,  // ADC input is assigned to shared ADC core (#23)
    #endif

        ADCORE_AN24 = 2,  // ADC input is assigned to shared ADC core (#24) => Temperature Sensor
        ADCORE_AN25 = 2   // ADC input is assigned to shared ADC core (#25) => Bandgap Reference
    }ADC_CORE_INDEX_e;

#else

    #pragma message "=== selected device is not defined and may not be supported ==="

#endif

// The following define is used for bit masks and configuration registers depending on the number
// of available ADC cores and will be used by multiple defines throughout the library
#define ADCON4_VALID_ADCORE_BIT_MSK   (uint32_t)(ADCORE_REGISTER_BIT_MSK)

// bits are added for each dedicated core, shared core is always available (highest index)
#if (ADC_CORE_COUNT > 1)
    #define ADCORE_REGISTER_BIT_MSK   ((uint32_t)(pow(2, (ADC_CORE_COUNT-1)) - 1) | 0x0080) 
#else
    #define ADCORE_REGISTER_BIT_MSK   ((uint32_t)0x0080) // only the shared core is present
#endif

// Device-specific Defines
#ifndef DEVICE_DEFAULT_AVDD
    #define DEVICE_DEFAULT_AVDD 3.300 // if device VDD is not defined in this project, define it for standard value of 3.3V
#endif

#define ADC_VREF            DEVICE_DEFAULT_AVDD     // ADC reference voltage in [V]
#define ADC_RES_BIT         12.0    // ADC resolution in integer
#define ADC_RES             (uint16_t)(pow(2, ADC_RES_BIT)-1)    // ADC resolution in integer
#define ADC_SCALER          (float)(((float)(ADC_RES))/((float)(ADC_VREF))) // ADC Scaling in ticks/V
#define ADC_GRANULARITY     (float)(ADC_REF / pow(2.0, ADC_RES)) // ADC granularity in [V/tick]
    
#define ADC_ANx_INTERRUPT_ENABLE        1       // Bit setting for enabled interrupts of a dedicated analog input
#define ADC_ANx_INTERRUPT_DISABLE       0       // Bit setting for disabled interrupts of a dedicated analog input

