microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_adc.h
#define ADC_ANx_EARLY_INTERRUPT_ENABLE  1       // Bit setting for enabled early interrupts of a dedicated analog input
#define ADC_ANx_EARLY_INTERRUPT_DISABLE 0       // Bit setting for disabled early interrupts of a dedicated analog input

// General Flags
#define ADC_OFF							0b0		// Flag is used to shut down the adc module
#define ADC_ON							0b1		// Flag is used to enable the adc module

// REGISTER ADCON1L/H: ANALOG-TO-DIGITAL CONTROL REGISTER 1 LOW/HIGH

#define REG_ADCON1_VALID_DATA_WRITE_MSK     0x00E0A000 		// Bit mask used to set unimplemented bits to zero
#define REG_ADCON1_VALID_DATA_READ_MSK      0x00E0A000		// Bit mask used to read unimplemented bits as zero
#define REG_ADCON1_OFF_STATE_WRITE_MSK      0x00E02000 		// Bit mask used to set unimplemented bits to zero

// REGISTER ADCON1L: ANALOG-TO-DIGITAL CONTROL REGISTER 1 LOW

#define REG_ADCON1L_VALID_DATA_MSK          0b1010000000000000		// Bit mask used to set unimplemented bits to zero
#define REG_ADCON1L_DISABLED_MSK            0b0111111111111111
#define REG_ADCON1L_RESET                   0b0000000000000000      // Reset ADCON 1 Low Register

// REGISTER ADCON1H: ANALOG-TO-DIGITAL CONTROL REGISTER 1 HIGH

#define REG_ADCON1H_RESET                   0b0000000001100000      // Reset ADCON 1 High Register
#define REG_ADCON1H_VALID_DATA_MSK          0b0000000011100000		// Bit mask used to read unimplemented bits as zero

#define REG_ADCON1H_EXCLUDE_SHRADC_CFG_MSK	0b1111111110011111		// Bit mask used to read register settings without shared ADC core resolution

#define REG_ADCON1L_ADON_ENABLED		    0b1000000000000000      // Turn ADC Module On
#define REG_ADCON1L_ADON_DISABLED		    0b0000000000000000      // Turn ADC Module Off

typedef enum {
    ADCON1_ADON_ENABLED = 0b1, // ADC module is enabled
    ADCON1_ADON_DISABLED = 0b0 // ADC module is disabled
} ADCON1_ADON_e; // ADC Enable bit

#define REG_ADCON1L_ADSIDL_STOP			0b0010000000000000      // Module Discontinues Operation in Idle Mode
#define REG_ADCON1L_ADSIDL_RUN			0b0000000000000000      // Module Continues Operation in Idle Mode

typedef enum {
    ADCON1_ADSIDL_STOP = 0b1, // Discontinues module operation when device enters Idle mode
    ADCON1_ADSIDL_RUN = 0b0 // Continues module operation in Idle mode
} ADCON1_ADSIDL_e; // ADC Stop in Idle Mode bit


// REGISTER ADCON1H: ANALOG-TO-DIGITAL CONTROL REGISTER 1 HIGH

#define REG_ADCON1H_FORM_FRACTIONAL		0b0000000010000000      // Result Number Format = Fractional
#define REG_ADCON1H_FORM_INTEGER		0b0000000000000000      // Result Number Format = Integer

typedef enum {
    ADCON1_FORM_FRACTIONAL = 0b1, // Fractional Data Output Format
    ADCON1_FORM_INTEGER = 0b0 // Integer Data Output Format
} ADCON1_FORM_e; // Fractional Data Output Format bit

#define REG_ADCON1H_SHRRES_12BIT        0b0000000001100000      // Set for 12-bit operation
#define REG_ADCON1H_SHRRES_10BIT        0b0000000001000000      // Set for 10-bit operation
#define REG_ADCON1H_SHRRES_8BIT         0b0000000000100000      // Set for 8-bit operation
#define REG_ADCON1H_SHRRES_6BIT         0b0000000000000000      // Set for 6-bit operation

typedef enum {
    ADCORE_RES_12BIT = 0b11, // 12-bit resolution
    ADCORE_RES_10BIT = 0b10, // 10-bit resolution
    ADCORE_RES_8BIT = 0b01, // 8-bit resolution
    ADCORE_RES_6BIT = 0b00 // 6-bit resolution
} ADCOREx_RES_e; // Shared & Dedicated ADC Core Resolution Selection bits

typedef union {
    struct {
        volatile unsigned : 13;              // Bit 12-0: (reserved)
        volatile ADCON1_ADSIDL_e adsidl : 1; // Bit 13: ADC Stop in Idle Mode bit
        volatile unsigned : 1;               // Bit 14: (reserved)
        volatile ADCON1_ADON_e adon : 1;     // Bit 15: ADC Enable bit
    } __attribute__((packed)) bits;          // ADCON1H: ADC CONTROL REGISTER 1 LOW
    volatile uint16_t value;
}ADCON1L_t;     // ADCON1L: ADC CONTROL REGISTER 1 LOW


typedef union {
    struct {
        volatile unsigned : 5;              // Bit 4-0: (reserved)
        volatile ADCOREx_RES_e shrres : 2;  // Bit 6-5: Shared ADC Core Resolution Selection bits
        volatile ADCON1_FORM_e form : 1;    // Bit 7: Fractional Data Output Format bit
        volatile unsigned : 8;              // Bit 15-8: (reserved)
    } __attribute__((packed))bits;          // ADCON1H: ADC CONTROL REGISTER 1 HIGH
    volatile uint16_t value;
}ADCON1H_t;     // ADCON1H: ADC CONTROL REGISTER 1 HIGH


typedef union {
    struct {
        volatile ADCON1L_t adcon1l;     // ADCON1L: ADC CONTROL REGISTER 1 LOW
        volatile ADCON1H_t adcon1h;     // ADCON1H: ADC CONTROL REGISTER 1 HIGH
    } __attribute__((packed))bits;      // ADCON1: ADC CONTROL REGISTER 1 HIGH/LOW
    volatile uint32_t value;
} ADCON1_t; // ADCON1: ADC CONTROL REGISTER 1 HIGH/LOW

// REGISTERS ADCON2L/H: ANALOG-TO-DIGITAL CONTROL REGISTER 2 LOW/HIGH

#define REG_ADCON2_VALID_DATA_WRITE_MSK  0xC3FFDF7F		// Bit mask used to set unimplemented bits to zero
#define REG_ADCON2_VALID_DATA_READ_MSK   0xC3FFDF7F		// Bit mask used to set unimplemented bits to zero


// REGISTER ADCON2L: ANALOG-TO-DIGITAL CONTROL REGISTER 2 HIGH

#define REG_ADCON2L_RESET                  0b0000000000000000      // Reset ADCON 2 Low Register
#define REG_ADCON2L_VALID_DATA_MSK		   0b1101111101111111		// Bit mask used to set unimplemented bits to zero

#define REG_ADCON2L_SHRADC_CFG_MSK         0b0001011101111111      // Bit-Mask eliminating all bits not concerning the shared ADC core configuration
#define REG_ADCON2L_REF_CFG_MSK            0b1100000000000000      // Bit-Mask eliminating all bits not concerning the bandgap reference configuration
#define REG_ADCON2L_EXCLUDE_SHRADC_CFG_MSK 0b1111100010000000      // Bit-Mask eliminating all shared ADC core configuration bits 

// REGISTER ADCON2H: ANALOG-TO-DIGITAL CONTROL REGISTER 2 HIGH

#define REG_ADCON2H_RESET                  0b0000000000000000      // Reset ADCON 2 High Register
#define REG_ADCON2H_VALID_DATA_MSK		   0b1100001111111111		// Bit mask used to set unimplemented bits to zero

#define REG_ADCON2H_SHRADC_CFG_MSK         0b0000001111111111      // Bit-Mask eliminating all bits not concerning the shared ADC core configuration
#define REG_ADCON2H_REF_CFG_MSK            0b1100000000000000      // Bit-Mask eliminating all bits not concerning the bandgap reference configuration
#define REG_ADCON2H_REF_STAT_READ_MSK      0b1100000000000000      // Bit-Mask for reading the bandgap reference status bits
#define REG_ADCON2H_EXCLUDE_SHRADC_CFG_MSK 0b1111110000000000      // Bit-Mask eliminating all shared ADC core configuration bits 


#define REG_ADCON2L_REFCIE_ENABLED      0b1000000000000000      // Interrupt on Band Gap & Reference Voltage Ready
#define REG_ADCON2L_REFCIE_DISABLED     0b0000000000000000      // No Interrupt on Band Gap & Reference Voltage Ready

