microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_adc.h
typedef enum {
    ADCON2_REFRDY_READY = 0b1, // Band gap is ready
    ADCON2_REFRDY_NOT_READY = 0b0 // Band gap is not ready
} ADCON2_REFRDY_e; // Band Gap and Reference Voltage Ready Flag bit

#define REG_ADCON2H_REFERR_FAIL      0b0100000000000000   // Band gap failure after ADC peripehral was enabled
#define REG_ADCON2H_REFERR_OK        0b0000000000000000   // No Band gap / reference voltage error was detected

typedef enum {
    ADCON2_REFERR_FAIL = 0b1, // Band gap failure after the ADC module was enabled (ADON = 1)
    ADCON2_REFERR_OK = 0b0 // No band gap error was detected
} ADCON2_REFERR_e; // Band Gap or Reference Voltage Error Flag bit

typedef struct {
    volatile unsigned : 14;              // Bit 13-0: (blanked out here)
    volatile ADCON2_REFERR_e referr : 1; // Bit 14: Band Gap/Vref error flag bit
    volatile ADCON2_REFRDY_e refrdy : 1; // Bit 15: Band Gap/Vref status flag bit
} __attribute__((packed))ADCON2_REFSTAT_t; // Band Gap Reference status


#define REG_ADCON2H_SHRSAMC_MSK         0b0000001111111111      // Bit-Mask to filter on clock periods value bits
#define REG_ADCON2H_SHRSAMC(Tdaclk)     ((Tdaclk-2) & REG_ADCON2H_SHRSAMC_MSK) 		// Shared ADC Core Sample Time Selection bits

typedef enum {
    ADCORE_SAMC_DEFAULT = 0b0000000000, // Sampling time of 2 TADCORE clock periods
    ADCORE_SAMC_0002 = 0b0000000000, // Sampling time of 2 TADCORE clock periods
    ADCORE_SAMC_0003 = 0b0000000001, // Sampling time of 3 TADCORE clock periods
    ADCORE_SAMC_0004 = 0b0000000010, // Sampling time of 4 TADCORE clock periods
    ADCORE_SAMC_0005 = 0b0000000011, // Sampling time of 5 TADCORE clock periods
    ADCORE_SAMC_0006 = 0b0000000100, // Sampling time of 6 TADCORE clock periods
    ADCORE_SAMC_0007 = 0b0000000101, // Sampling time of 7 TADCORE clock periods
    ADCORE_SAMC_0008 = 0b0000000110, // Sampling time of 8 TADCORE clock periods
    ADCORE_SAMC_0009 = 0b0000000111, // Sampling time of 9 TADCORE clock periods
    ADCORE_SAMC_0010 = 0b0000001000, // Sampling time of 10 TADCORE clock periods
    ADCORE_SAMC_0011 = 0b0000001001, // Sampling time of 11 TADCORE clock periods
    ADCORE_SAMC_0012 = 0b0000001010, // Sampling time of 12 TADCORE clock periods
    ADCORE_SAMC_0013 = 0b0000001011, // Sampling time of 13 TADCORE clock periods
    ADCORE_SAMC_0014 = 0b0000001100, // Sampling time of 14 TADCORE clock periods
    ADCORE_SAMC_0015 = 0b0000001101, // Sampling time of 15 TADCORE clock periods
    ADCORE_SAMC_0016 = 0b0000001110, // Sampling time of 16 TADCORE clock periods
    ADCORE_SAMC_0017 = 0b0000001111, // Sampling time of 17 TADCORE clock periods
    ADCORE_SAMC_0018 = 0b0000010000, // Sampling time of 18 TADCORE clock periods
    ADCORE_SAMC_0019 = 0b0000010001, // Sampling time of 19 TADCORE clock periods
    ADCORE_SAMC_0020 = 0b0000010010, // Sampling time of 20 TADCORE clock periods
    ADCORE_SAMC_0021 = 0b0000010011, // Sampling time of 21 TADCORE clock periods
    ADCORE_SAMC_0022 = 0b0000010100, // Sampling time of 22 TADCORE clock periods
    ADCORE_SAMC_0023 = 0b0000010101, // Sampling time of 23 TADCORE clock periods
    ADCORE_SAMC_0024 = 0b0000010110, // Sampling time of 24 TADCORE clock periods
    ADCORE_SAMC_0025 = 0b0000010111, // Sampling time of 25 TADCORE clock periods
    ADCORE_SAMC_0026 = 0b0000011000, // Sampling time of 26 TADCORE clock periods
    ADCORE_SAMC_0027 = 0b0000011001, // Sampling time of 27 TADCORE clock periods
    ADCORE_SAMC_0028 = 0b0000011010, // Sampling time of 28 TADCORE clock periods
    ADCORE_SAMC_0029 = 0b0000011011, // Sampling time of 29 TADCORE clock periods
    ADCORE_SAMC_0030 = 0b0000011100, // Sampling time of 30 TADCORE clock periods
    ADCORE_SAMC_0031 = 0b0000011101, // Sampling time of 31 TADCORE clock periods
    ADCORE_SAMC_0032 = 0b0000011110, // Sampling time of 32 TADCORE clock periods
    ADCORE_SAMC_0033 = 0b0000011111, // Sampling time of 33 TADCORE clock periods
    ADCORE_SAMC_0034 = 0b0000100000, // Sampling time of 34 TADCORE clock periods
    ADCORE_SAMC_0035 = 0b0000100001, // Sampling time of 35 TADCORE clock periods
    ADCORE_SAMC_0036 = 0b0000100010, // Sampling time of 36 TADCORE clock periods
    ADCORE_SAMC_0037 = 0b0000100011, // Sampling time of 37 TADCORE clock periods
    ADCORE_SAMC_0038 = 0b0000100100, // Sampling time of 38 TADCORE clock periods
    ADCORE_SAMC_0039 = 0b0000100101, // Sampling time of 39 TADCORE clock periods
    ADCORE_SAMC_0040 = 0b0000100110, // Sampling time of 40 TADCORE clock periods
    ADCORE_SAMC_0041 = 0b0000100111, // Sampling time of 41 TADCORE clock periods
    ADCORE_SAMC_0042 = 0b0000101000, // Sampling time of 42 TADCORE clock periods
    ADCORE_SAMC_0043 = 0b0000101001, // Sampling time of 43 TADCORE clock periods
    ADCORE_SAMC_0044 = 0b0000101010, // Sampling time of 44 TADCORE clock periods
    ADCORE_SAMC_0045 = 0b0000101011, // Sampling time of 45 TADCORE clock periods
    ADCORE_SAMC_0046 = 0b0000101100, // Sampling time of 46 TADCORE clock periods
    ADCORE_SAMC_0047 = 0b0000101101, // Sampling time of 47 TADCORE clock periods
    ADCORE_SAMC_0048 = 0b0000101110, // Sampling time of 48 TADCORE clock periods
    ADCORE_SAMC_0049 = 0b0000101111, // Sampling time of 49 TADCORE clock periods
    ADCORE_SAMC_0050 = 0b0000110000, // Sampling time of 50 TADCORE clock periods
    ADCORE_SAMC_0051 = 0b0000110001, // Sampling time of 51 TADCORE clock periods
    ADCORE_SAMC_0052 = 0b0000110010, // Sampling time of 52 TADCORE clock periods
    ADCORE_SAMC_0053 = 0b0000110011, // Sampling time of 53 TADCORE clock periods
    ADCORE_SAMC_0054 = 0b0000110100, // Sampling time of 54 TADCORE clock periods
    ADCORE_SAMC_0055 = 0b0000110101, // Sampling time of 55 TADCORE clock periods
    ADCORE_SAMC_0056 = 0b0000110110, // Sampling time of 56 TADCORE clock periods
    ADCORE_SAMC_0057 = 0b0000110111, // Sampling time of 57 TADCORE clock periods
    ADCORE_SAMC_0058 = 0b0000111000, // Sampling time of 58 TADCORE clock periods
    ADCORE_SAMC_0059 = 0b0000111001, // Sampling time of 59 TADCORE clock periods
    ADCORE_SAMC_0060 = 0b0000111010, // Sampling time of 60 TADCORE clock periods
    ADCORE_SAMC_0061 = 0b0000111011, // Sampling time of 61 TADCORE clock periods
    ADCORE_SAMC_0062 = 0b0000111100, // Sampling time of 62 TADCORE clock periods
    ADCORE_SAMC_0063 = 0b0000111101, // Sampling time of 63 TADCORE clock periods
    ADCORE_SAMC_0064 = 0b0000111110, // Sampling time of 64 TADCORE clock periods
    ADCORE_SAMC_0065 = 0b0000111111, // Sampling time of 65 TADCORE clock periods
    ADCORE_SAMC_0066 = 0b0001000000, // Sampling time of 66 TADCORE clock periods
    ADCORE_SAMC_0067 = 0b0001000001, // Sampling time of 67 TADCORE clock periods
    ADCORE_SAMC_0068 = 0b0001000010, // Sampling time of 68 TADCORE clock periods
    ADCORE_SAMC_0069 = 0b0001000011, // Sampling time of 69 TADCORE clock periods
    ADCORE_SAMC_0070 = 0b0001000100, // Sampling time of 70 TADCORE clock periods
    ADCORE_SAMC_0071 = 0b0001000101, // Sampling time of 71 TADCORE clock periods
    ADCORE_SAMC_0072 = 0b0001000110, // Sampling time of 72 TADCORE clock periods
    ADCORE_SAMC_0073 = 0b0001000111, // Sampling time of 73 TADCORE clock periods
    ADCORE_SAMC_0074 = 0b0001001000, // Sampling time of 74 TADCORE clock periods
    ADCORE_SAMC_0075 = 0b0001001001, // Sampling time of 75 TADCORE clock periods
    ADCORE_SAMC_0076 = 0b0001001010, // Sampling time of 76 TADCORE clock periods
    ADCORE_SAMC_0077 = 0b0001001011, // Sampling time of 77 TADCORE clock periods
    ADCORE_SAMC_0078 = 0b0001001100, // Sampling time of 78 TADCORE clock periods
    ADCORE_SAMC_0079 = 0b0001001101, // Sampling time of 79 TADCORE clock periods
    ADCORE_SAMC_0080 = 0b0001001110, // Sampling time of 80 TADCORE clock periods
    ADCORE_SAMC_0081 = 0b0001001111, // Sampling time of 81 TADCORE clock periods
    ADCORE_SAMC_0082 = 0b0001010000, // Sampling time of 82 TADCORE clock periods
    ADCORE_SAMC_0083 = 0b0001010001, // Sampling time of 83 TADCORE clock periods
    ADCORE_SAMC_0084 = 0b0001010010, // Sampling time of 84 TADCORE clock periods
    ADCORE_SAMC_0085 = 0b0001010011, // Sampling time of 85 TADCORE clock periods
    ADCORE_SAMC_0086 = 0b0001010100, // Sampling time of 86 TADCORE clock periods
    ADCORE_SAMC_0087 = 0b0001010101, // Sampling time of 87 TADCORE clock periods
    ADCORE_SAMC_0088 = 0b0001010110, // Sampling time of 88 TADCORE clock periods
    ADCORE_SAMC_0089 = 0b0001010111, // Sampling time of 89 TADCORE clock periods
    ADCORE_SAMC_0090 = 0b0001011000, // Sampling time of 90 TADCORE clock periods
    ADCORE_SAMC_0091 = 0b0001011001, // Sampling time of 91 TADCORE clock periods
    ADCORE_SAMC_0092 = 0b0001011010, // Sampling time of 92 TADCORE clock periods
    ADCORE_SAMC_0093 = 0b0001011011, // Sampling time of 93 TADCORE clock periods
    ADCORE_SAMC_0094 = 0b0001011100, // Sampling time of 94 TADCORE clock periods
    ADCORE_SAMC_0095 = 0b0001011101, // Sampling time of 95 TADCORE clock periods
    ADCORE_SAMC_0096 = 0b0001011110, // Sampling time of 96 TADCORE clock periods
    ADCORE_SAMC_0097 = 0b0001011111, // Sampling time of 97 TADCORE clock periods
    ADCORE_SAMC_0098 = 0b0001100000, // Sampling time of 98 TADCORE clock periods
    ADCORE_SAMC_0099 = 0b0001100001, // Sampling time of 99 TADCORE clock periods
    ADCORE_SAMC_0100 = 0b0001100010, // Sampling time of 100 TADCORE clock periods
    ADCORE_SAMC_0101 = 0b0001100011, // Sampling time of 101 TADCORE clock periods
    ADCORE_SAMC_0102 = 0b0001100100, // Sampling time of 102 TADCORE clock periods
    ADCORE_SAMC_0103 = 0b0001100101, // Sampling time of 103 TADCORE clock periods
    ADCORE_SAMC_0104 = 0b0001100110, // Sampling time of 104 TADCORE clock periods
    ADCORE_SAMC_0105 = 0b0001100111, // Sampling time of 105 TADCORE clock periods
    ADCORE_SAMC_0106 = 0b0001101000, // Sampling time of 106 TADCORE clock periods
    ADCORE_SAMC_0107 = 0b0001101001, // Sampling time of 107 TADCORE clock periods
    ADCORE_SAMC_0108 = 0b0001101010, // Sampling time of 108 TADCORE clock periods
    ADCORE_SAMC_0109 = 0b0001101011, // Sampling time of 109 TADCORE clock periods
    ADCORE_SAMC_0110 = 0b0001101100, // Sampling time of 110 TADCORE clock periods
    ADCORE_SAMC_0111 = 0b0001101101, // Sampling time of 111 TADCORE clock periods
    ADCORE_SAMC_0112 = 0b0001101110, // Sampling time of 112 TADCORE clock periods
    ADCORE_SAMC_0113 = 0b0001101111, // Sampling time of 113 TADCORE clock periods
    ADCORE_SAMC_0114 = 0b0001110000, // Sampling time of 114 TADCORE clock periods
    ADCORE_SAMC_0115 = 0b0001110001, // Sampling time of 115 TADCORE clock periods
    ADCORE_SAMC_0116 = 0b0001110010, // Sampling time of 116 TADCORE clock periods
    ADCORE_SAMC_0117 = 0b0001110011, // Sampling time of 117 TADCORE clock periods
    ADCORE_SAMC_0118 = 0b0001110100, // Sampling time of 118 TADCORE clock periods
    ADCORE_SAMC_0119 = 0b0001110101, // Sampling time of 119 TADCORE clock periods
    ADCORE_SAMC_0120 = 0b0001110110, // Sampling time of 120 TADCORE clock periods
    ADCORE_SAMC_0121 = 0b0001110111, // Sampling time of 121 TADCORE clock periods
    ADCORE_SAMC_0122 = 0b0001111000, // Sampling time of 122 TADCORE clock periods
    ADCORE_SAMC_0123 = 0b0001111001, // Sampling time of 123 TADCORE clock periods
    ADCORE_SAMC_0124 = 0b0001111010, // Sampling time of 124 TADCORE clock periods
    ADCORE_SAMC_0125 = 0b0001111011, // Sampling time of 125 TADCORE clock periods
    ADCORE_SAMC_0126 = 0b0001111100, // Sampling time of 126 TADCORE clock periods
    ADCORE_SAMC_0127 = 0b0001111101, // Sampling time of 127 TADCORE clock periods
    ADCORE_SAMC_0128 = 0b0001111110, // Sampling time of 128 TADCORE clock periods
    ADCORE_SAMC_0129 = 0b0001111111, // Sampling time of 129 TADCORE clock periods
    ADCORE_SAMC_0130 = 0b0010000000, // Sampling time of 130 TADCORE clock periods
    ADCORE_SAMC_0131 = 0b0010000001, // Sampling time of 131 TADCORE clock periods
    ADCORE_SAMC_0132 = 0b0010000010, // Sampling time of 132 TADCORE clock periods
    ADCORE_SAMC_0133 = 0b0010000011, // Sampling time of 133 TADCORE clock periods
    ADCORE_SAMC_0134 = 0b0010000100, // Sampling time of 134 TADCORE clock periods
    ADCORE_SAMC_0135 = 0b0010000101, // Sampling time of 135 TADCORE clock periods
    ADCORE_SAMC_0136 = 0b0010000110, // Sampling time of 136 TADCORE clock periods
    ADCORE_SAMC_0137 = 0b0010000111, // Sampling time of 137 TADCORE clock periods
    ADCORE_SAMC_0138 = 0b0010001000, // Sampling time of 138 TADCORE clock periods
    ADCORE_SAMC_0139 = 0b0010001001, // Sampling time of 139 TADCORE clock periods
    ADCORE_SAMC_0140 = 0b0010001010, // Sampling time of 140 TADCORE clock periods
    ADCORE_SAMC_0141 = 0b0010001011, // Sampling time of 141 TADCORE clock periods
    ADCORE_SAMC_0142 = 0b0010001100, // Sampling time of 142 TADCORE clock periods
    ADCORE_SAMC_0143 = 0b0010001101, // Sampling time of 143 TADCORE clock periods
    ADCORE_SAMC_0144 = 0b0010001110, // Sampling time of 144 TADCORE clock periods
    ADCORE_SAMC_0145 = 0b0010001111, // Sampling time of 145 TADCORE clock periods
    ADCORE_SAMC_0146 = 0b0010010000, // Sampling time of 146 TADCORE clock periods
    ADCORE_SAMC_0147 = 0b0010010001, // Sampling time of 147 TADCORE clock periods
    ADCORE_SAMC_0148 = 0b0010010010, // Sampling time of 148 TADCORE clock periods
    ADCORE_SAMC_0149 = 0b0010010011, // Sampling time of 149 TADCORE clock periods
    ADCORE_SAMC_0150 = 0b0010010100, // Sampling time of 150 TADCORE clock periods
    ADCORE_SAMC_0151 = 0b0010010101, // Sampling time of 151 TADCORE clock periods
    ADCORE_SAMC_0152 = 0b0010010110, // Sampling time of 152 TADCORE clock periods
    ADCORE_SAMC_0153 = 0b0010010111, // Sampling time of 153 TADCORE clock periods
    ADCORE_SAMC_0154 = 0b0010011000, // Sampling time of 154 TADCORE clock periods
    ADCORE_SAMC_0155 = 0b0010011001, // Sampling time of 155 TADCORE clock periods
    ADCORE_SAMC_0156 = 0b0010011010, // Sampling time of 156 TADCORE clock periods
    ADCORE_SAMC_0157 = 0b0010011011, // Sampling time of 157 TADCORE clock periods
    ADCORE_SAMC_0158 = 0b0010011100, // Sampling time of 158 TADCORE clock periods
    ADCORE_SAMC_0159 = 0b0010011101, // Sampling time of 159 TADCORE clock periods
    ADCORE_SAMC_0160 = 0b0010011110, // Sampling time of 160 TADCORE clock periods
    ADCORE_SAMC_0161 = 0b0010011111, // Sampling time of 161 TADCORE clock periods
    ADCORE_SAMC_0162 = 0b0010100000, // Sampling time of 162 TADCORE clock periods
    ADCORE_SAMC_0163 = 0b0010100001, // Sampling time of 163 TADCORE clock periods
    ADCORE_SAMC_0164 = 0b0010100010, // Sampling time of 164 TADCORE clock periods
    ADCORE_SAMC_0165 = 0b0010100011, // Sampling time of 165 TADCORE clock periods
    ADCORE_SAMC_0166 = 0b0010100100, // Sampling time of 166 TADCORE clock periods
    ADCORE_SAMC_0167 = 0b0010100101, // Sampling time of 167 TADCORE clock periods
    ADCORE_SAMC_0168 = 0b0010100110, // Sampling time of 168 TADCORE clock periods
    ADCORE_SAMC_0169 = 0b0010100111, // Sampling time of 169 TADCORE clock periods
    ADCORE_SAMC_0170 = 0b0010101000, // Sampling time of 170 TADCORE clock periods
    ADCORE_SAMC_0171 = 0b0010101001, // Sampling time of 171 TADCORE clock periods
    ADCORE_SAMC_0172 = 0b0010101010, // Sampling time of 172 TADCORE clock periods
    ADCORE_SAMC_0173 = 0b0010101011, // Sampling time of 173 TADCORE clock periods
    ADCORE_SAMC_0174 = 0b0010101100, // Sampling time of 174 TADCORE clock periods
    ADCORE_SAMC_0175 = 0b0010101101, // Sampling time of 175 TADCORE clock periods
    ADCORE_SAMC_0176 = 0b0010101110, // Sampling time of 176 TADCORE clock periods
    ADCORE_SAMC_0177 = 0b0010101111, // Sampling time of 177 TADCORE clock periods
    ADCORE_SAMC_0178 = 0b0010110000, // Sampling time of 178 TADCORE clock periods
    ADCORE_SAMC_0179 = 0b0010110001, // Sampling time of 179 TADCORE clock periods
    ADCORE_SAMC_0180 = 0b0010110010, // Sampling time of 180 TADCORE clock periods
    ADCORE_SAMC_0181 = 0b0010110011, // Sampling time of 181 TADCORE clock periods
    ADCORE_SAMC_0182 = 0b0010110100, // Sampling time of 182 TADCORE clock periods
    ADCORE_SAMC_0183 = 0b0010110101, // Sampling time of 183 TADCORE clock periods
    ADCORE_SAMC_0184 = 0b0010110110, // Sampling time of 184 TADCORE clock periods
    ADCORE_SAMC_0185 = 0b0010110111, // Sampling time of 185 TADCORE clock periods
    ADCORE_SAMC_0186 = 0b0010111000, // Sampling time of 186 TADCORE clock periods
    ADCORE_SAMC_0187 = 0b0010111001, // Sampling time of 187 TADCORE clock periods
    ADCORE_SAMC_0188 = 0b0010111010, // Sampling time of 188 TADCORE clock periods
    ADCORE_SAMC_0189 = 0b0010111011, // Sampling time of 189 TADCORE clock periods
    ADCORE_SAMC_0190 = 0b0010111100, // Sampling time of 190 TADCORE clock periods
    ADCORE_SAMC_0191 = 0b0010111101, // Sampling time of 191 TADCORE clock periods
    ADCORE_SAMC_0192 = 0b0010111110, // Sampling time of 192 TADCORE clock periods
    ADCORE_SAMC_0193 = 0b0010111111, // Sampling time of 193 TADCORE clock periods
    ADCORE_SAMC_0194 = 0b0011000000, // Sampling time of 194 TADCORE clock periods
    ADCORE_SAMC_0195 = 0b0011000001, // Sampling time of 195 TADCORE clock periods
    ADCORE_SAMC_0196 = 0b0011000010, // Sampling time of 196 TADCORE clock periods
    ADCORE_SAMC_0197 = 0b0011000011, // Sampling time of 197 TADCORE clock periods
    ADCORE_SAMC_0198 = 0b0011000100, // Sampling time of 198 TADCORE clock periods
    ADCORE_SAMC_0199 = 0b0011000101, // Sampling time of 199 TADCORE clock periods
    ADCORE_SAMC_0200 = 0b0011000110, // Sampling time of 200 TADCORE clock periods
    ADCORE_SAMC_0201 = 0b0011000111, // Sampling time of 201 TADCORE clock periods
    ADCORE_SAMC_0202 = 0b0011001000, // Sampling time of 202 TADCORE clock periods
    ADCORE_SAMC_0203 = 0b0011001001, // Sampling time of 203 TADCORE clock periods
    ADCORE_SAMC_0204 = 0b0011001010, // Sampling time of 204 TADCORE clock periods
    ADCORE_SAMC_0205 = 0b0011001011, // Sampling time of 205 TADCORE clock periods
    ADCORE_SAMC_0206 = 0b0011001100, // Sampling time of 206 TADCORE clock periods
    ADCORE_SAMC_0207 = 0b0011001101, // Sampling time of 207 TADCORE clock periods
    ADCORE_SAMC_0208 = 0b0011001110, // Sampling time of 208 TADCORE clock periods
    ADCORE_SAMC_0209 = 0b0011001111, // Sampling time of 209 TADCORE clock periods
    ADCORE_SAMC_0210 = 0b0011010000, // Sampling time of 210 TADCORE clock periods
    ADCORE_SAMC_0211 = 0b0011010001, // Sampling time of 211 TADCORE clock periods
    ADCORE_SAMC_0212 = 0b0011010010, // Sampling time of 212 TADCORE clock periods
    ADCORE_SAMC_0213 = 0b0011010011, // Sampling time of 213 TADCORE clock periods
    ADCORE_SAMC_0214 = 0b0011010100, // Sampling time of 214 TADCORE clock periods
    ADCORE_SAMC_0215 = 0b0011010101, // Sampling time of 215 TADCORE clock periods
    ADCORE_SAMC_0216 = 0b0011010110, // Sampling time of 216 TADCORE clock periods
    ADCORE_SAMC_0217 = 0b0011010111, // Sampling time of 217 TADCORE clock periods
    ADCORE_SAMC_0218 = 0b0011011000, // Sampling time of 218 TADCORE clock periods
    ADCORE_SAMC_0219 = 0b0011011001, // Sampling time of 219 TADCORE clock periods
    ADCORE_SAMC_0220 = 0b0011011010, // Sampling time of 220 TADCORE clock periods
    ADCORE_SAMC_0221 = 0b0011011011, // Sampling time of 221 TADCORE clock periods
    ADCORE_SAMC_0222 = 0b0011011100, // Sampling time of 222 TADCORE clock periods
    ADCORE_SAMC_0223 = 0b0011011101, // Sampling time of 223 TADCORE clock periods
    ADCORE_SAMC_0224 = 0b0011011110, // Sampling time of 224 TADCORE clock periods
    ADCORE_SAMC_0225 = 0b0011011111, // Sampling time of 225 TADCORE clock periods
    ADCORE_SAMC_0226 = 0b0011100000, // Sampling time of 226 TADCORE clock periods
    ADCORE_SAMC_0227 = 0b0011100001, // Sampling time of 227 TADCORE clock periods
    ADCORE_SAMC_0228 = 0b0011100010, // Sampling time of 228 TADCORE clock periods
    ADCORE_SAMC_0229 = 0b0011100011, // Sampling time of 229 TADCORE clock periods
    ADCORE_SAMC_0230 = 0b0011100100, // Sampling time of 230 TADCORE clock periods
    ADCORE_SAMC_0231 = 0b0011100101, // Sampling time of 231 TADCORE clock periods
    ADCORE_SAMC_0232 = 0b0011100110, // Sampling time of 232 TADCORE clock periods
    ADCORE_SAMC_0233 = 0b0011100111, // Sampling time of 233 TADCORE clock periods
    ADCORE_SAMC_0234 = 0b0011101000, // Sampling time of 234 TADCORE clock periods
    ADCORE_SAMC_0235 = 0b0011101001, // Sampling time of 235 TADCORE clock periods
    ADCORE_SAMC_0236 = 0b0011101010, // Sampling time of 236 TADCORE clock periods
    ADCORE_SAMC_0237 = 0b0011101011, // Sampling time of 237 TADCORE clock periods
    ADCORE_SAMC_0238 = 0b0011101100, // Sampling time of 238 TADCORE clock periods
    ADCORE_SAMC_0239 = 0b0011101101, // Sampling time of 239 TADCORE clock periods
    ADCORE_SAMC_0240 = 0b0011101110, // Sampling time of 240 TADCORE clock periods
    ADCORE_SAMC_0241 = 0b0011101111, // Sampling time of 241 TADCORE clock periods
    ADCORE_SAMC_0242 = 0b0011110000, // Sampling time of 242 TADCORE clock periods
    ADCORE_SAMC_0243 = 0b0011110001, // Sampling time of 243 TADCORE clock periods
    ADCORE_SAMC_0244 = 0b0011110010, // Sampling time of 244 TADCORE clock periods
    ADCORE_SAMC_0245 = 0b0011110011, // Sampling time of 245 TADCORE clock periods
    ADCORE_SAMC_0246 = 0b0011110100, // Sampling time of 246 TADCORE clock periods
    ADCORE_SAMC_0247 = 0b0011110101, // Sampling time of 247 TADCORE clock periods
    ADCORE_SAMC_0248 = 0b0011110110, // Sampling time of 248 TADCORE clock periods
    ADCORE_SAMC_0249 = 0b0011110111, // Sampling time of 249 TADCORE clock periods
    ADCORE_SAMC_0250 = 0b0011111000, // Sampling time of 250 TADCORE clock periods
    ADCORE_SAMC_0251 = 0b0011111001, // Sampling time of 251 TADCORE clock periods
    ADCORE_SAMC_0252 = 0b0011111010, // Sampling time of 252 TADCORE clock periods
    ADCORE_SAMC_0253 = 0b0011111011, // Sampling time of 253 TADCORE clock periods
    ADCORE_SAMC_0254 = 0b0011111100, // Sampling time of 254 TADCORE clock periods
    ADCORE_SAMC_0255 = 0b0011111101, // Sampling time of 255 TADCORE clock periods
    ADCORE_SAMC_0256 = 0b0011111110, // Sampling time of 256 TADCORE clock periods
    ADCORE_SAMC_0257 = 0b0011111111, // Sampling time of 257 TADCORE clock periods
    ADCORE_SAMC_0258 = 0b0100000000, // Sampling time of 258 TADCORE clock periods
    ADCORE_SAMC_0259 = 0b0100000001, // Sampling time of 259 TADCORE clock periods
    ADCORE_SAMC_0260 = 0b0100000010, // Sampling time of 260 TADCORE clock periods
    ADCORE_SAMC_0261 = 0b0100000011, // Sampling time of 261 TADCORE clock periods
    ADCORE_SAMC_0262 = 0b0100000100, // Sampling time of 262 TADCORE clock periods
    ADCORE_SAMC_0263 = 0b0100000101, // Sampling time of 263 TADCORE clock periods
    ADCORE_SAMC_0264 = 0b0100000110, // Sampling time of 264 TADCORE clock periods
    ADCORE_SAMC_0265 = 0b0100000111, // Sampling time of 265 TADCORE clock periods
    ADCORE_SAMC_0266 = 0b0100001000, // Sampling time of 266 TADCORE clock periods
    ADCORE_SAMC_0267 = 0b0100001001, // Sampling time of 267 TADCORE clock periods
    ADCORE_SAMC_0268 = 0b0100001010, // Sampling time of 268 TADCORE clock periods
    ADCORE_SAMC_0269 = 0b0100001011, // Sampling time of 269 TADCORE clock periods
    ADCORE_SAMC_0270 = 0b0100001100, // Sampling time of 270 TADCORE clock periods
    ADCORE_SAMC_0271 = 0b0100001101, // Sampling time of 271 TADCORE clock periods
    ADCORE_SAMC_0272 = 0b0100001110, // Sampling time of 272 TADCORE clock periods
    ADCORE_SAMC_0273 = 0b0100001111, // Sampling time of 273 TADCORE clock periods
    ADCORE_SAMC_0274 = 0b0100010000, // Sampling time of 274 TADCORE clock periods
    ADCORE_SAMC_0275 = 0b0100010001, // Sampling time of 275 TADCORE clock periods
