microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_adc.h
    ADCORE_SAMC_0276 = 0b0100010010, // Sampling time of 276 TADCORE clock periods
    ADCORE_SAMC_0277 = 0b0100010011, // Sampling time of 277 TADCORE clock periods
    ADCORE_SAMC_0278 = 0b0100010100, // Sampling time of 278 TADCORE clock periods
    ADCORE_SAMC_0279 = 0b0100010101, // Sampling time of 279 TADCORE clock periods
    ADCORE_SAMC_0280 = 0b0100010110, // Sampling time of 280 TADCORE clock periods
    ADCORE_SAMC_0281 = 0b0100010111, // Sampling time of 281 TADCORE clock periods
    ADCORE_SAMC_0282 = 0b0100011000, // Sampling time of 282 TADCORE clock periods
    ADCORE_SAMC_0283 = 0b0100011001, // Sampling time of 283 TADCORE clock periods
    ADCORE_SAMC_0284 = 0b0100011010, // Sampling time of 284 TADCORE clock periods
    ADCORE_SAMC_0285 = 0b0100011011, // Sampling time of 285 TADCORE clock periods
    ADCORE_SAMC_0286 = 0b0100011100, // Sampling time of 286 TADCORE clock periods
    ADCORE_SAMC_0287 = 0b0100011101, // Sampling time of 287 TADCORE clock periods
    ADCORE_SAMC_0288 = 0b0100011110, // Sampling time of 288 TADCORE clock periods
    ADCORE_SAMC_0289 = 0b0100011111, // Sampling time of 289 TADCORE clock periods
    ADCORE_SAMC_0290 = 0b0100100000, // Sampling time of 290 TADCORE clock periods
    ADCORE_SAMC_0291 = 0b0100100001, // Sampling time of 291 TADCORE clock periods
    ADCORE_SAMC_0292 = 0b0100100010, // Sampling time of 292 TADCORE clock periods
    ADCORE_SAMC_0293 = 0b0100100011, // Sampling time of 293 TADCORE clock periods
    ADCORE_SAMC_0294 = 0b0100100100, // Sampling time of 294 TADCORE clock periods
    ADCORE_SAMC_0295 = 0b0100100101, // Sampling time of 295 TADCORE clock periods
    ADCORE_SAMC_0296 = 0b0100100110, // Sampling time of 296 TADCORE clock periods
    ADCORE_SAMC_0297 = 0b0100100111, // Sampling time of 297 TADCORE clock periods
    ADCORE_SAMC_0298 = 0b0100101000, // Sampling time of 298 TADCORE clock periods
    ADCORE_SAMC_0299 = 0b0100101001, // Sampling time of 299 TADCORE clock periods
    ADCORE_SAMC_0300 = 0b0100101010, // Sampling time of 300 TADCORE clock periods
    ADCORE_SAMC_0301 = 0b0100101011, // Sampling time of 301 TADCORE clock periods
    ADCORE_SAMC_0302 = 0b0100101100, // Sampling time of 302 TADCORE clock periods
    ADCORE_SAMC_0303 = 0b0100101101, // Sampling time of 303 TADCORE clock periods
    ADCORE_SAMC_0304 = 0b0100101110, // Sampling time of 304 TADCORE clock periods
    ADCORE_SAMC_0305 = 0b0100101111, // Sampling time of 305 TADCORE clock periods
    ADCORE_SAMC_0306 = 0b0100110000, // Sampling time of 306 TADCORE clock periods
    ADCORE_SAMC_0307 = 0b0100110001, // Sampling time of 307 TADCORE clock periods
    ADCORE_SAMC_0308 = 0b0100110010, // Sampling time of 308 TADCORE clock periods
    ADCORE_SAMC_0309 = 0b0100110011, // Sampling time of 309 TADCORE clock periods
    ADCORE_SAMC_0310 = 0b0100110100, // Sampling time of 310 TADCORE clock periods
    ADCORE_SAMC_0311 = 0b0100110101, // Sampling time of 311 TADCORE clock periods
    ADCORE_SAMC_0312 = 0b0100110110, // Sampling time of 312 TADCORE clock periods
    ADCORE_SAMC_0313 = 0b0100110111, // Sampling time of 313 TADCORE clock periods
    ADCORE_SAMC_0314 = 0b0100111000, // Sampling time of 314 TADCORE clock periods
    ADCORE_SAMC_0315 = 0b0100111001, // Sampling time of 315 TADCORE clock periods
    ADCORE_SAMC_0316 = 0b0100111010, // Sampling time of 316 TADCORE clock periods
    ADCORE_SAMC_0317 = 0b0100111011, // Sampling time of 317 TADCORE clock periods
    ADCORE_SAMC_0318 = 0b0100111100, // Sampling time of 318 TADCORE clock periods
    ADCORE_SAMC_0319 = 0b0100111101, // Sampling time of 319 TADCORE clock periods
    ADCORE_SAMC_0320 = 0b0100111110, // Sampling time of 320 TADCORE clock periods
    ADCORE_SAMC_0321 = 0b0100111111, // Sampling time of 321 TADCORE clock periods
    ADCORE_SAMC_0322 = 0b0101000000, // Sampling time of 322 TADCORE clock periods
    ADCORE_SAMC_0323 = 0b0101000001, // Sampling time of 323 TADCORE clock periods
    ADCORE_SAMC_0324 = 0b0101000010, // Sampling time of 324 TADCORE clock periods
    ADCORE_SAMC_0325 = 0b0101000011, // Sampling time of 325 TADCORE clock periods
    ADCORE_SAMC_0326 = 0b0101000100, // Sampling time of 326 TADCORE clock periods
    ADCORE_SAMC_0327 = 0b0101000101, // Sampling time of 327 TADCORE clock periods
    ADCORE_SAMC_0328 = 0b0101000110, // Sampling time of 328 TADCORE clock periods
    ADCORE_SAMC_0329 = 0b0101000111, // Sampling time of 329 TADCORE clock periods
    ADCORE_SAMC_0330 = 0b0101001000, // Sampling time of 330 TADCORE clock periods
    ADCORE_SAMC_0331 = 0b0101001001, // Sampling time of 331 TADCORE clock periods
    ADCORE_SAMC_0332 = 0b0101001010, // Sampling time of 332 TADCORE clock periods
    ADCORE_SAMC_0333 = 0b0101001011, // Sampling time of 333 TADCORE clock periods
    ADCORE_SAMC_0334 = 0b0101001100, // Sampling time of 334 TADCORE clock periods
    ADCORE_SAMC_0335 = 0b0101001101, // Sampling time of 335 TADCORE clock periods
    ADCORE_SAMC_0336 = 0b0101001110, // Sampling time of 336 TADCORE clock periods
    ADCORE_SAMC_0337 = 0b0101001111, // Sampling time of 337 TADCORE clock periods
    ADCORE_SAMC_0338 = 0b0101010000, // Sampling time of 338 TADCORE clock periods
    ADCORE_SAMC_0339 = 0b0101010001, // Sampling time of 339 TADCORE clock periods
    ADCORE_SAMC_0340 = 0b0101010010, // Sampling time of 340 TADCORE clock periods
    ADCORE_SAMC_0341 = 0b0101010011, // Sampling time of 341 TADCORE clock periods
    ADCORE_SAMC_0342 = 0b0101010100, // Sampling time of 342 TADCORE clock periods
    ADCORE_SAMC_0343 = 0b0101010101, // Sampling time of 343 TADCORE clock periods
    ADCORE_SAMC_0344 = 0b0101010110, // Sampling time of 344 TADCORE clock periods
    ADCORE_SAMC_0345 = 0b0101010111, // Sampling time of 345 TADCORE clock periods
    ADCORE_SAMC_0346 = 0b0101011000, // Sampling time of 346 TADCORE clock periods
    ADCORE_SAMC_0347 = 0b0101011001, // Sampling time of 347 TADCORE clock periods
    ADCORE_SAMC_0348 = 0b0101011010, // Sampling time of 348 TADCORE clock periods
    ADCORE_SAMC_0349 = 0b0101011011, // Sampling time of 349 TADCORE clock periods
    ADCORE_SAMC_0350 = 0b0101011100, // Sampling time of 350 TADCORE clock periods
    ADCORE_SAMC_0351 = 0b0101011101, // Sampling time of 351 TADCORE clock periods
    ADCORE_SAMC_0352 = 0b0101011110, // Sampling time of 352 TADCORE clock periods
    ADCORE_SAMC_0353 = 0b0101011111, // Sampling time of 353 TADCORE clock periods
    ADCORE_SAMC_0354 = 0b0101100000, // Sampling time of 354 TADCORE clock periods
    ADCORE_SAMC_0355 = 0b0101100001, // Sampling time of 355 TADCORE clock periods
    ADCORE_SAMC_0356 = 0b0101100010, // Sampling time of 356 TADCORE clock periods
    ADCORE_SAMC_0357 = 0b0101100011, // Sampling time of 357 TADCORE clock periods
    ADCORE_SAMC_0358 = 0b0101100100, // Sampling time of 358 TADCORE clock periods
    ADCORE_SAMC_0359 = 0b0101100101, // Sampling time of 359 TADCORE clock periods
    ADCORE_SAMC_0360 = 0b0101100110, // Sampling time of 360 TADCORE clock periods
    ADCORE_SAMC_0361 = 0b0101100111, // Sampling time of 361 TADCORE clock periods
    ADCORE_SAMC_0362 = 0b0101101000, // Sampling time of 362 TADCORE clock periods
    ADCORE_SAMC_0363 = 0b0101101001, // Sampling time of 363 TADCORE clock periods
    ADCORE_SAMC_0364 = 0b0101101010, // Sampling time of 364 TADCORE clock periods
    ADCORE_SAMC_0365 = 0b0101101011, // Sampling time of 365 TADCORE clock periods
    ADCORE_SAMC_0366 = 0b0101101100, // Sampling time of 366 TADCORE clock periods
    ADCORE_SAMC_0367 = 0b0101101101, // Sampling time of 367 TADCORE clock periods
    ADCORE_SAMC_0368 = 0b0101101110, // Sampling time of 368 TADCORE clock periods
    ADCORE_SAMC_0369 = 0b0101101111, // Sampling time of 369 TADCORE clock periods
    ADCORE_SAMC_0370 = 0b0101110000, // Sampling time of 370 TADCORE clock periods
    ADCORE_SAMC_0371 = 0b0101110001, // Sampling time of 371 TADCORE clock periods
    ADCORE_SAMC_0372 = 0b0101110010, // Sampling time of 372 TADCORE clock periods
    ADCORE_SAMC_0373 = 0b0101110011, // Sampling time of 373 TADCORE clock periods
    ADCORE_SAMC_0374 = 0b0101110100, // Sampling time of 374 TADCORE clock periods
    ADCORE_SAMC_0375 = 0b0101110101, // Sampling time of 375 TADCORE clock periods
    ADCORE_SAMC_0376 = 0b0101110110, // Sampling time of 376 TADCORE clock periods
    ADCORE_SAMC_0377 = 0b0101110111, // Sampling time of 377 TADCORE clock periods
    ADCORE_SAMC_0378 = 0b0101111000, // Sampling time of 378 TADCORE clock periods
    ADCORE_SAMC_0379 = 0b0101111001, // Sampling time of 379 TADCORE clock periods
    ADCORE_SAMC_0380 = 0b0101111010, // Sampling time of 380 TADCORE clock periods
    ADCORE_SAMC_0381 = 0b0101111011, // Sampling time of 381 TADCORE clock periods
    ADCORE_SAMC_0382 = 0b0101111100, // Sampling time of 382 TADCORE clock periods
    ADCORE_SAMC_0383 = 0b0101111101, // Sampling time of 383 TADCORE clock periods
    ADCORE_SAMC_0384 = 0b0101111110, // Sampling time of 384 TADCORE clock periods
    ADCORE_SAMC_0385 = 0b0101111111, // Sampling time of 385 TADCORE clock periods
    ADCORE_SAMC_0386 = 0b0110000000, // Sampling time of 386 TADCORE clock periods
    ADCORE_SAMC_0387 = 0b0110000001, // Sampling time of 387 TADCORE clock periods
    ADCORE_SAMC_0388 = 0b0110000010, // Sampling time of 388 TADCORE clock periods
    ADCORE_SAMC_0389 = 0b0110000011, // Sampling time of 389 TADCORE clock periods
    ADCORE_SAMC_0390 = 0b0110000100, // Sampling time of 390 TADCORE clock periods
    ADCORE_SAMC_0391 = 0b0110000101, // Sampling time of 391 TADCORE clock periods
    ADCORE_SAMC_0392 = 0b0110000110, // Sampling time of 392 TADCORE clock periods
    ADCORE_SAMC_0393 = 0b0110000111, // Sampling time of 393 TADCORE clock periods
    ADCORE_SAMC_0394 = 0b0110001000, // Sampling time of 394 TADCORE clock periods
    ADCORE_SAMC_0395 = 0b0110001001, // Sampling time of 395 TADCORE clock periods
    ADCORE_SAMC_0396 = 0b0110001010, // Sampling time of 396 TADCORE clock periods
    ADCORE_SAMC_0397 = 0b0110001011, // Sampling time of 397 TADCORE clock periods
    ADCORE_SAMC_0398 = 0b0110001100, // Sampling time of 398 TADCORE clock periods
    ADCORE_SAMC_0399 = 0b0110001101, // Sampling time of 399 TADCORE clock periods
    ADCORE_SAMC_0400 = 0b0110001110, // Sampling time of 400 TADCORE clock periods
    ADCORE_SAMC_0401 = 0b0110001111, // Sampling time of 401 TADCORE clock periods
    ADCORE_SAMC_0402 = 0b0110010000, // Sampling time of 402 TADCORE clock periods
    ADCORE_SAMC_0403 = 0b0110010001, // Sampling time of 403 TADCORE clock periods
    ADCORE_SAMC_0404 = 0b0110010010, // Sampling time of 404 TADCORE clock periods
    ADCORE_SAMC_0405 = 0b0110010011, // Sampling time of 405 TADCORE clock periods
    ADCORE_SAMC_0406 = 0b0110010100, // Sampling time of 406 TADCORE clock periods
    ADCORE_SAMC_0407 = 0b0110010101, // Sampling time of 407 TADCORE clock periods
    ADCORE_SAMC_0408 = 0b0110010110, // Sampling time of 408 TADCORE clock periods
    ADCORE_SAMC_0409 = 0b0110010111, // Sampling time of 409 TADCORE clock periods
    ADCORE_SAMC_0410 = 0b0110011000, // Sampling time of 410 TADCORE clock periods
    ADCORE_SAMC_0411 = 0b0110011001, // Sampling time of 411 TADCORE clock periods
    ADCORE_SAMC_0412 = 0b0110011010, // Sampling time of 412 TADCORE clock periods
    ADCORE_SAMC_0413 = 0b0110011011, // Sampling time of 413 TADCORE clock periods
    ADCORE_SAMC_0414 = 0b0110011100, // Sampling time of 414 TADCORE clock periods
    ADCORE_SAMC_0415 = 0b0110011101, // Sampling time of 415 TADCORE clock periods
    ADCORE_SAMC_0416 = 0b0110011110, // Sampling time of 416 TADCORE clock periods
    ADCORE_SAMC_0417 = 0b0110011111, // Sampling time of 417 TADCORE clock periods
    ADCORE_SAMC_0418 = 0b0110100000, // Sampling time of 418 TADCORE clock periods
    ADCORE_SAMC_0419 = 0b0110100001, // Sampling time of 419 TADCORE clock periods
    ADCORE_SAMC_0420 = 0b0110100010, // Sampling time of 420 TADCORE clock periods
    ADCORE_SAMC_0421 = 0b0110100011, // Sampling time of 421 TADCORE clock periods
    ADCORE_SAMC_0422 = 0b0110100100, // Sampling time of 422 TADCORE clock periods
    ADCORE_SAMC_0423 = 0b0110100101, // Sampling time of 423 TADCORE clock periods
    ADCORE_SAMC_0424 = 0b0110100110, // Sampling time of 424 TADCORE clock periods
    ADCORE_SAMC_0425 = 0b0110100111, // Sampling time of 425 TADCORE clock periods
    ADCORE_SAMC_0426 = 0b0110101000, // Sampling time of 426 TADCORE clock periods
    ADCORE_SAMC_0427 = 0b0110101001, // Sampling time of 427 TADCORE clock periods
    ADCORE_SAMC_0428 = 0b0110101010, // Sampling time of 428 TADCORE clock periods
    ADCORE_SAMC_0429 = 0b0110101011, // Sampling time of 429 TADCORE clock periods
    ADCORE_SAMC_0430 = 0b0110101100, // Sampling time of 430 TADCORE clock periods
    ADCORE_SAMC_0431 = 0b0110101101, // Sampling time of 431 TADCORE clock periods
    ADCORE_SAMC_0432 = 0b0110101110, // Sampling time of 432 TADCORE clock periods
    ADCORE_SAMC_0433 = 0b0110101111, // Sampling time of 433 TADCORE clock periods
    ADCORE_SAMC_0434 = 0b0110110000, // Sampling time of 434 TADCORE clock periods
    ADCORE_SAMC_0435 = 0b0110110001, // Sampling time of 435 TADCORE clock periods
    ADCORE_SAMC_0436 = 0b0110110010, // Sampling time of 436 TADCORE clock periods
    ADCORE_SAMC_0437 = 0b0110110011, // Sampling time of 437 TADCORE clock periods
    ADCORE_SAMC_0438 = 0b0110110100, // Sampling time of 438 TADCORE clock periods
    ADCORE_SAMC_0439 = 0b0110110101, // Sampling time of 439 TADCORE clock periods
    ADCORE_SAMC_0440 = 0b0110110110, // Sampling time of 440 TADCORE clock periods
    ADCORE_SAMC_0441 = 0b0110110111, // Sampling time of 441 TADCORE clock periods
    ADCORE_SAMC_0442 = 0b0110111000, // Sampling time of 442 TADCORE clock periods
    ADCORE_SAMC_0443 = 0b0110111001, // Sampling time of 443 TADCORE clock periods
    ADCORE_SAMC_0444 = 0b0110111010, // Sampling time of 444 TADCORE clock periods
    ADCORE_SAMC_0445 = 0b0110111011, // Sampling time of 445 TADCORE clock periods
    ADCORE_SAMC_0446 = 0b0110111100, // Sampling time of 446 TADCORE clock periods
    ADCORE_SAMC_0447 = 0b0110111101, // Sampling time of 447 TADCORE clock periods
    ADCORE_SAMC_0448 = 0b0110111110, // Sampling time of 448 TADCORE clock periods
    ADCORE_SAMC_0449 = 0b0110111111, // Sampling time of 449 TADCORE clock periods
    ADCORE_SAMC_0450 = 0b0111000000, // Sampling time of 450 TADCORE clock periods
    ADCORE_SAMC_0451 = 0b0111000001, // Sampling time of 451 TADCORE clock periods
    ADCORE_SAMC_0452 = 0b0111000010, // Sampling time of 452 TADCORE clock periods
    ADCORE_SAMC_0453 = 0b0111000011, // Sampling time of 453 TADCORE clock periods
    ADCORE_SAMC_0454 = 0b0111000100, // Sampling time of 454 TADCORE clock periods
    ADCORE_SAMC_0455 = 0b0111000101, // Sampling time of 455 TADCORE clock periods
    ADCORE_SAMC_0456 = 0b0111000110, // Sampling time of 456 TADCORE clock periods
    ADCORE_SAMC_0457 = 0b0111000111, // Sampling time of 457 TADCORE clock periods
    ADCORE_SAMC_0458 = 0b0111001000, // Sampling time of 458 TADCORE clock periods
    ADCORE_SAMC_0459 = 0b0111001001, // Sampling time of 459 TADCORE clock periods
    ADCORE_SAMC_0460 = 0b0111001010, // Sampling time of 460 TADCORE clock periods
    ADCORE_SAMC_0461 = 0b0111001011, // Sampling time of 461 TADCORE clock periods
    ADCORE_SAMC_0462 = 0b0111001100, // Sampling time of 462 TADCORE clock periods
    ADCORE_SAMC_0463 = 0b0111001101, // Sampling time of 463 TADCORE clock periods
    ADCORE_SAMC_0464 = 0b0111001110, // Sampling time of 464 TADCORE clock periods
    ADCORE_SAMC_0465 = 0b0111001111, // Sampling time of 465 TADCORE clock periods
    ADCORE_SAMC_0466 = 0b0111010000, // Sampling time of 466 TADCORE clock periods
    ADCORE_SAMC_0467 = 0b0111010001, // Sampling time of 467 TADCORE clock periods
    ADCORE_SAMC_0468 = 0b0111010010, // Sampling time of 468 TADCORE clock periods
    ADCORE_SAMC_0469 = 0b0111010011, // Sampling time of 469 TADCORE clock periods
    ADCORE_SAMC_0470 = 0b0111010100, // Sampling time of 470 TADCORE clock periods
    ADCORE_SAMC_0471 = 0b0111010101, // Sampling time of 471 TADCORE clock periods
    ADCORE_SAMC_0472 = 0b0111010110, // Sampling time of 472 TADCORE clock periods
    ADCORE_SAMC_0473 = 0b0111010111, // Sampling time of 473 TADCORE clock periods
    ADCORE_SAMC_0474 = 0b0111011000, // Sampling time of 474 TADCORE clock periods
    ADCORE_SAMC_0475 = 0b0111011001, // Sampling time of 475 TADCORE clock periods
    ADCORE_SAMC_0476 = 0b0111011010, // Sampling time of 476 TADCORE clock periods
    ADCORE_SAMC_0477 = 0b0111011011, // Sampling time of 477 TADCORE clock periods
    ADCORE_SAMC_0478 = 0b0111011100, // Sampling time of 478 TADCORE clock periods
    ADCORE_SAMC_0479 = 0b0111011101, // Sampling time of 479 TADCORE clock periods
    ADCORE_SAMC_0480 = 0b0111011110, // Sampling time of 480 TADCORE clock periods
    ADCORE_SAMC_0481 = 0b0111011111, // Sampling time of 481 TADCORE clock periods
    ADCORE_SAMC_0482 = 0b0111100000, // Sampling time of 482 TADCORE clock periods
    ADCORE_SAMC_0483 = 0b0111100001, // Sampling time of 483 TADCORE clock periods
    ADCORE_SAMC_0484 = 0b0111100010, // Sampling time of 484 TADCORE clock periods
    ADCORE_SAMC_0485 = 0b0111100011, // Sampling time of 485 TADCORE clock periods
    ADCORE_SAMC_0486 = 0b0111100100, // Sampling time of 486 TADCORE clock periods
    ADCORE_SAMC_0487 = 0b0111100101, // Sampling time of 487 TADCORE clock periods
    ADCORE_SAMC_0488 = 0b0111100110, // Sampling time of 488 TADCORE clock periods
    ADCORE_SAMC_0489 = 0b0111100111, // Sampling time of 489 TADCORE clock periods
    ADCORE_SAMC_0490 = 0b0111101000, // Sampling time of 490 TADCORE clock periods
    ADCORE_SAMC_0491 = 0b0111101001, // Sampling time of 491 TADCORE clock periods
    ADCORE_SAMC_0492 = 0b0111101010, // Sampling time of 492 TADCORE clock periods
    ADCORE_SAMC_0493 = 0b0111101011, // Sampling time of 493 TADCORE clock periods
    ADCORE_SAMC_0494 = 0b0111101100, // Sampling time of 494 TADCORE clock periods
    ADCORE_SAMC_0495 = 0b0111101101, // Sampling time of 495 TADCORE clock periods
    ADCORE_SAMC_0496 = 0b0111101110, // Sampling time of 496 TADCORE clock periods
    ADCORE_SAMC_0497 = 0b0111101111, // Sampling time of 497 TADCORE clock periods
    ADCORE_SAMC_0498 = 0b0111110000, // Sampling time of 498 TADCORE clock periods
    ADCORE_SAMC_0499 = 0b0111110001, // Sampling time of 499 TADCORE clock periods
    ADCORE_SAMC_0500 = 0b0111110010, // Sampling time of 500 TADCORE clock periods
    ADCORE_SAMC_0501 = 0b0111110011, // Sampling time of 501 TADCORE clock periods
    ADCORE_SAMC_0502 = 0b0111110100, // Sampling time of 502 TADCORE clock periods
    ADCORE_SAMC_0503 = 0b0111110101, // Sampling time of 503 TADCORE clock periods
    ADCORE_SAMC_0504 = 0b0111110110, // Sampling time of 504 TADCORE clock periods
    ADCORE_SAMC_0505 = 0b0111110111, // Sampling time of 505 TADCORE clock periods
    ADCORE_SAMC_0506 = 0b0111111000, // Sampling time of 506 TADCORE clock periods
    ADCORE_SAMC_0507 = 0b0111111001, // Sampling time of 507 TADCORE clock periods
    ADCORE_SAMC_0508 = 0b0111111010, // Sampling time of 508 TADCORE clock periods
    ADCORE_SAMC_0509 = 0b0111111011, // Sampling time of 509 TADCORE clock periods
    ADCORE_SAMC_0510 = 0b0111111100, // Sampling time of 510 TADCORE clock periods
    ADCORE_SAMC_0511 = 0b0111111101, // Sampling time of 511 TADCORE clock periods
    ADCORE_SAMC_0512 = 0b0111111110, // Sampling time of 512 TADCORE clock periods
    ADCORE_SAMC_0513 = 0b0111111111, // Sampling time of 513 TADCORE clock periods
    ADCORE_SAMC_0514 = 0b1000000000, // Sampling time of 514 TADCORE clock periods
    ADCORE_SAMC_0515 = 0b1000000001, // Sampling time of 515 TADCORE clock periods
    ADCORE_SAMC_0516 = 0b1000000010, // Sampling time of 516 TADCORE clock periods
    ADCORE_SAMC_0517 = 0b1000000011, // Sampling time of 517 TADCORE clock periods
    ADCORE_SAMC_0518 = 0b1000000100, // Sampling time of 518 TADCORE clock periods
    ADCORE_SAMC_0519 = 0b1000000101, // Sampling time of 519 TADCORE clock periods
    ADCORE_SAMC_0520 = 0b1000000110, // Sampling time of 520 TADCORE clock periods
    ADCORE_SAMC_0521 = 0b1000000111, // Sampling time of 521 TADCORE clock periods
    ADCORE_SAMC_0522 = 0b1000001000, // Sampling time of 522 TADCORE clock periods
    ADCORE_SAMC_0523 = 0b1000001001, // Sampling time of 523 TADCORE clock periods
    ADCORE_SAMC_0524 = 0b1000001010, // Sampling time of 524 TADCORE clock periods
    ADCORE_SAMC_0525 = 0b1000001011, // Sampling time of 525 TADCORE clock periods
    ADCORE_SAMC_0526 = 0b1000001100, // Sampling time of 526 TADCORE clock periods
    ADCORE_SAMC_0527 = 0b1000001101, // Sampling time of 527 TADCORE clock periods
    ADCORE_SAMC_0528 = 0b1000001110, // Sampling time of 528 TADCORE clock periods
    ADCORE_SAMC_0529 = 0b1000001111, // Sampling time of 529 TADCORE clock periods
    ADCORE_SAMC_0530 = 0b1000010000, // Sampling time of 530 TADCORE clock periods
    ADCORE_SAMC_0531 = 0b1000010001, // Sampling time of 531 TADCORE clock periods
    ADCORE_SAMC_0532 = 0b1000010010, // Sampling time of 532 TADCORE clock periods
    ADCORE_SAMC_0533 = 0b1000010011, // Sampling time of 533 TADCORE clock periods
    ADCORE_SAMC_0534 = 0b1000010100, // Sampling time of 534 TADCORE clock periods
    ADCORE_SAMC_0535 = 0b1000010101, // Sampling time of 535 TADCORE clock periods
    ADCORE_SAMC_0536 = 0b1000010110, // Sampling time of 536 TADCORE clock periods
    ADCORE_SAMC_0537 = 0b1000010111, // Sampling time of 537 TADCORE clock periods
    ADCORE_SAMC_0538 = 0b1000011000, // Sampling time of 538 TADCORE clock periods
    ADCORE_SAMC_0539 = 0b1000011001, // Sampling time of 539 TADCORE clock periods
    ADCORE_SAMC_0540 = 0b1000011010, // Sampling time of 540 TADCORE clock periods
    ADCORE_SAMC_0541 = 0b1000011011, // Sampling time of 541 TADCORE clock periods
    ADCORE_SAMC_0542 = 0b1000011100, // Sampling time of 542 TADCORE clock periods
    ADCORE_SAMC_0543 = 0b1000011101, // Sampling time of 543 TADCORE clock periods
    ADCORE_SAMC_0544 = 0b1000011110, // Sampling time of 544 TADCORE clock periods
    ADCORE_SAMC_0545 = 0b1000011111, // Sampling time of 545 TADCORE clock periods
    ADCORE_SAMC_0546 = 0b1000100000, // Sampling time of 546 TADCORE clock periods
    ADCORE_SAMC_0547 = 0b1000100001, // Sampling time of 547 TADCORE clock periods
    ADCORE_SAMC_0548 = 0b1000100010, // Sampling time of 548 TADCORE clock periods
    ADCORE_SAMC_0549 = 0b1000100011, // Sampling time of 549 TADCORE clock periods
    ADCORE_SAMC_0550 = 0b1000100100, // Sampling time of 550 TADCORE clock periods
    ADCORE_SAMC_0551 = 0b1000100101, // Sampling time of 551 TADCORE clock periods
    ADCORE_SAMC_0552 = 0b1000100110, // Sampling time of 552 TADCORE clock periods
    ADCORE_SAMC_0553 = 0b1000100111, // Sampling time of 553 TADCORE clock periods
    ADCORE_SAMC_0554 = 0b1000101000, // Sampling time of 554 TADCORE clock periods
    ADCORE_SAMC_0555 = 0b1000101001, // Sampling time of 555 TADCORE clock periods
    ADCORE_SAMC_0556 = 0b1000101010, // Sampling time of 556 TADCORE clock periods
    ADCORE_SAMC_0557 = 0b1000101011, // Sampling time of 557 TADCORE clock periods
    ADCORE_SAMC_0558 = 0b1000101100, // Sampling time of 558 TADCORE clock periods
    ADCORE_SAMC_0559 = 0b1000101101, // Sampling time of 559 TADCORE clock periods
    ADCORE_SAMC_0560 = 0b1000101110, // Sampling time of 560 TADCORE clock periods
    ADCORE_SAMC_0561 = 0b1000101111, // Sampling time of 561 TADCORE clock periods
    ADCORE_SAMC_0562 = 0b1000110000, // Sampling time of 562 TADCORE clock periods
    ADCORE_SAMC_0563 = 0b1000110001, // Sampling time of 563 TADCORE clock periods
    ADCORE_SAMC_0564 = 0b1000110010, // Sampling time of 564 TADCORE clock periods
