microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_adc.h
    ADCORE_SAMC_0565 = 0b1000110011, // Sampling time of 565 TADCORE clock periods
    ADCORE_SAMC_0566 = 0b1000110100, // Sampling time of 566 TADCORE clock periods
    ADCORE_SAMC_0567 = 0b1000110101, // Sampling time of 567 TADCORE clock periods
    ADCORE_SAMC_0568 = 0b1000110110, // Sampling time of 568 TADCORE clock periods
    ADCORE_SAMC_0569 = 0b1000110111, // Sampling time of 569 TADCORE clock periods
    ADCORE_SAMC_0570 = 0b1000111000, // Sampling time of 570 TADCORE clock periods
    ADCORE_SAMC_0571 = 0b1000111001, // Sampling time of 571 TADCORE clock periods
    ADCORE_SAMC_0572 = 0b1000111010, // Sampling time of 572 TADCORE clock periods
    ADCORE_SAMC_0573 = 0b1000111011, // Sampling time of 573 TADCORE clock periods
    ADCORE_SAMC_0574 = 0b1000111100, // Sampling time of 574 TADCORE clock periods
    ADCORE_SAMC_0575 = 0b1000111101, // Sampling time of 575 TADCORE clock periods
    ADCORE_SAMC_0576 = 0b1000111110, // Sampling time of 576 TADCORE clock periods
    ADCORE_SAMC_0577 = 0b1000111111, // Sampling time of 577 TADCORE clock periods
    ADCORE_SAMC_0578 = 0b1001000000, // Sampling time of 578 TADCORE clock periods
    ADCORE_SAMC_0579 = 0b1001000001, // Sampling time of 579 TADCORE clock periods
    ADCORE_SAMC_0580 = 0b1001000010, // Sampling time of 580 TADCORE clock periods
    ADCORE_SAMC_0581 = 0b1001000011, // Sampling time of 581 TADCORE clock periods
    ADCORE_SAMC_0582 = 0b1001000100, // Sampling time of 582 TADCORE clock periods
    ADCORE_SAMC_0583 = 0b1001000101, // Sampling time of 583 TADCORE clock periods
    ADCORE_SAMC_0584 = 0b1001000110, // Sampling time of 584 TADCORE clock periods
    ADCORE_SAMC_0585 = 0b1001000111, // Sampling time of 585 TADCORE clock periods
    ADCORE_SAMC_0586 = 0b1001001000, // Sampling time of 586 TADCORE clock periods
    ADCORE_SAMC_0587 = 0b1001001001, // Sampling time of 587 TADCORE clock periods
    ADCORE_SAMC_0588 = 0b1001001010, // Sampling time of 588 TADCORE clock periods
    ADCORE_SAMC_0589 = 0b1001001011, // Sampling time of 589 TADCORE clock periods
    ADCORE_SAMC_0590 = 0b1001001100, // Sampling time of 590 TADCORE clock periods
    ADCORE_SAMC_0591 = 0b1001001101, // Sampling time of 591 TADCORE clock periods
    ADCORE_SAMC_0592 = 0b1001001110, // Sampling time of 592 TADCORE clock periods
    ADCORE_SAMC_0593 = 0b1001001111, // Sampling time of 593 TADCORE clock periods
    ADCORE_SAMC_0594 = 0b1001010000, // Sampling time of 594 TADCORE clock periods
    ADCORE_SAMC_0595 = 0b1001010001, // Sampling time of 595 TADCORE clock periods
    ADCORE_SAMC_0596 = 0b1001010010, // Sampling time of 596 TADCORE clock periods
    ADCORE_SAMC_0597 = 0b1001010011, // Sampling time of 597 TADCORE clock periods
    ADCORE_SAMC_0598 = 0b1001010100, // Sampling time of 598 TADCORE clock periods
    ADCORE_SAMC_0599 = 0b1001010101, // Sampling time of 599 TADCORE clock periods
    ADCORE_SAMC_0600 = 0b1001010110, // Sampling time of 600 TADCORE clock periods
    ADCORE_SAMC_0601 = 0b1001010111, // Sampling time of 601 TADCORE clock periods
    ADCORE_SAMC_0602 = 0b1001011000, // Sampling time of 602 TADCORE clock periods
    ADCORE_SAMC_0603 = 0b1001011001, // Sampling time of 603 TADCORE clock periods
    ADCORE_SAMC_0604 = 0b1001011010, // Sampling time of 604 TADCORE clock periods
    ADCORE_SAMC_0605 = 0b1001011011, // Sampling time of 605 TADCORE clock periods
    ADCORE_SAMC_0606 = 0b1001011100, // Sampling time of 606 TADCORE clock periods
    ADCORE_SAMC_0607 = 0b1001011101, // Sampling time of 607 TADCORE clock periods
    ADCORE_SAMC_0608 = 0b1001011110, // Sampling time of 608 TADCORE clock periods
    ADCORE_SAMC_0609 = 0b1001011111, // Sampling time of 609 TADCORE clock periods
    ADCORE_SAMC_0610 = 0b1001100000, // Sampling time of 610 TADCORE clock periods
    ADCORE_SAMC_0611 = 0b1001100001, // Sampling time of 611 TADCORE clock periods
    ADCORE_SAMC_0612 = 0b1001100010, // Sampling time of 612 TADCORE clock periods
    ADCORE_SAMC_0613 = 0b1001100011, // Sampling time of 613 TADCORE clock periods
    ADCORE_SAMC_0614 = 0b1001100100, // Sampling time of 614 TADCORE clock periods
    ADCORE_SAMC_0615 = 0b1001100101, // Sampling time of 615 TADCORE clock periods
    ADCORE_SAMC_0616 = 0b1001100110, // Sampling time of 616 TADCORE clock periods
    ADCORE_SAMC_0617 = 0b1001100111, // Sampling time of 617 TADCORE clock periods
    ADCORE_SAMC_0618 = 0b1001101000, // Sampling time of 618 TADCORE clock periods
    ADCORE_SAMC_0619 = 0b1001101001, // Sampling time of 619 TADCORE clock periods
    ADCORE_SAMC_0620 = 0b1001101010, // Sampling time of 620 TADCORE clock periods
    ADCORE_SAMC_0621 = 0b1001101011, // Sampling time of 621 TADCORE clock periods
    ADCORE_SAMC_0622 = 0b1001101100, // Sampling time of 622 TADCORE clock periods
    ADCORE_SAMC_0623 = 0b1001101101, // Sampling time of 623 TADCORE clock periods
    ADCORE_SAMC_0624 = 0b1001101110, // Sampling time of 624 TADCORE clock periods
    ADCORE_SAMC_0625 = 0b1001101111, // Sampling time of 625 TADCORE clock periods
    ADCORE_SAMC_0626 = 0b1001110000, // Sampling time of 626 TADCORE clock periods
    ADCORE_SAMC_0627 = 0b1001110001, // Sampling time of 627 TADCORE clock periods
    ADCORE_SAMC_0628 = 0b1001110010, // Sampling time of 628 TADCORE clock periods
    ADCORE_SAMC_0629 = 0b1001110011, // Sampling time of 629 TADCORE clock periods
    ADCORE_SAMC_0630 = 0b1001110100, // Sampling time of 630 TADCORE clock periods
    ADCORE_SAMC_0631 = 0b1001110101, // Sampling time of 631 TADCORE clock periods
    ADCORE_SAMC_0632 = 0b1001110110, // Sampling time of 632 TADCORE clock periods
    ADCORE_SAMC_0633 = 0b1001110111, // Sampling time of 633 TADCORE clock periods
    ADCORE_SAMC_0634 = 0b1001111000, // Sampling time of 634 TADCORE clock periods
    ADCORE_SAMC_0635 = 0b1001111001, // Sampling time of 635 TADCORE clock periods
    ADCORE_SAMC_0636 = 0b1001111010, // Sampling time of 636 TADCORE clock periods
    ADCORE_SAMC_0637 = 0b1001111011, // Sampling time of 637 TADCORE clock periods
    ADCORE_SAMC_0638 = 0b1001111100, // Sampling time of 638 TADCORE clock periods
    ADCORE_SAMC_0639 = 0b1001111101, // Sampling time of 639 TADCORE clock periods
    ADCORE_SAMC_0640 = 0b1001111110, // Sampling time of 640 TADCORE clock periods
    ADCORE_SAMC_0641 = 0b1001111111, // Sampling time of 641 TADCORE clock periods
    ADCORE_SAMC_0642 = 0b1010000000, // Sampling time of 642 TADCORE clock periods
    ADCORE_SAMC_0643 = 0b1010000001, // Sampling time of 643 TADCORE clock periods
    ADCORE_SAMC_0644 = 0b1010000010, // Sampling time of 644 TADCORE clock periods
    ADCORE_SAMC_0645 = 0b1010000011, // Sampling time of 645 TADCORE clock periods
    ADCORE_SAMC_0646 = 0b1010000100, // Sampling time of 646 TADCORE clock periods
    ADCORE_SAMC_0647 = 0b1010000101, // Sampling time of 647 TADCORE clock periods
    ADCORE_SAMC_0648 = 0b1010000110, // Sampling time of 648 TADCORE clock periods
    ADCORE_SAMC_0649 = 0b1010000111, // Sampling time of 649 TADCORE clock periods
    ADCORE_SAMC_0650 = 0b1010001000, // Sampling time of 650 TADCORE clock periods
    ADCORE_SAMC_0651 = 0b1010001001, // Sampling time of 651 TADCORE clock periods
    ADCORE_SAMC_0652 = 0b1010001010, // Sampling time of 652 TADCORE clock periods
    ADCORE_SAMC_0653 = 0b1010001011, // Sampling time of 653 TADCORE clock periods
    ADCORE_SAMC_0654 = 0b1010001100, // Sampling time of 654 TADCORE clock periods
    ADCORE_SAMC_0655 = 0b1010001101, // Sampling time of 655 TADCORE clock periods
    ADCORE_SAMC_0656 = 0b1010001110, // Sampling time of 656 TADCORE clock periods
    ADCORE_SAMC_0657 = 0b1010001111, // Sampling time of 657 TADCORE clock periods
    ADCORE_SAMC_0658 = 0b1010010000, // Sampling time of 658 TADCORE clock periods
    ADCORE_SAMC_0659 = 0b1010010001, // Sampling time of 659 TADCORE clock periods
    ADCORE_SAMC_0660 = 0b1010010010, // Sampling time of 660 TADCORE clock periods
    ADCORE_SAMC_0661 = 0b1010010011, // Sampling time of 661 TADCORE clock periods
    ADCORE_SAMC_0662 = 0b1010010100, // Sampling time of 662 TADCORE clock periods
    ADCORE_SAMC_0663 = 0b1010010101, // Sampling time of 663 TADCORE clock periods
    ADCORE_SAMC_0664 = 0b1010010110, // Sampling time of 664 TADCORE clock periods
    ADCORE_SAMC_0665 = 0b1010010111, // Sampling time of 665 TADCORE clock periods
    ADCORE_SAMC_0666 = 0b1010011000, // Sampling time of 666 TADCORE clock periods
    ADCORE_SAMC_0667 = 0b1010011001, // Sampling time of 667 TADCORE clock periods
    ADCORE_SAMC_0668 = 0b1010011010, // Sampling time of 668 TADCORE clock periods
    ADCORE_SAMC_0669 = 0b1010011011, // Sampling time of 669 TADCORE clock periods
    ADCORE_SAMC_0670 = 0b1010011100, // Sampling time of 670 TADCORE clock periods
    ADCORE_SAMC_0671 = 0b1010011101, // Sampling time of 671 TADCORE clock periods
    ADCORE_SAMC_0672 = 0b1010011110, // Sampling time of 672 TADCORE clock periods
    ADCORE_SAMC_0673 = 0b1010011111, // Sampling time of 673 TADCORE clock periods
    ADCORE_SAMC_0674 = 0b1010100000, // Sampling time of 674 TADCORE clock periods
    ADCORE_SAMC_0675 = 0b1010100001, // Sampling time of 675 TADCORE clock periods
    ADCORE_SAMC_0676 = 0b1010100010, // Sampling time of 676 TADCORE clock periods
    ADCORE_SAMC_0677 = 0b1010100011, // Sampling time of 677 TADCORE clock periods
    ADCORE_SAMC_0678 = 0b1010100100, // Sampling time of 678 TADCORE clock periods
    ADCORE_SAMC_0679 = 0b1010100101, // Sampling time of 679 TADCORE clock periods
    ADCORE_SAMC_0680 = 0b1010100110, // Sampling time of 680 TADCORE clock periods
    ADCORE_SAMC_0681 = 0b1010100111, // Sampling time of 681 TADCORE clock periods
    ADCORE_SAMC_0682 = 0b1010101000, // Sampling time of 682 TADCORE clock periods
    ADCORE_SAMC_0683 = 0b1010101001, // Sampling time of 683 TADCORE clock periods
    ADCORE_SAMC_0684 = 0b1010101010, // Sampling time of 684 TADCORE clock periods
    ADCORE_SAMC_0685 = 0b1010101011, // Sampling time of 685 TADCORE clock periods
    ADCORE_SAMC_0686 = 0b1010101100, // Sampling time of 686 TADCORE clock periods
    ADCORE_SAMC_0687 = 0b1010101101, // Sampling time of 687 TADCORE clock periods
    ADCORE_SAMC_0688 = 0b1010101110, // Sampling time of 688 TADCORE clock periods
    ADCORE_SAMC_0689 = 0b1010101111, // Sampling time of 689 TADCORE clock periods
    ADCORE_SAMC_0690 = 0b1010110000, // Sampling time of 690 TADCORE clock periods
    ADCORE_SAMC_0691 = 0b1010110001, // Sampling time of 691 TADCORE clock periods
    ADCORE_SAMC_0692 = 0b1010110010, // Sampling time of 692 TADCORE clock periods
    ADCORE_SAMC_0693 = 0b1010110011, // Sampling time of 693 TADCORE clock periods
    ADCORE_SAMC_0694 = 0b1010110100, // Sampling time of 694 TADCORE clock periods
    ADCORE_SAMC_0695 = 0b1010110101, // Sampling time of 695 TADCORE clock periods
    ADCORE_SAMC_0696 = 0b1010110110, // Sampling time of 696 TADCORE clock periods
    ADCORE_SAMC_0697 = 0b1010110111, // Sampling time of 697 TADCORE clock periods
    ADCORE_SAMC_0698 = 0b1010111000, // Sampling time of 698 TADCORE clock periods
    ADCORE_SAMC_0699 = 0b1010111001, // Sampling time of 699 TADCORE clock periods
    ADCORE_SAMC_0700 = 0b1010111010, // Sampling time of 700 TADCORE clock periods
    ADCORE_SAMC_0701 = 0b1010111011, // Sampling time of 701 TADCORE clock periods
    ADCORE_SAMC_0702 = 0b1010111100, // Sampling time of 702 TADCORE clock periods
    ADCORE_SAMC_0703 = 0b1010111101, // Sampling time of 703 TADCORE clock periods
    ADCORE_SAMC_0704 = 0b1010111110, // Sampling time of 704 TADCORE clock periods
    ADCORE_SAMC_0705 = 0b1010111111, // Sampling time of 705 TADCORE clock periods
    ADCORE_SAMC_0706 = 0b1011000000, // Sampling time of 706 TADCORE clock periods
    ADCORE_SAMC_0707 = 0b1011000001, // Sampling time of 707 TADCORE clock periods
    ADCORE_SAMC_0708 = 0b1011000010, // Sampling time of 708 TADCORE clock periods
    ADCORE_SAMC_0709 = 0b1011000011, // Sampling time of 709 TADCORE clock periods
    ADCORE_SAMC_0710 = 0b1011000100, // Sampling time of 710 TADCORE clock periods
    ADCORE_SAMC_0711 = 0b1011000101, // Sampling time of 711 TADCORE clock periods
    ADCORE_SAMC_0712 = 0b1011000110, // Sampling time of 712 TADCORE clock periods
    ADCORE_SAMC_0713 = 0b1011000111, // Sampling time of 713 TADCORE clock periods
    ADCORE_SAMC_0714 = 0b1011001000, // Sampling time of 714 TADCORE clock periods
    ADCORE_SAMC_0715 = 0b1011001001, // Sampling time of 715 TADCORE clock periods
    ADCORE_SAMC_0716 = 0b1011001010, // Sampling time of 716 TADCORE clock periods
    ADCORE_SAMC_0717 = 0b1011001011, // Sampling time of 717 TADCORE clock periods
    ADCORE_SAMC_0718 = 0b1011001100, // Sampling time of 718 TADCORE clock periods
    ADCORE_SAMC_0719 = 0b1011001101, // Sampling time of 719 TADCORE clock periods
    ADCORE_SAMC_0720 = 0b1011001110, // Sampling time of 720 TADCORE clock periods
    ADCORE_SAMC_0721 = 0b1011001111, // Sampling time of 721 TADCORE clock periods
    ADCORE_SAMC_0722 = 0b1011010000, // Sampling time of 722 TADCORE clock periods
    ADCORE_SAMC_0723 = 0b1011010001, // Sampling time of 723 TADCORE clock periods
    ADCORE_SAMC_0724 = 0b1011010010, // Sampling time of 724 TADCORE clock periods
    ADCORE_SAMC_0725 = 0b1011010011, // Sampling time of 725 TADCORE clock periods
    ADCORE_SAMC_0726 = 0b1011010100, // Sampling time of 726 TADCORE clock periods
    ADCORE_SAMC_0727 = 0b1011010101, // Sampling time of 727 TADCORE clock periods
    ADCORE_SAMC_0728 = 0b1011010110, // Sampling time of 728 TADCORE clock periods
    ADCORE_SAMC_0729 = 0b1011010111, // Sampling time of 729 TADCORE clock periods
    ADCORE_SAMC_0730 = 0b1011011000, // Sampling time of 730 TADCORE clock periods
    ADCORE_SAMC_0731 = 0b1011011001, // Sampling time of 731 TADCORE clock periods
    ADCORE_SAMC_0732 = 0b1011011010, // Sampling time of 732 TADCORE clock periods
    ADCORE_SAMC_0733 = 0b1011011011, // Sampling time of 733 TADCORE clock periods
    ADCORE_SAMC_0734 = 0b1011011100, // Sampling time of 734 TADCORE clock periods
    ADCORE_SAMC_0735 = 0b1011011101, // Sampling time of 735 TADCORE clock periods
    ADCORE_SAMC_0736 = 0b1011011110, // Sampling time of 736 TADCORE clock periods
    ADCORE_SAMC_0737 = 0b1011011111, // Sampling time of 737 TADCORE clock periods
    ADCORE_SAMC_0738 = 0b1011100000, // Sampling time of 738 TADCORE clock periods
    ADCORE_SAMC_0739 = 0b1011100001, // Sampling time of 739 TADCORE clock periods
    ADCORE_SAMC_0740 = 0b1011100010, // Sampling time of 740 TADCORE clock periods
    ADCORE_SAMC_0741 = 0b1011100011, // Sampling time of 741 TADCORE clock periods
    ADCORE_SAMC_0742 = 0b1011100100, // Sampling time of 742 TADCORE clock periods
    ADCORE_SAMC_0743 = 0b1011100101, // Sampling time of 743 TADCORE clock periods
    ADCORE_SAMC_0744 = 0b1011100110, // Sampling time of 744 TADCORE clock periods
    ADCORE_SAMC_0745 = 0b1011100111, // Sampling time of 745 TADCORE clock periods
    ADCORE_SAMC_0746 = 0b1011101000, // Sampling time of 746 TADCORE clock periods
    ADCORE_SAMC_0747 = 0b1011101001, // Sampling time of 747 TADCORE clock periods
    ADCORE_SAMC_0748 = 0b1011101010, // Sampling time of 748 TADCORE clock periods
    ADCORE_SAMC_0749 = 0b1011101011, // Sampling time of 749 TADCORE clock periods
    ADCORE_SAMC_0750 = 0b1011101100, // Sampling time of 750 TADCORE clock periods
    ADCORE_SAMC_0751 = 0b1011101101, // Sampling time of 751 TADCORE clock periods
    ADCORE_SAMC_0752 = 0b1011101110, // Sampling time of 752 TADCORE clock periods
    ADCORE_SAMC_0753 = 0b1011101111, // Sampling time of 753 TADCORE clock periods
    ADCORE_SAMC_0754 = 0b1011110000, // Sampling time of 754 TADCORE clock periods
    ADCORE_SAMC_0755 = 0b1011110001, // Sampling time of 755 TADCORE clock periods
    ADCORE_SAMC_0756 = 0b1011110010, // Sampling time of 756 TADCORE clock periods
    ADCORE_SAMC_0757 = 0b1011110011, // Sampling time of 757 TADCORE clock periods
    ADCORE_SAMC_0758 = 0b1011110100, // Sampling time of 758 TADCORE clock periods
    ADCORE_SAMC_0759 = 0b1011110101, // Sampling time of 759 TADCORE clock periods
    ADCORE_SAMC_0760 = 0b1011110110, // Sampling time of 760 TADCORE clock periods
    ADCORE_SAMC_0761 = 0b1011110111, // Sampling time of 761 TADCORE clock periods
    ADCORE_SAMC_0762 = 0b1011111000, // Sampling time of 762 TADCORE clock periods
    ADCORE_SAMC_0763 = 0b1011111001, // Sampling time of 763 TADCORE clock periods
    ADCORE_SAMC_0764 = 0b1011111010, // Sampling time of 764 TADCORE clock periods
    ADCORE_SAMC_0765 = 0b1011111011, // Sampling time of 765 TADCORE clock periods
    ADCORE_SAMC_0766 = 0b1011111100, // Sampling time of 766 TADCORE clock periods
    ADCORE_SAMC_0767 = 0b1011111101, // Sampling time of 767 TADCORE clock periods
    ADCORE_SAMC_0768 = 0b1011111110, // Sampling time of 768 TADCORE clock periods
    ADCORE_SAMC_0769 = 0b1011111111, // Sampling time of 769 TADCORE clock periods
    ADCORE_SAMC_0770 = 0b1100000000, // Sampling time of 770 TADCORE clock periods
    ADCORE_SAMC_0771 = 0b1100000001, // Sampling time of 771 TADCORE clock periods
    ADCORE_SAMC_0772 = 0b1100000010, // Sampling time of 772 TADCORE clock periods
    ADCORE_SAMC_0773 = 0b1100000011, // Sampling time of 773 TADCORE clock periods
    ADCORE_SAMC_0774 = 0b1100000100, // Sampling time of 774 TADCORE clock periods
    ADCORE_SAMC_0775 = 0b1100000101, // Sampling time of 775 TADCORE clock periods
    ADCORE_SAMC_0776 = 0b1100000110, // Sampling time of 776 TADCORE clock periods
    ADCORE_SAMC_0777 = 0b1100000111, // Sampling time of 777 TADCORE clock periods
    ADCORE_SAMC_0778 = 0b1100001000, // Sampling time of 778 TADCORE clock periods
    ADCORE_SAMC_0779 = 0b1100001001, // Sampling time of 779 TADCORE clock periods
    ADCORE_SAMC_0780 = 0b1100001010, // Sampling time of 780 TADCORE clock periods
    ADCORE_SAMC_0781 = 0b1100001011, // Sampling time of 781 TADCORE clock periods
    ADCORE_SAMC_0782 = 0b1100001100, // Sampling time of 782 TADCORE clock periods
    ADCORE_SAMC_0783 = 0b1100001101, // Sampling time of 783 TADCORE clock periods
    ADCORE_SAMC_0784 = 0b1100001110, // Sampling time of 784 TADCORE clock periods
    ADCORE_SAMC_0785 = 0b1100001111, // Sampling time of 785 TADCORE clock periods
    ADCORE_SAMC_0786 = 0b1100010000, // Sampling time of 786 TADCORE clock periods
    ADCORE_SAMC_0787 = 0b1100010001, // Sampling time of 787 TADCORE clock periods
    ADCORE_SAMC_0788 = 0b1100010010, // Sampling time of 788 TADCORE clock periods
    ADCORE_SAMC_0789 = 0b1100010011, // Sampling time of 789 TADCORE clock periods
    ADCORE_SAMC_0790 = 0b1100010100, // Sampling time of 790 TADCORE clock periods
    ADCORE_SAMC_0791 = 0b1100010101, // Sampling time of 791 TADCORE clock periods
    ADCORE_SAMC_0792 = 0b1100010110, // Sampling time of 792 TADCORE clock periods
    ADCORE_SAMC_0793 = 0b1100010111, // Sampling time of 793 TADCORE clock periods
    ADCORE_SAMC_0794 = 0b1100011000, // Sampling time of 794 TADCORE clock periods
    ADCORE_SAMC_0795 = 0b1100011001, // Sampling time of 795 TADCORE clock periods
    ADCORE_SAMC_0796 = 0b1100011010, // Sampling time of 796 TADCORE clock periods
    ADCORE_SAMC_0797 = 0b1100011011, // Sampling time of 797 TADCORE clock periods
    ADCORE_SAMC_0798 = 0b1100011100, // Sampling time of 798 TADCORE clock periods
    ADCORE_SAMC_0799 = 0b1100011101, // Sampling time of 799 TADCORE clock periods
    ADCORE_SAMC_0800 = 0b1100011110, // Sampling time of 800 TADCORE clock periods
    ADCORE_SAMC_0801 = 0b1100011111, // Sampling time of 801 TADCORE clock periods
    ADCORE_SAMC_0802 = 0b1100100000, // Sampling time of 802 TADCORE clock periods
    ADCORE_SAMC_0803 = 0b1100100001, // Sampling time of 803 TADCORE clock periods
    ADCORE_SAMC_0804 = 0b1100100010, // Sampling time of 804 TADCORE clock periods
    ADCORE_SAMC_0805 = 0b1100100011, // Sampling time of 805 TADCORE clock periods
    ADCORE_SAMC_0806 = 0b1100100100, // Sampling time of 806 TADCORE clock periods
    ADCORE_SAMC_0807 = 0b1100100101, // Sampling time of 807 TADCORE clock periods
    ADCORE_SAMC_0808 = 0b1100100110, // Sampling time of 808 TADCORE clock periods
    ADCORE_SAMC_0809 = 0b1100100111, // Sampling time of 809 TADCORE clock periods
    ADCORE_SAMC_0810 = 0b1100101000, // Sampling time of 810 TADCORE clock periods
    ADCORE_SAMC_0811 = 0b1100101001, // Sampling time of 811 TADCORE clock periods
    ADCORE_SAMC_0812 = 0b1100101010, // Sampling time of 812 TADCORE clock periods
    ADCORE_SAMC_0813 = 0b1100101011, // Sampling time of 813 TADCORE clock periods
    ADCORE_SAMC_0814 = 0b1100101100, // Sampling time of 814 TADCORE clock periods
    ADCORE_SAMC_0815 = 0b1100101101, // Sampling time of 815 TADCORE clock periods
    ADCORE_SAMC_0816 = 0b1100101110, // Sampling time of 816 TADCORE clock periods
    ADCORE_SAMC_0817 = 0b1100101111, // Sampling time of 817 TADCORE clock periods
    ADCORE_SAMC_0818 = 0b1100110000, // Sampling time of 818 TADCORE clock periods
    ADCORE_SAMC_0819 = 0b1100110001, // Sampling time of 819 TADCORE clock periods
    ADCORE_SAMC_0820 = 0b1100110010, // Sampling time of 820 TADCORE clock periods
    ADCORE_SAMC_0821 = 0b1100110011, // Sampling time of 821 TADCORE clock periods
    ADCORE_SAMC_0822 = 0b1100110100, // Sampling time of 822 TADCORE clock periods
    ADCORE_SAMC_0823 = 0b1100110101, // Sampling time of 823 TADCORE clock periods
    ADCORE_SAMC_0824 = 0b1100110110, // Sampling time of 824 TADCORE clock periods
    ADCORE_SAMC_0825 = 0b1100110111, // Sampling time of 825 TADCORE clock periods
    ADCORE_SAMC_0826 = 0b1100111000, // Sampling time of 826 TADCORE clock periods
    ADCORE_SAMC_0827 = 0b1100111001, // Sampling time of 827 TADCORE clock periods
    ADCORE_SAMC_0828 = 0b1100111010, // Sampling time of 828 TADCORE clock periods
    ADCORE_SAMC_0829 = 0b1100111011, // Sampling time of 829 TADCORE clock periods
    ADCORE_SAMC_0830 = 0b1100111100, // Sampling time of 830 TADCORE clock periods
    ADCORE_SAMC_0831 = 0b1100111101, // Sampling time of 831 TADCORE clock periods
    ADCORE_SAMC_0832 = 0b1100111110, // Sampling time of 832 TADCORE clock periods
    ADCORE_SAMC_0833 = 0b1100111111, // Sampling time of 833 TADCORE clock periods
    ADCORE_SAMC_0834 = 0b1101000000, // Sampling time of 834 TADCORE clock periods
    ADCORE_SAMC_0835 = 0b1101000001, // Sampling time of 835 TADCORE clock periods
    ADCORE_SAMC_0836 = 0b1101000010, // Sampling time of 836 TADCORE clock periods
    ADCORE_SAMC_0837 = 0b1101000011, // Sampling time of 837 TADCORE clock periods
    ADCORE_SAMC_0838 = 0b1101000100, // Sampling time of 838 TADCORE clock periods
    ADCORE_SAMC_0839 = 0b1101000101, // Sampling time of 839 TADCORE clock periods
    ADCORE_SAMC_0840 = 0b1101000110, // Sampling time of 840 TADCORE clock periods
    ADCORE_SAMC_0841 = 0b1101000111, // Sampling time of 841 TADCORE clock periods
    ADCORE_SAMC_0842 = 0b1101001000, // Sampling time of 842 TADCORE clock periods
    ADCORE_SAMC_0843 = 0b1101001001, // Sampling time of 843 TADCORE clock periods
    ADCORE_SAMC_0844 = 0b1101001010, // Sampling time of 844 TADCORE clock periods
    ADCORE_SAMC_0845 = 0b1101001011, // Sampling time of 845 TADCORE clock periods
    ADCORE_SAMC_0846 = 0b1101001100, // Sampling time of 846 TADCORE clock periods
    ADCORE_SAMC_0847 = 0b1101001101, // Sampling time of 847 TADCORE clock periods
    ADCORE_SAMC_0848 = 0b1101001110, // Sampling time of 848 TADCORE clock periods
    ADCORE_SAMC_0849 = 0b1101001111, // Sampling time of 849 TADCORE clock periods
    ADCORE_SAMC_0850 = 0b1101010000, // Sampling time of 850 TADCORE clock periods
    ADCORE_SAMC_0851 = 0b1101010001, // Sampling time of 851 TADCORE clock periods
    ADCORE_SAMC_0852 = 0b1101010010, // Sampling time of 852 TADCORE clock periods
    ADCORE_SAMC_0853 = 0b1101010011, // Sampling time of 853 TADCORE clock periods
