microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_adc.h
    ADCORE_SAMC_0854 = 0b1101010100, // Sampling time of 854 TADCORE clock periods
    ADCORE_SAMC_0855 = 0b1101010101, // Sampling time of 855 TADCORE clock periods
    ADCORE_SAMC_0856 = 0b1101010110, // Sampling time of 856 TADCORE clock periods
    ADCORE_SAMC_0857 = 0b1101010111, // Sampling time of 857 TADCORE clock periods
    ADCORE_SAMC_0858 = 0b1101011000, // Sampling time of 858 TADCORE clock periods
    ADCORE_SAMC_0859 = 0b1101011001, // Sampling time of 859 TADCORE clock periods
    ADCORE_SAMC_0860 = 0b1101011010, // Sampling time of 860 TADCORE clock periods
    ADCORE_SAMC_0861 = 0b1101011011, // Sampling time of 861 TADCORE clock periods
    ADCORE_SAMC_0862 = 0b1101011100, // Sampling time of 862 TADCORE clock periods
    ADCORE_SAMC_0863 = 0b1101011101, // Sampling time of 863 TADCORE clock periods
    ADCORE_SAMC_0864 = 0b1101011110, // Sampling time of 864 TADCORE clock periods
    ADCORE_SAMC_0865 = 0b1101011111, // Sampling time of 865 TADCORE clock periods
    ADCORE_SAMC_0866 = 0b1101100000, // Sampling time of 866 TADCORE clock periods
    ADCORE_SAMC_0867 = 0b1101100001, // Sampling time of 867 TADCORE clock periods
    ADCORE_SAMC_0868 = 0b1101100010, // Sampling time of 868 TADCORE clock periods
    ADCORE_SAMC_0869 = 0b1101100011, // Sampling time of 869 TADCORE clock periods
    ADCORE_SAMC_0870 = 0b1101100100, // Sampling time of 870 TADCORE clock periods
    ADCORE_SAMC_0871 = 0b1101100101, // Sampling time of 871 TADCORE clock periods
    ADCORE_SAMC_0872 = 0b1101100110, // Sampling time of 872 TADCORE clock periods
    ADCORE_SAMC_0873 = 0b1101100111, // Sampling time of 873 TADCORE clock periods
    ADCORE_SAMC_0874 = 0b1101101000, // Sampling time of 874 TADCORE clock periods
    ADCORE_SAMC_0875 = 0b1101101001, // Sampling time of 875 TADCORE clock periods
    ADCORE_SAMC_0876 = 0b1101101010, // Sampling time of 876 TADCORE clock periods
    ADCORE_SAMC_0877 = 0b1101101011, // Sampling time of 877 TADCORE clock periods
    ADCORE_SAMC_0878 = 0b1101101100, // Sampling time of 878 TADCORE clock periods
    ADCORE_SAMC_0879 = 0b1101101101, // Sampling time of 879 TADCORE clock periods
    ADCORE_SAMC_0880 = 0b1101101110, // Sampling time of 880 TADCORE clock periods
    ADCORE_SAMC_0881 = 0b1101101111, // Sampling time of 881 TADCORE clock periods
    ADCORE_SAMC_0882 = 0b1101110000, // Sampling time of 882 TADCORE clock periods
    ADCORE_SAMC_0883 = 0b1101110001, // Sampling time of 883 TADCORE clock periods
    ADCORE_SAMC_0884 = 0b1101110010, // Sampling time of 884 TADCORE clock periods
    ADCORE_SAMC_0885 = 0b1101110011, // Sampling time of 885 TADCORE clock periods
    ADCORE_SAMC_0886 = 0b1101110100, // Sampling time of 886 TADCORE clock periods
    ADCORE_SAMC_0887 = 0b1101110101, // Sampling time of 887 TADCORE clock periods
    ADCORE_SAMC_0888 = 0b1101110110, // Sampling time of 888 TADCORE clock periods
    ADCORE_SAMC_0889 = 0b1101110111, // Sampling time of 889 TADCORE clock periods
    ADCORE_SAMC_0890 = 0b1101111000, // Sampling time of 890 TADCORE clock periods
    ADCORE_SAMC_0891 = 0b1101111001, // Sampling time of 891 TADCORE clock periods
    ADCORE_SAMC_0892 = 0b1101111010, // Sampling time of 892 TADCORE clock periods
    ADCORE_SAMC_0893 = 0b1101111011, // Sampling time of 893 TADCORE clock periods
    ADCORE_SAMC_0894 = 0b1101111100, // Sampling time of 894 TADCORE clock periods
    ADCORE_SAMC_0895 = 0b1101111101, // Sampling time of 895 TADCORE clock periods
    ADCORE_SAMC_0896 = 0b1101111110, // Sampling time of 896 TADCORE clock periods
    ADCORE_SAMC_0897 = 0b1101111111, // Sampling time of 897 TADCORE clock periods
    ADCORE_SAMC_0898 = 0b1110000000, // Sampling time of 898 TADCORE clock periods
    ADCORE_SAMC_0899 = 0b1110000001, // Sampling time of 899 TADCORE clock periods
    ADCORE_SAMC_0900 = 0b1110000010, // Sampling time of 900 TADCORE clock periods
    ADCORE_SAMC_0901 = 0b1110000011, // Sampling time of 901 TADCORE clock periods
    ADCORE_SAMC_0902 = 0b1110000100, // Sampling time of 902 TADCORE clock periods
    ADCORE_SAMC_0903 = 0b1110000101, // Sampling time of 903 TADCORE clock periods
    ADCORE_SAMC_0904 = 0b1110000110, // Sampling time of 904 TADCORE clock periods
    ADCORE_SAMC_0905 = 0b1110000111, // Sampling time of 905 TADCORE clock periods
    ADCORE_SAMC_0906 = 0b1110001000, // Sampling time of 906 TADCORE clock periods
    ADCORE_SAMC_0907 = 0b1110001001, // Sampling time of 907 TADCORE clock periods
    ADCORE_SAMC_0908 = 0b1110001010, // Sampling time of 908 TADCORE clock periods
    ADCORE_SAMC_0909 = 0b1110001011, // Sampling time of 909 TADCORE clock periods
    ADCORE_SAMC_0910 = 0b1110001100, // Sampling time of 910 TADCORE clock periods
    ADCORE_SAMC_0911 = 0b1110001101, // Sampling time of 911 TADCORE clock periods
    ADCORE_SAMC_0912 = 0b1110001110, // Sampling time of 912 TADCORE clock periods
    ADCORE_SAMC_0913 = 0b1110001111, // Sampling time of 913 TADCORE clock periods
    ADCORE_SAMC_0914 = 0b1110010000, // Sampling time of 914 TADCORE clock periods
    ADCORE_SAMC_0915 = 0b1110010001, // Sampling time of 915 TADCORE clock periods
    ADCORE_SAMC_0916 = 0b1110010010, // Sampling time of 916 TADCORE clock periods
    ADCORE_SAMC_0917 = 0b1110010011, // Sampling time of 917 TADCORE clock periods
    ADCORE_SAMC_0918 = 0b1110010100, // Sampling time of 918 TADCORE clock periods
    ADCORE_SAMC_0919 = 0b1110010101, // Sampling time of 919 TADCORE clock periods
    ADCORE_SAMC_0920 = 0b1110010110, // Sampling time of 920 TADCORE clock periods
    ADCORE_SAMC_0921 = 0b1110010111, // Sampling time of 921 TADCORE clock periods
    ADCORE_SAMC_0922 = 0b1110011000, // Sampling time of 922 TADCORE clock periods
    ADCORE_SAMC_0923 = 0b1110011001, // Sampling time of 923 TADCORE clock periods
    ADCORE_SAMC_0924 = 0b1110011010, // Sampling time of 924 TADCORE clock periods
    ADCORE_SAMC_0925 = 0b1110011011, // Sampling time of 925 TADCORE clock periods
    ADCORE_SAMC_0926 = 0b1110011100, // Sampling time of 926 TADCORE clock periods
    ADCORE_SAMC_0927 = 0b1110011101, // Sampling time of 927 TADCORE clock periods
    ADCORE_SAMC_0928 = 0b1110011110, // Sampling time of 928 TADCORE clock periods
    ADCORE_SAMC_0929 = 0b1110011111, // Sampling time of 929 TADCORE clock periods
    ADCORE_SAMC_0930 = 0b1110100000, // Sampling time of 930 TADCORE clock periods
    ADCORE_SAMC_0931 = 0b1110100001, // Sampling time of 931 TADCORE clock periods
    ADCORE_SAMC_0932 = 0b1110100010, // Sampling time of 932 TADCORE clock periods
    ADCORE_SAMC_0933 = 0b1110100011, // Sampling time of 933 TADCORE clock periods
    ADCORE_SAMC_0934 = 0b1110100100, // Sampling time of 934 TADCORE clock periods
    ADCORE_SAMC_0935 = 0b1110100101, // Sampling time of 935 TADCORE clock periods
    ADCORE_SAMC_0936 = 0b1110100110, // Sampling time of 936 TADCORE clock periods
    ADCORE_SAMC_0937 = 0b1110100111, // Sampling time of 937 TADCORE clock periods
    ADCORE_SAMC_0938 = 0b1110101000, // Sampling time of 938 TADCORE clock periods
    ADCORE_SAMC_0939 = 0b1110101001, // Sampling time of 939 TADCORE clock periods
    ADCORE_SAMC_0940 = 0b1110101010, // Sampling time of 940 TADCORE clock periods
    ADCORE_SAMC_0941 = 0b1110101011, // Sampling time of 941 TADCORE clock periods
    ADCORE_SAMC_0942 = 0b1110101100, // Sampling time of 942 TADCORE clock periods
    ADCORE_SAMC_0943 = 0b1110101101, // Sampling time of 943 TADCORE clock periods
    ADCORE_SAMC_0944 = 0b1110101110, // Sampling time of 944 TADCORE clock periods
    ADCORE_SAMC_0945 = 0b1110101111, // Sampling time of 945 TADCORE clock periods
    ADCORE_SAMC_0946 = 0b1110110000, // Sampling time of 946 TADCORE clock periods
    ADCORE_SAMC_0947 = 0b1110110001, // Sampling time of 947 TADCORE clock periods
    ADCORE_SAMC_0948 = 0b1110110010, // Sampling time of 948 TADCORE clock periods
    ADCORE_SAMC_0949 = 0b1110110011, // Sampling time of 949 TADCORE clock periods
    ADCORE_SAMC_0950 = 0b1110110100, // Sampling time of 950 TADCORE clock periods
    ADCORE_SAMC_0951 = 0b1110110101, // Sampling time of 951 TADCORE clock periods
    ADCORE_SAMC_0952 = 0b1110110110, // Sampling time of 952 TADCORE clock periods
    ADCORE_SAMC_0953 = 0b1110110111, // Sampling time of 953 TADCORE clock periods
    ADCORE_SAMC_0954 = 0b1110111000, // Sampling time of 954 TADCORE clock periods
    ADCORE_SAMC_0955 = 0b1110111001, // Sampling time of 955 TADCORE clock periods
    ADCORE_SAMC_0956 = 0b1110111010, // Sampling time of 956 TADCORE clock periods
    ADCORE_SAMC_0957 = 0b1110111011, // Sampling time of 957 TADCORE clock periods
    ADCORE_SAMC_0958 = 0b1110111100, // Sampling time of 958 TADCORE clock periods
    ADCORE_SAMC_0959 = 0b1110111101, // Sampling time of 959 TADCORE clock periods
    ADCORE_SAMC_0960 = 0b1110111110, // Sampling time of 960 TADCORE clock periods
    ADCORE_SAMC_0961 = 0b1110111111, // Sampling time of 961 TADCORE clock periods
    ADCORE_SAMC_0962 = 0b1111000000, // Sampling time of 962 TADCORE clock periods
    ADCORE_SAMC_0963 = 0b1111000001, // Sampling time of 963 TADCORE clock periods
    ADCORE_SAMC_0964 = 0b1111000010, // Sampling time of 964 TADCORE clock periods
    ADCORE_SAMC_0965 = 0b1111000011, // Sampling time of 965 TADCORE clock periods
    ADCORE_SAMC_0966 = 0b1111000100, // Sampling time of 966 TADCORE clock periods
    ADCORE_SAMC_0967 = 0b1111000101, // Sampling time of 967 TADCORE clock periods
    ADCORE_SAMC_0968 = 0b1111000110, // Sampling time of 968 TADCORE clock periods
    ADCORE_SAMC_0969 = 0b1111000111, // Sampling time of 969 TADCORE clock periods
    ADCORE_SAMC_0970 = 0b1111001000, // Sampling time of 970 TADCORE clock periods
    ADCORE_SAMC_0971 = 0b1111001001, // Sampling time of 971 TADCORE clock periods
    ADCORE_SAMC_0972 = 0b1111001010, // Sampling time of 972 TADCORE clock periods
    ADCORE_SAMC_0973 = 0b1111001011, // Sampling time of 973 TADCORE clock periods
    ADCORE_SAMC_0974 = 0b1111001100, // Sampling time of 974 TADCORE clock periods
    ADCORE_SAMC_0975 = 0b1111001101, // Sampling time of 975 TADCORE clock periods
    ADCORE_SAMC_0976 = 0b1111001110, // Sampling time of 976 TADCORE clock periods
    ADCORE_SAMC_0977 = 0b1111001111, // Sampling time of 977 TADCORE clock periods
    ADCORE_SAMC_0978 = 0b1111010000, // Sampling time of 978 TADCORE clock periods
    ADCORE_SAMC_0979 = 0b1111010001, // Sampling time of 979 TADCORE clock periods
    ADCORE_SAMC_0980 = 0b1111010010, // Sampling time of 980 TADCORE clock periods
    ADCORE_SAMC_0981 = 0b1111010011, // Sampling time of 981 TADCORE clock periods
    ADCORE_SAMC_0982 = 0b1111010100, // Sampling time of 982 TADCORE clock periods
    ADCORE_SAMC_0983 = 0b1111010101, // Sampling time of 983 TADCORE clock periods
    ADCORE_SAMC_0984 = 0b1111010110, // Sampling time of 984 TADCORE clock periods
    ADCORE_SAMC_0985 = 0b1111010111, // Sampling time of 985 TADCORE clock periods
    ADCORE_SAMC_0986 = 0b1111011000, // Sampling time of 986 TADCORE clock periods
    ADCORE_SAMC_0987 = 0b1111011001, // Sampling time of 987 TADCORE clock periods
    ADCORE_SAMC_0988 = 0b1111011010, // Sampling time of 988 TADCORE clock periods
    ADCORE_SAMC_0989 = 0b1111011011, // Sampling time of 989 TADCORE clock periods
    ADCORE_SAMC_0990 = 0b1111011100, // Sampling time of 990 TADCORE clock periods
    ADCORE_SAMC_0991 = 0b1111011101, // Sampling time of 991 TADCORE clock periods
    ADCORE_SAMC_0992 = 0b1111011110, // Sampling time of 992 TADCORE clock periods
    ADCORE_SAMC_0993 = 0b1111011111, // Sampling time of 993 TADCORE clock periods
    ADCORE_SAMC_0994 = 0b1111100000, // Sampling time of 994 TADCORE clock periods
    ADCORE_SAMC_0995 = 0b1111100001, // Sampling time of 995 TADCORE clock periods
    ADCORE_SAMC_0996 = 0b1111100010, // Sampling time of 996 TADCORE clock periods
    ADCORE_SAMC_0997 = 0b1111100011, // Sampling time of 997 TADCORE clock periods
    ADCORE_SAMC_0998 = 0b1111100100, // Sampling time of 998 TADCORE clock periods
    ADCORE_SAMC_0999 = 0b1111100101, // Sampling time of 999 TADCORE clock periods
    ADCORE_SAMC_1000 = 0b1111100110, // Sampling time of 1000 TADCORE clock periods
    ADCORE_SAMC_1001 = 0b1111100111, // Sampling time of 1001 TADCORE clock periods
    ADCORE_SAMC_1002 = 0b1111101000, // Sampling time of 1002 TADCORE clock periods
    ADCORE_SAMC_1003 = 0b1111101001, // Sampling time of 1003 TADCORE clock periods
    ADCORE_SAMC_1004 = 0b1111101010, // Sampling time of 1004 TADCORE clock periods
    ADCORE_SAMC_1005 = 0b1111101011, // Sampling time of 1005 TADCORE clock periods
    ADCORE_SAMC_1006 = 0b1111101100, // Sampling time of 1006 TADCORE clock periods
    ADCORE_SAMC_1007 = 0b1111101101, // Sampling time of 1007 TADCORE clock periods
    ADCORE_SAMC_1008 = 0b1111101110, // Sampling time of 1008 TADCORE clock periods
    ADCORE_SAMC_1009 = 0b1111101111, // Sampling time of 1009 TADCORE clock periods
    ADCORE_SAMC_1010 = 0b1111110000, // Sampling time of 1010 TADCORE clock periods
    ADCORE_SAMC_1011 = 0b1111110001, // Sampling time of 1011 TADCORE clock periods
    ADCORE_SAMC_1012 = 0b1111110010, // Sampling time of 1012 TADCORE clock periods
    ADCORE_SAMC_1013 = 0b1111110011, // Sampling time of 1013 TADCORE clock periods
    ADCORE_SAMC_1014 = 0b1111110100, // Sampling time of 1014 TADCORE clock periods
    ADCORE_SAMC_1015 = 0b1111110101, // Sampling time of 1015 TADCORE clock periods
    ADCORE_SAMC_1016 = 0b1111110110, // Sampling time of 1016 TADCORE clock periods
    ADCORE_SAMC_1017 = 0b1111110111, // Sampling time of 1017 TADCORE clock periods
    ADCORE_SAMC_1018 = 0b1111111000, // Sampling time of 1018 TADCORE clock periods
    ADCORE_SAMC_1019 = 0b1111111001, // Sampling time of 1019 TADCORE clock periods
    ADCORE_SAMC_1020 = 0b1111111010, // Sampling time of 1020 TADCORE clock periods
    ADCORE_SAMC_1021 = 0b1111111011, // Sampling time of 1021 TADCORE clock periods
    ADCORE_SAMC_1022 = 0b1111111100, // Sampling time of 1022 TADCORE clock periods
    ADCORE_SAMC_1023 = 0b1111111101, // Sampling time of 1023 TADCORE clock periods
    ADCORE_SAMC_1024 = 0b1111111110, // Sampling time of 1024 TADCORE clock periods
    ADCORE_SAMC_1025 = 0b1111111111 // Sampling time of 1025 TADCORE clock periods
} ADCOREx_SAMC_e; // Shared ADC Core Sample Time Selection bits

