microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_adc.h
typedef union {
    struct {
        volatile ADCOREx_ADCS_e shradcs : 7;    // Bit 6-0: Shared ADC Core Input Clock Divider
        volatile unsigned : 1;                  // Bit 7: (reserved))
        volatile ADCOREx_EISEL_e shreisel : 3;  // Bit 10-8: Shared Core Early Interrupt Time Selection
        volatile ADCON2_PTGEN_e ptgen : 1;      // Bit 11: PTG Trigger Enable
        volatile ADCON2_EIEN_e eien : 1;        // Bit 12: Early Interrupts Enable
        volatile unsigned : 1;                  // Bit 13: (reserved))
        volatile ADCON2_REFERCIE_e refercie : 1; // Bit 14: Band Gap or Reference Voltage Error Common Interrupt Enable
        volatile ADCON2_REFCIE_e refcie : 1;    // Bit 15: Band Gap and Reference Voltage Ready Common Interrupt Enable
    } __attribute__((packed)) bits; // ADCON2L: ADC CONTROL REGISTER 2 LOW
    volatile uint16_t value;
} ADCON2L_t; // ADCON2L: ADC CONTROL REGISTER 2 LOW


typedef union {
struct {
    volatile ADCOREx_SAMC_e shrsamc : 10;   // Bit 9-0: Shared ADC Core Sample Time Selection bits
    volatile unsigned : 4;                  // Bit 13-10: (reserved)
    volatile ADCON2_REFERR_e referr : 1;    // Bit 14: Band Gap or Reference Voltage Error Flag bit
    volatile ADCON2_REFRDY_e refrdy : 1;    // Bit 15: Band Gap Reference status
} __attribute__((packed)) bits; // ADCON2H: ADC CONTROL REGISTER 2 HIGH
    volatile uint16_t value;
} ADCON2H_t; // ADCON2H: ADC CONTROL REGISTER 2 HIGH

typedef union {
    struct {
        volatile ADCON2H_t adcon2l; // ADCON2L: ADC CONTROL REGISTER 2 LOW
        volatile ADCON2H_t adcon2h; // ADCON2H: ADC CONTROL REGISTER 2 HIGH
    } bits; // ADCON2: ADC CONTROL REGISTER 2 HIGH/LOW  
    volatile uint32_t value;
} ADCON2_t; // ADCON2: ADC CONTROL REGISTER 2 HIGH/LOW

// REGISTERS ADCON3L/H: ANALOG-TO-DIGITAL CONTROL REGISTER 3 LOW/HIGH

// the least significant bits of the valid data mask cover the enable bits of dedicated ADC cores
// As the number of ADC cores differ, tailored bit masks are required
#define REG_ADCON3_VALID_DATA_WRITE_MSK   ((0xFF80FABF) | (uint32_t)(ADCORE_REGISTER_BIT_MSK << 16))
#define REG_ADCON3_VALID_DATA_READ_MSK    ((0xFF80FABF) | (uint32_t)(ADCORE_REGISTER_BIT_MSK << 16))
#define REG_ADCON3_DISABLE_ADC_CORES_MSK  (0xFF00FFFF)

#define REG_ADCON3L_RESET                0b0000010101000000 // Reset ADCON 3 Low Register
#define REG_ADCON3L_VALID_DATA_WRITE_MSK 0b1111101010111111 // Bit mask used to set unimplemented bits to zero
#define REG_ADCON3L_VALID_DATA_READ_MSK  0b1111111111111111 // Bit mask used to set unimplemented bits to zero

#define REG_ADCON3H_RESET                0b1100000000000000      // Reset ADCON 3 High Register
#define REG_ADCON3H_VALID_DATA_WRITE_MSK (0xFF80 | (uint16_t)ADCORE_REGISTER_BIT_MSK)	// Bit mask used to set unimplemented bits to zero
#define REG_ADCON3H_VALID_DATA_READ_MSK  (0xFF80 | (uint16_t)ADCORE_REGISTER_BIT_MSK)	// Bit mask used to set unimplemented bits to zero
#define REG_ADCON3H_DISABLE_ADC_CORES_MSK (0xFF00)	// Bit mask used to set unimplemented bits to zero

#define REG_ADCON3L_REFSEL_AVDD_AVSS    0b0000000000000000      // Vref = AVDD to AVSS

typedef enum {
    ADCON3_REFSEL_AVDD_AVSS = 0b000 // VDD to VSS is ADC reference voltage source
} ADCON3_REFSEL_e; // ADC Reference Voltage Selection

#define REG_ADCON3L_SUSPEND_HOLD        0b0001000000000000      // All ADC triggers are disabled
#define REG_ADCON3L_SUSPEND_RUN         0b0000000000000000      // All ADC triggers are enabled

typedef enum {
    ADCON3_SUSPEND_HOLD = 0b1, // All new trigger events for all ADC cores are disabled 
    ADCON3_SUSPEND_RUN = 0b0 // All ADC cores can be triggered 
} ADCON3_SUSPEND_e; // All ADC Core Triggers Disable

#define REG_ADCON3L_SUSPCIE_ENABLED     0b0000100000000000      // Suspend Interrupt Enabled
#define REG_ADCON3L_SUSPCIE_DISABLED    0b0000000000000000      // Suspend Interrupt Disabled

typedef enum {
    ADCON3_SUSPCIE_ENABLED = 0b1, // Common interrupt will be generated when ADC core triggers are suspended (SUSPEND bit = 1) and all previous conversions are finished (SUSPRDY bit becomes set)
    ADCON3_SUSPCIE_DISABLED = 0b0 // Common interrupt is not generated for suspend ADC cores event
} ADCON3_SUSPCIE_e; // Suspend All ADC Cores Common Interrupt Enable

#define REG_ADCON3L_SUSPRDY_SUSPENDED   0b0000010000000000      // READ ONLY: Suspend Status ON
#define REG_ADCON3L_SUSPRDY_RUNNING     0b0000000000000000      // READ ONLY: Suspend Status OFF

typedef enum {
    ADCON3_SUSPRDY_SUSPENDED = 0b1, // ADC core is suspended (SUSPEND bit = 1) and has no conversions in progress
    ADCON3_SUSPRDY_RUNNING = 0b0 // ADC cores are running or have previous conversions in progress
} ADCON3_SUSPRDY_e; // All ADC Cores Suspended Flag

#define REG_ADCON3L_SHRSAMP_SWTRIG      0b0000001000000000      // Individual Software Trigger for shared Core
#define REG_ADCON3L_SHRSAMP_HWTRIG      0b0000000000000000      // Individual Software Trigger for shared Core disabled

typedef enum {
    ADCON3_SHRSAMP_SWTRIG = 0b1, // Shared ADC core samples an analog input specified by the CNVCHSEL<5:0> bits
    ADCON3_SHRSAMP_HWTRIG = 0b0 // Sampling is controlled by the shared ADC core hardware
} ADCON3_SHRSAMP_e; /* Shared ADC Core Sampling Direct Control
This bit should be used with the individual channel conversion trigger controlled by the CNVRTCH bit.
It connects an analog input, specified by the CNVCHSEL<5:0> bits, to the shared ADC core and allows
extending the sampling time. This bit is not controlled by hardware and must be cleared before the
conversion starts (setting CNVRTCH to 1). */

#define REG_ADCON3L_CNVRTCH_GO          0b0000000100000000      // Individual Software Trigger Status Bit ON (GO) =< will be cleared by hardware when executed
#define REG_ADCON3L_CNVRTCH_READY       0b0000000000000000      // Individual Software Trigger Status Bit OFF (READY for next trigger)

typedef enum {
    ADCON3_CNVRTCH_GO = 0b1, // Single trigger is generated for an analog input specified by the CNVCHSEL<5:0> bits; when the bit is set, it is automatically cleared by hardware on the next instruction cycle
    ADCON3_CNVRTCH_READY = 0b0 // Next individual channel conversion trigger can be generated
} ADCON3_CNVRTCH_e; // Software Individual Channel Conversion Trigger


#define REG_ADCON3L_SWLCTRG_LVLTRG_BY_SW 0b0000000010000000      // Software Level-Sensitive Common Trigger ON
#define REG_ADCON3L_SWLCTRG_LVLTRG_BY_HW 0b0000000000000000      // Software Level-Sensitive Common Trigger OFF

