microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_adc.h
#define REG_ADCON3H_SHREN_ENABLED       0b0000000010000000      // Shared ADC Core Enabled
#define REG_ADCON3H_SHREN_DISABLED      0b0000000000000000      // Shared ADC Core Disabled

typedef enum {
    ADCON3_SHREN_ENABLED = 0b1, // Shared ADC Core is enabled
    ADCON3_SHREN_DISABLED = 0b0 // Shared ADC Core is disabled
} ADCON3_SHREN_e; // Shared ADC Core Enable

#if (ADC_CORE_COUNT > 6)
#define REG_ADCON3H_C3EN_ENABLED        0b0000000000001000      // Dedicated ADC Core #4 Enabled
#define REG_ADCON3H_C3EN_DISABLED       0b0000000000000000      // Dedicated ADC Core #4 Disabled
#endif

#if (ADC_CORE_COUNT > 5)
#define REG_ADCON3H_C3EN_ENABLED        0b0000000000001000      // Dedicated ADC Core #3 Enabled
#define REG_ADCON3H_C3EN_DISABLED       0b0000000000000000      // Dedicated ADC Core #3 Disabled
#endif

#if (ADC_CORE_COUNT > 4)
#define REG_ADCON3H_C2EN_ENABLED        0b0000000000000100      // Dedicated ADC Core #2 Enabled
#define REG_ADCON3H_C2EN_DISABLED       0b0000000000000000      // Dedicated ADC Core #2 Disabled
#endif

#if (ADC_CORE_COUNT > 3)
#define REG_ADCON3H_C2EN_ENABLED        0b0000000000000100      // Dedicated ADC Core #2 Enabled
#define REG_ADCON3H_C2EN_DISABLED       0b0000000000000000      // Dedicated ADC Core #2 Disabled
#endif

#if (ADC_CORE_COUNT > 2)
#define REG_ADCON3H_C1EN_ENABLED        0b0000000000000010      // Dedicated ADC Core #1 Enabled
#define REG_ADCON3H_C1EN_DISABLED       0b0000000000000000      // Dedicated ADC Core #1 Disabled
#endif

#if (ADC_CORE_COUNT > 1)
#define REG_ADCON3H_C0EN_ENABLED        0b0000000000000001      // Dedicated ADC Core #0 Enabled
#define REG_ADCON3H_C0EN_DISABLED       0b0000000000000000      // Dedicated ADC Core #0 Disabled
#endif

typedef enum {
    ADCON3_CxEN_ENABLED = 0b1, // Dedicated ADC Core n is enabled
    ADCON3_CxEN_DISABLED = 0b0 // Dedicated ADC Core n is disabled
} ADCON3_CxEN_e; // Dedicated ADC Core Enable

typedef union {
    struct {
        // --- LOW WORD ---
        volatile ADCON3_CNVCHSEL_e cnvchsel : 6; // Bit 5-0: Channel Number Selection for Software Individual Channel Conversion Trigger bits
        volatile ADCON3_SWCTRG_e  swctrg  : 1; // Bit 6: Software Common Trigger
        volatile ADCON3_SWLCTRG_e swlctrg : 1; // Bit 7: Software Level-Sensitive Common Trigger
        volatile ADCON3_CNVRTCH_e cnvrtch : 1; // Bit 8: Software Individual Channel Conversion Trigger
        volatile ADCON3_SHRSAMP_e shrsamp : 1; // Bit 9: Shared ADC Core Sampling Direct Control
        volatile ADCON3_SUSPRDY_e susprdy : 1; // Bit 10: All ADC Cores Suspended Flag
        volatile ADCON3_SUSPCIE_e suspcie : 1; // Bit 11: Suspend All ADC Cores Common Interrupt Enable bit
        volatile ADCON3_SUSPEND_e suspend : 1; // Bit 12: All ADC Core Triggers Disable bit
        volatile ADCON3_REFSEL_e  refsel  : 3; // Bit 15-13: ADC Reference Voltage Selection
    }__attribute__((packed)) bits;
    volatile uint16_t value;
} ADCON3L_t;

typedef union {
    struct {
    // --- HIGH WORD ---
    #if (ADC_CORE_COUNT > 1)
    volatile ADCON3_CxEN_e c0en : 1; // Bit 0: Dedicated ADC Core #0 Enable
    #else
    volatile unsigned : 1; // reserved
    #endif
    #if (ADC_CORE_COUNT > 2)
    volatile ADCON3_CxEN_e c1en : 1; // Bit 1: Dedicated ADC Core #1 Enable
    #else
    volatile unsigned : 1; // reserved
    #endif
    #if (ADC_CORE_COUNT > 3)
    volatile ADCON3_CxEN_e c2en : 1; // Bit 2: Dedicated ADC Core #2 Enable
    #else
    volatile unsigned : 1; // reserved
    #endif
    #if (ADC_CORE_COUNT > 4)
    volatile ADCON3_CxEN_e c3en : 1; // Bit 3: Dedicated ADC Core #3 Enable
    #else
    volatile unsigned : 1; // reserved
    #endif
    #if (ADC_CORE_COUNT > 5)
    volatile ADCON3_CxEN_e c4en : 1; // Bit 4: Dedicated ADC Core #4 Enable
    #else
    volatile unsigned : 1; // reserved
    #endif
    #if (ADC_CORE_COUNT > 6)
    volatile ADCON3_CxEN_e c5en : 1; // Bit 5: Dedicated ADC Core #5 Enable
    #else
    volatile unsigned : 1; // reserved
    #endif
    #if (ADC_CORE_COUNT > 7)
    volatile ADCON3_CxEN_e c6en : 1;    // Bit 6: Dedicated ADC Core #6 Enable
    #else
    volatile unsigned : 1; // reserved
    #endif
    volatile ADCON3_SHREN_e shren : 1;   // Bit 7: Shared ADC Core Enable
    volatile ADCON3_CLKDIV_e clkdiv : 6; // Bit 13-8: ADC module source clock divider
    volatile ADCON3_CLKSEL_e clksel : 2; // Bit 15-14: ADC module source clock selection
    } __attribute__((packed)) bits;
    volatile uint16_t value;
} __attribute__((packed))ADCON3H_t;

typedef union {
    struct {
        volatile ADCON3L_t adcon3l;
        volatile ADCON3H_t adcon3h;
    }bits;
    volatile uint32_t value;
} ADCON3_t;


#if (ADC_CORE_COUNT > 1)

    // REGISTER ADCON4: ANALOG-TO-DIGITAL CONTROL REGISTER 4 LOW/HIGH

    #define REG_ADCON4_VALID_DATA_WRITE_MSK    (uint32_t)(0xFFFF0000 | ADCORE_REGISTER_BIT_MSK)
    #define REG_ADCON4_VALID_DATA_READ_MSK     REG_ADCON4_VALID_DATA_WRITE_MSK

    #define REG_ADCON4L_RESET                   0b0000000000000000  // Reset ADCON 4 Low Register
    #define REG_ADCON4L_VALID_DATA_WRITE_MSK    0b0000111100001111  // Bit mask used to set unimplemented bits to zero
    #define REG_ADCON4L_VALID_DATA_READ_MSK     0b0000111100001111	// Bit mask used to set unimplemented bits to zero

    #define REG_ADCON4H_RESET                   0b0000000000000000  // Reset ADCON 4 High Register
    #define REG_ADCON4H_VALID_DATA_WRITE_MSK    0b0000000011111111	// Bit mask used to set unimplemented bits to zero
    #define REG_ADCON4H_VALID_DATA_READ_MSK     0b0000000011111111	// Bit mask used to set unimplemented bits to zero

    #define REG_SYNCTRGSHR_SYNC_TO_SOURCE       0b0100000000000000  // Shared Core synchronized to source clock
    #define REG_SYNCTRGSHR_INDEPENDENT          0b0000000000000000  // Shared Core not synchronized to source clock

    #if (ADC_CORE_COUNT > 7)
        #define REG_SYNCTRG6_SYNC_TO_SOURCE     0b0100000000000000  // Dedicated Core #6 synchronized to source clock
        #define REG_SYNCTRG6_INDEPENDENT        0b0000000000000000  // Dedicated Core #6 not synchronized to source clock
    #endif
    #if (ADC_CORE_COUNT > 6)
        #define REG_SYNCTRG5_SYNC_TO_SOURCE     0b0010000000000000  // Dedicated Core #5 synchronized to source clock
        #define REG_SYNCTRG5_INDEPENDENT        0b0000000000000000  // Dedicated Core #5 not synchronized to source clock
    #endif
    #if (ADC_CORE_COUNT > 5)
        #define REG_SYNCTRG4_SYNC_TO_SOURCE     0b0001000000000000  // Dedicated Core #4 synchronized to source clock
        #define REG_SYNCTRG4_INDEPENDENT        0b0000000000000000  // Dedicated Core #4 not synchronized to source clock
    #endif
    #if (ADC_CORE_COUNT > 4)
        #define REG_SYNCTRG3_SYNC_TO_SOURCE     0b0000100000000000  // Dedicated Core #3 synchronized to source clock
        #define REG_SYNCTRG3_INDEPENDENT        0b0000000000000000  // Dedicated Core #3 not synchronized to source clock
    #endif
    #if (ADC_CORE_COUNT > 3)
        #define REG_SYNCTRG2_SYNC_TO_SOURCE     0b0000010000000000  // Dedicated Core #2 synchronized to source clock
        #define REG_SYNCTRG2_INDEPENDENT        0b0000000000000000  // Dedicated Core #2 not synchronized to source clock
    #endif
    #if (ADC_CORE_COUNT > 2)
        #define REG_SYNCTRG1_SYNC_TO_SOURCE     0b0000001000000000  // Dedicated Core #1 synchronized to source clock
        #define REG_SYNCTRG1_INDEPENDENT        0b0000000000000000  // Dedicated Core #1 not synchronized to source clock
    #endif
    #if (ADC_CORE_COUNT > 1)
        #define REG_SYNCTRG0_SYNC_TO_SOURCE     0b0000000100000000  // Dedicated Core #0 synchronized to source clock
        #define REG_SYNCTRG0_INDEPENDENT        0b0000000000000000  // Dedicated Core #0 not synchronized to source clock
    #endif

