microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_adc.h
    typedef enum {
        ADCON4_SYNCTRGx_SYNC_TO_SOURCE = 0b1, // ADC core clock is synchronized to selected source clock
        ADCON4_SYNCTRGx_INDEPENDENT = 0b0 // ADC core clock is not synchronized to selected source clock
    } ADCON4_SYNCTRGx_e; // ADC core clock synchronization

    #if (ADC_CORE_COUNT > 7)
        #define REG_SAMC6EN_ENABLED             0b0000100000000000  // Core #6 synchronized to source clock
        #define REG_SAMC6EN_DISABLED            0b0000000000000000  // Core #6 not synchronized to source clock
    #endif 
    #if (ADC_CORE_COUNT > 6) 
        #define REG_SAMC5EN_ENABLED             0b0000100000000000  // Core #5 synchronized to source clock
        #define REG_SAMC5EN_DISABLED            0b0000000000000000  // Core #5 not synchronized to source clock
    #endif 
    #if (ADC_CORE_COUNT > 5) 
        #define REG_SAMC4EN_ENABLED             0b0000100000000000  // Core #4 synchronized to source clock
        #define REG_SAMC4EN_DISABLED            0b0000000000000000  // Core #4 not synchronized to source clock
    #endif 
    #if (ADC_CORE_COUNT > 4) 
        #define REG_SAMC3EN_ENABLED             0b0000100000000000  // Core #3 synchronized to source clock
        #define REG_SAMC3EN_DISABLED            0b0000000000000000  // Core #3 not synchronized to source clock
    #endif 
    #if (ADC_CORE_COUNT > 3) 
        #define REG_SAMC2EN_ENABLED             0b0000010000000000  // Core #2 synchronized to source clock
        #define REG_SAMC2EN_DISABLED            0b0000000000000000  // Core #2 not synchronized to source clock
    #endif 
    #if (ADC_CORE_COUNT > 2) 
        #define REG_SAMC1EN_ENABLED             0b0000001000000000  // Core #1 synchronized to source clock
        #define REG_SAMC1EN_DISABLED            0b0000000000000000  // Core #1 not synchronized to source clock
    #endif 
    #if (ADC_CORE_COUNT > 1) 
        #define REG_SAMC0EN_ENABLED             0b0000000100000000  // Core #0 synchronized to source clock
        #define REG_SAMC0EN_DISABLED            0b0000000000000000  // Core #0 not synchronized to source clock
    #endif

    typedef enum {
        ADCON4_SAMCxEN_ENABLED = 0b1, // After trigger, the conversion will be delayed and the ADC core will continue sampling during the time specified by the SAMC<9:0> bits in the ADCORE1L register
        ADCON4_SAMCxEN_DISABLED = 0b0 // After trigger, the sampling will be stopped immediately and the conversion will be started on the next core clock cycle
    } ADCON4_SAMCxEN_e; // Dedicated ADC Core 1 Conversion Delay Enable


    // REGISTER ADCON4H: ANALOG-TO-DIGITAL CONTROL REGISTER 4 HIGH
    
    #if defined (__P33SMPS_CH_SLV__)

        typedef enum {
            ADCON4_C1CHS_S1ANC1 = 0b11, // Dedicated ADC Core 1 Input is Slave Core #1 positive differential input of AN1 
            ADCON4_C1CHS_SPGA2 = 0b10, // Dedicated ADC Core 1 Input is Slave Core #1 PGA2 output
            ADCON4_C1CHS_S1ANA1 = 0b01, // Dedicated ADC Core 1 Input is Slave Core #1 alternative AN1 input
            ADCON4_C1CHS_S1AN1 = 0b00 // Dedicated ADC Core 1 Input is Slave Core #1 AN1 input
        } ADCON4_C1CHS_e; // Dedicated ADC Core 1 Input Channel Selection

        typedef enum {
            ADCON4_C0CHS_S1ANC0 = 0b11, // Dedicated ADC Core 1 Input is Slave Core #01 positive differential input of AN0 
            ADCON4_C0CHS_SPGA1 = 0b10, // Dedicated ADC Core 1 Input is Slave Core #0 PGA1 output
            ADCON4_C0CHS_S1ANA0 = 0b01, // Dedicated ADC Core 1 Input is Slave Core #0 alternative AN0 input
            ADCON4_C0CHS_S1AN0 = 0b00 // Dedicated ADC Core 1 Input is Slave Core #0 AN0 input
        } ADCON4_C0CHS_e; // Dedicated ADC Core 0 Input Channel Selection

    #elif defined (__MA330048_dsPIC33CK_DPPIM__)

        #if (ADC_CORE_COUNT > 1)

        #define REG_ADCON4H_C0CHS_ANA0      0b0000000000000001
        #define REG_ADCON4H_C0CHS_AN0       0b0000000000000000

        typedef enum {
            ADCON4_C0CHS_ANA0 = 0b01, // Dedicated ADC Core 0 Input is alternative ANA0 input
            ADCON4_C0CHS_AN0 = 0b00 // Dedicated ADC Core 0 Input is AN0 input
        } ADCON4_C0CHS_e; // Dedicated ADC Core 0 Input Channel Selection

        #endif

        #if (ADC_CORE_COUNT > 2)
        #define REG_ADCON4H_C1CHS_ANA1      0b0000000000000100
        #define REG_ADCON4H_C1CHS_AN1       0b0000000000000000

        typedef enum {
            ADCON4_C1CHS_ANA1 = 0b01, // Dedicated ADC Core 1 Input is alternative ANA1 input
            ADCON4_C1CHS_AN1 = 0b00 // Dedicated ADC Core 1 Input is AN1 input
        } ADCON4_C1CHS_e; // Dedicated ADC Core 1 Input Channel Selection

        #endif

        #if (ADC_CORE_COUNT > 3)
        #define REG_ADCON4H_C2CHS_ANA2      0b0000000000010000
        #define REG_ADCON4H_C2CHS_AN2       0b0000000000000000

        typedef enum {
            ADCON4_C2CHS_ANA2 = 0b01, // Dedicated ADC Core 2 Input is alternative ANA2 input
            ADCON4_C2CHS_AN2 = 0b00 // Dedicated ADC Core 2 Input is AN2 input
        } ADCON4_C2CHS_e; // Dedicated ADC Core 2 Input Channel Selection

        #endif

        #if (ADC_CORE_COUNT > 4)
        #define REG_ADCON4H_C3CHS_ANA3      0b0000000001000000
        #define REG_ADCON4H_C3CHS_AN3       0b0000000000000000

        typedef enum {
            ADCON4_C3CHS_ANA3 = 0b01, // Dedicated ADC Core 3 Input is alternative ANA3 input
            ADCON4_C3CHS_AN3 = 0b00 // Dedicated ADC Core 3 Input is AN3 input
        } ADCON4_C3CHS_e; // Dedicated ADC Core 3 Input Channel Selection

        #endif

        #if (ADC_CORE_COUNT > 5)
        #define REG_ADCON4H_C4CHS_ANA4      0b0000000100000000
        #define REG_ADCON4H_C4CHS_AN4       0b0000000000000000

        typedef enum {
            ADCON4_C4CHS_ANA4 = 0b01, // Dedicated ADC Core 4 Input is alternative ANA4 input
            ADCON4_C4CHS_AN4 = 0b00 // Dedicated ADC Core 4 Input is AN4 input
        } ADCON4_C4CHS_e; // Dedicated ADC Core 4 Input Channel Selection

        #endif

        #if (ADC_CORE_COUNT > 6)
        #define REG_ADCON4H_C5CHS_ANA5      0b0000010000000000
        #define REG_ADCON4H_C5CHS_AN5       0b0000000000000000

