microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_adc.h
        typedef enum {
            ADCON4_C5CHS_ANA5 = 0b01, // Dedicated ADC Core 5 Input is alternative ANA5 input
            ADCON4_C5CHS_AN5 = 0b00 // Dedicated ADC Core 5 Input is AN5 input
        } ADCON4_C5CHS_e; // Dedicated ADC Core 5 Input Channel Selection

        #endif

        #if (ADC_CORE_COUNT > 7)
        #define REG_ADCON4H_C6CHS_ANA5      0b0001000000000000
        #define REG_ADCON4H_C6CHS_AN5       0b0000000000000000

        typedef enum {
            ADCON4_C6CHS_ANA6 = 0b01, // Dedicated ADC Core 6 Input is alternative ANA6 input
            ADCON6_C4CHS_AN6 = 0b00 // Dedicated ADC Core 6 Input is AN6 input
        } ADCON4_C6CHS_e; // Dedicated ADC Core 6 Input Channel Selection

        #endif

    #endif

    typedef union {
        struct {
            #if (ADC_CORE_COUNT > 1)
            volatile ADCON4_SAMCxEN_e samc0en : 1;  // Bit 0: Dedicated ADC Core 0 Conversion Delay Enable
            #else
            volatile unsigned : 1;  // reserved
            #endif
            #if (ADC_CORE_COUNT > 2)
            volatile ADCON4_SAMCxEN_e samc1en : 1; // Bit 1: Dedicated ADC Core 1 Conversion Delay Enable
            #else
            volatile unsigned : 1; // reserved
            #endif
            #if (ADC_CORE_COUNT > 3)
            volatile ADCON4_SAMCxEN_e samc2en : 1; // Bit 2: Dedicated ADC Core 2 Conversion Delay Enable
            #else
            volatile unsigned : 1; // reserved
            #endif
            #if (ADC_CORE_COUNT > 4)
            volatile ADCON4_SAMCxEN_e samc3en : 1; // Bit 3: Dedicated ADC Core 3 Conversion Delay Enable
            #else
            volatile unsigned : 1; // reserved
            #endif
            #if (ADC_CORE_COUNT > 5)
            volatile ADCON4_SAMCxEN_e samc4en : 1; // Bit 4: Dedicated ADC Core 4 Conversion Delay Enable
            #else
            volatile unsigned : 1; // reserved
            #endif
            #if (ADC_CORE_COUNT > 6)
            volatile ADCON4_SAMCxEN_e samc5en : 1; // Bit 5: Dedicated ADC Core 5 Conversion Delay Enable
            #else
            volatile unsigned : 1; // reserved
            #endif
            #if (ADC_CORE_COUNT > 7)
            volatile ADCON4_SAMCxEN_e samc6en : 1; // Bit 6: Dedicated ADC Core 6 Conversion Delay Enable
            #else
            volatile unsigned : 1; // reserved
            #endif
            volatile unsigned : 1;                  // Bit 7: reserved
            #if (ADC_CORE_COUNT > 1)
            volatile ADCON4_SYNCTRGx_e synctrg0 : 1; // Bit 8: ADC Core 0 clock synchronization
            #else
            volatile unsigned : 1; // reserved
            #endif
            #if (ADC_CORE_COUNT > 2)
            volatile ADCON4_SYNCTRGx_e synctrg1 : 1; // Bit 9: ADC Core 1 clock synchronization
            #else
            volatile unsigned : 1; // reserved
            #endif
            #if (ADC_CORE_COUNT > 3)
            volatile ADCON4_SYNCTRGx_e synctrg2 : 1; // Bit 10: ADC Core 2 clock synchronization
            #else
            volatile unsigned : 1; // reserved
            #endif
            #if (ADC_CORE_COUNT > 4)
            volatile ADCON4_SYNCTRGx_e synctrg3 : 1; // Bit 11: ADC Core 3 clock synchronization
            #else
            volatile unsigned : 1; // reserved
            #endif
            #if (ADC_CORE_COUNT > 5)
            volatile ADCON4_SYNCTRGx_e synctrg4 : 1; // Bit 12: ADC Core 4 clock synchronization
            #else
            volatile unsigned : 1; // reserved
            #endif
            #if (ADC_CORE_COUNT > 6)
            volatile ADCON4_SYNCTRGx_e synctrg5 : 1; // Bit 13: ADC Core 5 clock synchronization
            #else
            volatile unsigned : 1; // reserved
            #endif
            #if (ADC_CORE_COUNT > 7)
            volatile ADCON4_SYNCTRGx_e synctrg6 : 1; // Bit 14: ADC Core 6 clock synchronization
            #else
            volatile unsigned : 1; // reserved
            #endif
            volatile unsigned : 1;                  // Bit 15: reserved
        }__attribute__((packed)) bits;
        volatile uint16_t value;
    } ADCON4L_t;       // ADCON4L: ADC CONTROL REGISTER 4 LOW
    
    
    typedef union {
        struct {
            #if (ADC_CORE_COUNT > 1)
            volatile ADCON4_C0CHS_e c0chs : 2; // Bit 1-0: ADC Core 0 analog input selection
            #else
            volatile unsigned : 2; // reserved
            #endif
            #if (ADC_CORE_COUNT > 2)
            volatile ADCON4_C1CHS_e c1chs : 2; // Bit 3-2: ADC Core 1 analog input selection
            #else
            volatile unsigned : 2; // reserved
            #endif
            #if (ADC_CORE_COUNT > 3)
            volatile ADCON4_C2CHS_e c2chs : 2; // Bit 5-4: ADC Core 2 analog input selection
            #else
            volatile unsigned : 2; // reserved
            #endif
            #if (ADC_CORE_COUNT > 4)
            volatile ADCON4_C3CHS_e c3chs : 2; // Bit 7-6: ADC Core 3 analog input selection
            #else
            volatile unsigned : 2; // reserved
            #endif
            #if (ADC_CORE_COUNT > 5)
            volatile ADCON4_C3CHS_e c4chs : 2; // Bit 9-8: ADC Core 4 analog input selection
            #else
            volatile unsigned : 2; // reserved
            #endif
            #if (ADC_CORE_COUNT > 6)
            volatile ADCON4_C3CHS_e c5chs : 2; // Bit 11-10: ADC Core 5 analog input selection
            #else
            volatile unsigned : 2; // reserved
            #endif
            #if (ADC_CORE_COUNT > 7)
            volatile ADCON4_C3CHS_e c6chs : 2; // Bit 13-12: ADC Core 6 analog input selection
            #else
            volatile unsigned : 2; // reserved
            #endif
            volatile unsigned : 2;              // Bit 15-14: reserved
        } __attribute__((packed)) bits;
        volatile uint16_t value;
    } ADCON4H_t;        // ADCON4H: ADC CONTROL REGISTER 4 HIGH
    
    typedef union {
        struct {
            volatile ADCON4L_t SAMC_EN; // Dedicated ADC Core 0-n Conversion Delay Enable bit
            volatile ADCON4H_t CHS;     // Dedicated ADC Core 0-n Input Channel Selection bits
        } bits;
        volatile uint32_t value;
    } ADCON4_t; // Merged ADC CONTROL REGISTER 4 HIGH/LOW

#else

    // this dummy-memory space will fill the gap when a device doesn't have dedicated ADc cores
    // and therefore related registers are not implemented
    typedef struct {
        volatile uint32_t : 32; // (reserved)
    } __attribute__((packed)) ADCON4_t;

#endif // end of ADCON4 defines, whcih are only available if dedicated ADC cores are present

