microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_adc.h
// REGISTERS ADCON5L/H: ANALOG-TO-DIGITAL CONTROL REGISTER 5 LOW/HIGH

#define REG_ADCON5_VALID_DATA_WRITE_MSK     (uint32_t)(0x0F000000 | (ADCORE_REGISTER_BIT_MSK << 16) | (ADCORE_REGISTER_BIT_MSK << 8) | ADCORE_REGISTER_BIT_MSK)
#define REG_ADCON5_VALID_DATA_READ_MSK      (uint32_t)(0x0F000000 | (ADCORE_REGISTER_BIT_MSK << 16) | ADCORE_REGISTER_BIT_MSK)
#define REG_ADCON5_DISABLE_ADC_CORES_MSK    (uint32_t)(0xFFFFFF00)

#define REG_ADCON5L_RESET                   0b0000000000000000          // Reset ADCON 5 Low Register (all ADC cores turned off)
#define REG_ADCON5L_VALID_DATA_WRITE_MSK    (uint16_t)ADCORE_REGISTER_BIT_MSK	// Bit mask used to set unimplemented bits to zero
#define REG_ADCON5L_VALID_DATA_READ_MSK     (uint16_t)((ADCORE_REGISTER_BIT_MSK << 8) | ADCORE_REGISTER_BIT_MSK)	// Bit mask used to set unimplemented bits to zero
#define REG_ADCON5L_DISABLE_ADC_CORES_MSK   (uint16_t)(0xFF00)

#define REG_ADCON5H_RESET                   (0x0F00)      // Reset ADCON 5 High Register (maximum warm-up time, all ADC CORE READY ISRs off)
#define REG_ADCON5H_VALID_DATA_WRITE_MSK    (uint16_t)(0x0F00 | ADCORE_REGISTER_BIT_MSK)		// Bit mask used to set unimplemented bits to zero
#define REG_ADCON5H_VALID_DATA_READ_MSK     (uint16_t)(0x0F00 | ADCORE_REGISTER_BIT_MSK)		// Bit mask used to set unimplemented bits to zero

#define REG_ADCON5L_SHRRDY_PWROK            0b1000000000000000      // Sharder ADC Core powered and ready
#define REG_ADCON5L_SHRRDY_FF               0b0000000000000000      // Sharder ADC Core is not powered

#if (ADC_CORE_COUNT > 1)
    #define REG_ADCON5L_C0RDY_PWROK         0b0000000100000000      // Dedicated ADC Core #0 powered and ready
    #define REG_ADCON5L_C0RDY_FF            0b0000000000000000      // Dedicated ADC Core #0 is not powered
#endif
#if (ADC_CORE_COUNT > 2)
    #define REG_ADCON5L_C1RDY_PWROK         0b0000001000000000      // Dedicated ADC Core #1 powered and ready
    #define REG_ADCON5L_C1RDY_FF            0b0000000000000000      // Dedicated ADC Core #1 is not powered
#endif
#if (ADC_CORE_COUNT > 3)
    #define REG_ADCON5L_C2RDY_PWROK         0b0000010000000000      // Dedicated ADC Core #2 powered and ready
    #define REG_ADCON5L_C2RDY_FF            0b0000000000000000      // Dedicated ADC Core #2 is not powered
#endif
#if (ADC_CORE_COUNT > 4)
    #define REG_ADCON5L_C3RDY_PWROK         0b0000100000000000      // Dedicated ADC Core #3 powered and ready
    #define REG_ADCON5L_C3RDY_FF            0b0000000000000000      // Dedicated ADC Core #3 is not powered
#endif
#if (ADC_CORE_COUNT > 5)
    #define REG_ADCON5L_C4RDY_PWROK         0b0001000000000000      // Dedicated ADC Core #4 powered and ready
    #define REG_ADCON5L_C4RDY_FF            0b0000000000000000      // Dedicated ADC Core #4 is not powered
#endif
#if (ADC_CORE_COUNT > 6)
    #define REG_ADCON5L_C5RDY_PWROK         0b0010000000000000      // Dedicated ADC Core #5 powered and ready
    #define REG_ADCON5L_C5RDY_FF            0b0000000000000000      // Dedicated ADC Core #5 is not powered
#endif
#if (ADC_CORE_COUNT > 7)
    #define REG_ADCON5L_C6RDY_PWROK         0b0100000000000000      // Dedicated ADC Core #6 powered and ready
    #define REG_ADCON5L_C6RDY_FF            0b0000000000000000      // Dedicated ADC Core #6 is not powered
#endif

#define RES_ADCON5L_CxRDY(adc_core)     (uint16_t)(pow(2, adc_core) << 8) // the shared core is always treated as "Core #7"

typedef enum {
    ADCON5_CxRDY_STAT_PWROK = 0b1, // ADC Core #n powered and ready
    ADCON5_CxRDY_OFF = 0b0 // ADC Core is turned off/not powered
} ADCON5_CxRDY_e;


#define REG_ADCON5L_SHRPWR_ON           0b0000000010000000      // Shared ADC Core switched on
#define REG_ADCON5L_SHRPWR_OFF          0b0000000000000000      // Shared ADC Core switched off

#if (ADC_CORE_COUNT > 1)
    #define REG_ADCON5L_C0PWR_ON            0b0000000000000001      // Dedicated ADC Core #0 powered
    #define REG_ADCON5L_C0PWR_OFF           0b0000000000000000      // Dedicated ADC Core #0 switched off
#endif
#if (ADC_CORE_COUNT > 2)
    #define REG_ADCON5L_C1PWR_ON            0b0000000000000010      // Dedicated ADC Core #1 powered
    #define REG_ADCON5L_C1PWR_OFF           0b0000000000000000      // Dedicated ADC Core #1 switched off
#endif
#if (ADC_CORE_COUNT > 3)
    #define REG_ADCON5L_C2PWR_ON            0b0000000000000100      // Dedicated ADC Core #2 powered
    #define REG_ADCON5L_C2PWR_OFF           0b0000000000000000      // Dedicated ADC Core #2 switched off
#endif
#if (ADC_CORE_COUNT > 4)
    #define REG_ADCON5L_C3PWR_ON            0b0000000000001000      // Dedicated ADC Core #3 powered
    #define REG_ADCON5L_C3PWR_OFF           0b0000000000000000      // Dedicated ADC Core #3 switched off
#endif
#if (ADC_CORE_COUNT > 5)
    #define REG_ADCON5L_C4PWR_ON            0b0000000000010000      // Dedicated ADC Core #4 powered
    #define REG_ADCON5L_C4PWR_OFF           0b0000000000000000      // Dedicated ADC Core #4 switched off
#endif
#if (ADC_CORE_COUNT > 6)
    #define REG_ADCON5L_C5PWR_ON            0b0000000000100000      // Dedicated ADC Core #5 powered
    #define REG_ADCON5L_C5PWR_OFF           0b0000000000000000      // Dedicated ADC Core #5 switched off
#endif
#if (ADC_CORE_COUNT > 7)
    #define REG_ADCON5L_C6PWR_ON            0b0000000001000000      // Dedicated ADC Core #6 powered
    #define REG_ADCON5L_C6PWR_OFF           0b0000000000000000      // Dedicated ADC Core #6 switched off
#endif

#define REG_ADCON5L_CxPWR(adc_core)     (uint16_t)(pow(2.0, adc_core)) // the shared core is always treated as "Core #7"

typedef enum {
    ADCON5_CxPWR_ON = 0b1, // ADC Core #n powered 
    ADCON5_CxPWR_OFF = 0b0 // ADC Core is turned off/not powered
} ADCON5_CxPWR_e;

// REGISTER ADCON5H: ANALOG-TO-DIGITAL CONTROL REGISTER 5 HIGH

#define REG_ADCON5H_WARMTIME_CLK_32768	0b0000111100000000	// ADC Power Up Delay 0f 32768 ATADCORE cycles
#define REG_ADCON5H_WARMTIME_CLK_16384	0b0000111000000000	// ADC Power Up Delay 0f 16384 ATADCORE cycles
#define REG_ADCON5H_WARMTIME_CLK_8192	0b0000110100000000	// ADC Power Up Delay 0f 8192 ATADCORE cycles
#define REG_ADCON5H_WARMTIME_CLK_4096	0b0000110000000000	// ADC Power Up Delay 0f 4096 ATADCORE cycles
#define REG_ADCON5H_WARMTIME_CLK_2048	0b0000101100000000	// ADC Power Up Delay 0f 2048 ATADCORE cycles
#define REG_ADCON5H_WARMTIME_CLK_1024	0b0000101000000000	// ADC Power Up Delay 0f 1024 ATADCORE cycles
#define REG_ADCON5H_WARMTIME_CLK_512	0b0000100100000000	// ADC Power Up Delay 0f 512 ATADCORE cycles
#define REG_ADCON5H_WARMTIME_CLK_256	0b0000100000000000	// ADC Power Up Delay 0f 256 ATADCORE cycles
#define REG_ADCON5H_WARMTIME_CLK_128	0b0000011100000000	// ADC Power Up Delay 0f 128 ATADCORE cycles
#define REG_ADCON5H_WARMTIME_CLK_64		0b0000011000000000	// ADC Power Up Delay 0f 64 ATADCORE cycles
#define REG_ADCON5H_WARMTIME_CLK_32		0b0000010100000000	// ADC Power Up Delay 0f 32 ATADCORE cycles
#define REG_ADCON5H_WARMTIME_CLK_16		0b0000010000000000	// ADC Power Up Delay 0f 16 ATADCORE cycles
#define REG_ADCON5H_WARMTIME_NONE       0b0000000000000000  // (used for bypass during configuraiton, valid WARMTIME must be set before powering on ADC module)

