microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_adc.h
typedef enum {
    ADCON5H_WARMTIME_CLK_32768 = 0b1111, // 32768 Source Clock Periods
    ADCON5H_WARMTIME_CLK_16384 = 0b1110, // 16384 Source Clock Periods
    ADCON5H_WARMTIME_CLK_8192 = 0b1101, // 8192 Source Clock Periods
    ADCON5H_WARMTIME_CLK_4096 = 0b1100, // 4096 Source Clock Periods
    ADCON5H_WARMTIME_CLK_2048 = 0b1011, // 2048 Source Clock Periods
    ADCON5H_WARMTIME_CLK_1024 = 0b1010, // 1024 Source Clock Periods
    ADCON5H_WARMTIME_CLK_512 = 0b1001, // 512 Source Clock Periods
    ADCON5H_WARMTIME_CLK_256 = 0b1000, // 256 Source Clock Periods
    ADCON5H_WARMTIME_CLK_128 = 0b0111, // 128 Source Clock Periods
    ADCON5H_WARMTIME_CLK_64 = 0b0110, // 64 Source Clock Periods
    ADCON5H_WARMTIME_CLK_32 = 0b0101, // 32 Source Clock Periods
    ADCON5H_WARMTIME_CLK_16 = 0b0100, // 16 Source Clock Periods    
    ADCON5H_WARMTIME_NONE = 0b0000 // (used for bypass during configuration, valid WARMTIME must be set before powering on ADC module)
} ADCON5_WARMTIME_e; // ADC Dedicated Core x Power-up Delay bits


#define REG_ADCON5H_SHRCIE_ENABLED      0b0000000010000000      // Shared ADC Core Ready Interrupt enabled
#define REG_ADCON5H_SHRCIE_DISABLED     0b0000000000000000      // Shared ADC Core Ready Interrupt disabled

#if (ADC_CORE_COUNT > 1)
    #define REG_ADCON5H_C0CIE_ENABLED            0b0000000000000001      // Dedicated ADC Core #0 Ready Interrupt enabled
    #define REG_ADCON5H_C0CIE_DISABLED           0b0000000000000000      // Dedicated ADC Core #0 Ready Interrupt disabled
#endif
#if (ADC_CORE_COUNT > 2)
    #define REG_ADCON5H_C1CIE_ENABLED            0b0000000000000010      // Dedicated ADC Core #1 Ready Interrupt enabled
    #define REG_ADCON5H_C1CIE_DISABLED           0b0000000000000000      // Dedicated ADC Core #1 Ready Interrupt disabled
#endif
#if (ADC_CORE_COUNT > 3)
    #define REG_ADCON5H_C2CIE_ENABLED            0b0000000000000100      // Dedicated ADC Core #2 Ready Interrupt enabled
    #define REG_ADCON5H_C2CIE_DISABLED           0b0000000000000000      // Dedicated ADC Core #2 Ready Interrupt disabled
#endif
#if (ADC_CORE_COUNT > 4)
    #define REG_ADCON5H_C3CIE_ENABLED            0b0000000000001000      // Dedicated ADC Core #3 Ready Interrupt enabled
    #define REG_ADCON5H_C3CIE_DISABLED           0b0000000000000000      // Dedicated ADC Core #3 Ready Interrupt disabled
#endif
#if (ADC_CORE_COUNT > 5)
    #define REG_ADCON5H_C4CIE_ENABLED            0b0000000000010000      // Dedicated ADC Core #4 Ready Interrupt enabled
    #define REG_ADCON5H_C4CIE_DISABLED           0b0000000000000000      // Dedicated ADC Core #4 Ready Interrupt disabled
#endif
#if (ADC_CORE_COUNT > 6)
    #define REG_ADCON5H_C5CIE_ENABLED            0b0000000000100000      // Dedicated ADC Core #5 Ready Interrupt enabled
    #define REG_ADCON5H_C5CIE_DISABLED           0b0000000000000000      // Dedicated ADC Core #5 Ready Interrupt disabled
#endif
#if (ADC_CORE_COUNT > 7)
    #define REG_ADCON5H_C6CIE_ENABLED            0b0000000001000000      // Dedicated ADC Core #6 Ready Interrupt enabled
    #define REG_ADCON5H_C6CIE_DISABLED           0b0000000000000000      // Dedicated ADC Core #6 Ready Interrupt disabled
#endif

#define RES_ADCON5H_CxCIE(adc_core)     (uint16_t)(pow(2, adc_core)) // the shared core is always treated as "Core #7"

typedef enum {
    ADCON5L_CxCIE_ENABLED = 0b1, // ADC Core #n Ready Interrupt enabled
    ADCON5L_CxCIE_DISABLED = 0b0 // ADC Core #n Ready Interrupt disabled
} ADCON5_CxCIE_e;

typedef union {
    
    struct {
        #if (ADC_CORE_COUNT > 1)
        volatile ADCON5_CxPWR_e C0PWR : 1; // Bit 0: Dedicated ADC Core #0 Power Enable
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_CORE_COUNT > 2)
        volatile ADCON5_CxPWR_e C1PWR : 1; // Bit 1: Dedicated ADC Core #1 Power Enable
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_CORE_COUNT > 3)
        volatile ADCON5_CxPWR_e C2PWR : 1; // Bit 2: Dedicated ADC Core #2 Power Enable
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_CORE_COUNT > 4)
        volatile ADCON5_CxPWR_e C3PWR : 1; // Bit 3: Dedicated ADC Core #3 Power Enable
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_CORE_COUNT > 5)
        volatile ADCON5_CxPWR_e C4PWR : 1; // Bit 4: Dedicated ADC Core #4 Power Enable
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_CORE_COUNT > 6)
        volatile ADCON5_CxPWR_e C5PWR : 1; // Bit 5: Dedicated ADC Core #5 Power Enable
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_CORE_COUNT > 7)
        volatile ADCON5_CxPWR_e C6PWR : 1; // Bit 6: Dedicated ADC Core #6 Power Enable
        #else
        volatile unsigned : 1; // reserved
        #endif

        volatile ADCON5_CxPWR_e SHRPWR : 1; // Bit 7: Shared ADC Core Power Enable

        #if (ADC_CORE_COUNT > 1)
        volatile ADCON5_CxRDY_e C0RDY : 1; // Bit 8: Dedicated ADC Core #0 "Powered & Ready" Status
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_CORE_COUNT > 2)
        volatile ADCON5_CxRDY_e C1RDY : 1; // Bit 9: Dedicated ADC Core #1 "Powered & Ready" Status
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_CORE_COUNT > 3)
        volatile ADCON5_CxRDY_e C2RDY : 1; // Bit 10: Dedicated ADC Core #2 "Powered & Ready" Status
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_CORE_COUNT > 4)
        volatile ADCON5_CxRDY_e C3RDY : 1; // Bit 11: Dedicated ADC Core #3 "Powered & Ready" Status
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_CORE_COUNT > 5)
        volatile ADCON5_CxRDY_e C4RDY : 1; // Bit 12: Dedicated ADC Core #4 "Powered & Ready" Status
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_CORE_COUNT > 6)
        volatile ADCON5_CxRDY_e C5RDY : 1; // Bit 13: Dedicated ADC Core #5 "Powered & Ready" Status
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_CORE_COUNT > 7)
        volatile ADCON5_CxRDY_e C6RDY : 1; // Bit 14: Dedicated ADC Core #6 "Powered & Ready" Status
        #else
        volatile unsigned : 1; // reserved
        #endif

