microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_adc.h
        volatile ADCON5_CxRDY_e SHRRDY : 1; // Bit 15: Shared ADC Core "Powered & Ready" Status

    } __attribute__((packed)) bits;
    volatile uint16_t value;
} ADCON5L_t; // ADCON5L: ADC CONTROL REGISTER 5 LOW

typedef union {
    struct {
        #if (ADC_CORE_COUNT > 1)
        volatile ADCON5_CxCIE_e C0CIE : 1; // Bit 0: Dedicated ADC Core #0 Ready Common Interrupt Enable
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_CORE_COUNT > 2)
        volatile ADCON5_CxCIE_e C1CIE : 1; // Bit 1: Dedicated ADC Core #1 Ready Common Interrupt Enable
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_CORE_COUNT > 3)
        volatile ADCON5_CxCIE_e C2CIE : 1; // Bit 2: Dedicated ADC Core #2 Ready Common Interrupt Enable
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_CORE_COUNT > 4)
        volatile ADCON5_CxCIE_e C3CIE : 1; // Bit 3: Dedicated ADC Core #3 Ready Common Interrupt Enable
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_CORE_COUNT > 5)
        volatile ADCON5_CxCIE_e C4CIE : 1; // Bit 4: Dedicated ADC Core #4 Ready Common Interrupt Enable
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_CORE_COUNT > 6)
        volatile ADCON5_CxCIE_e C5CIE : 1; // Bit 5: Dedicated ADC Core #5 Ready Common Interrupt Enable
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_CORE_COUNT > 7)
        volatile ADCON5_CxCIE_e C6CIE : 1; // Bit 6: Dedicated ADC Core #6 Ready Common Interrupt Enable
        #else
        volatile unsigned : 1; // reserved
        #endif

        volatile ADCON5_CxCIE_e shrcie : 1;      // Bit 7: Shared ADC Core Ready Common Interrupt Enable
        volatile ADCON5_WARMTIME_e warmtime : 4; // Bit 11-8: ADC Dedicated Core x Power-up Delay
        volatile unsigned : 4;                   // Bit 15-12: reserved

    } __attribute__((packed)) bits;
    volatile uint16_t value;
} ADCON5H_t; // ADCON5H: ADC CONTROL REGISTER 5 HIGH

typedef union {
    struct {
        volatile ADCON5L_t adcon5l;
        volatile ADCON5H_t adcon5h;
    } bits;
    volatile uint32_t value;
}ADCON5_t; // ADCON5: ADC CONTROL REGISTER 5 HIGH/LOW

// REGISTER 19-11: ADCORExL: DEDICATED ADC CORE x CONTROL REGISTER LOW

#define REG_ADCORExL_RESET              0b0000001111111111      // Reset ADCOREx Low Register
#define REG_ADCORExL_VALID_DATA_MSK		0b0000001111111111		// Bit mask used to set unimplemented bits to zero

#define REG_SAMC_MSK                    0b0000001111111111      // ADCOREx Conversion Delay Filter Mask
#define REG_SAMC(x)						((x-2) & REG_SAMC_MSK) 	// ADCOREx Conversion Delay Value

// REGISTER 19-12: ADCORExH: DEDICATED ADC CORE x CONTROL REGISTER HIGH

#define REG_ADCORExH_RESET              0b0000000000000000      // Reset ADCOREx High Register
#define REG_ADCORExH_VALID_DATA_MSK		0b0001111101111111		// Bit mask used to set unimplemented bits to zero

#define REG_EISEL_8TAD                  0b0001110000000000      // ADCOREx Early Interrupt 8 TADs before ready
#define REG_EISEL_7TAD                  0b0001100000000000      // ADCOREx Early Interrupt 7 TADs before ready
#define REG_EISEL_6TAD                  0b0001010000000000      // ADCOREx Early Interrupt 6 TADs before ready
#define REG_EISEL_5TAD                  0b0001000000000000      // ADCOREx Early Interrupt 5 TADs before ready
#define REG_EISEL_4TAD                  0b0000110000000000      // ADCOREx Early Interrupt 4 TADs before ready
#define REG_EISEL_3TAD                  0b0000100000000000      // ADCOREx Early Interrupt 3 TADs before ready
#define REG_EISEL_2TAD                  0b0000010000000000      // ADCOREx Early Interrupt 2 TADs before ready
#define REG_EISEL_1TAD                  0b0000000000000000      // ADCOREx Early Interrupt 1 TADs before ready

// ( ADCORE_EISEL enumeration can be found under ADCON2L declarations )

#define REG_ADC_RES_12BIT  0b0000001100000000      // ADC Core Resolution = 12bit
#define REG_ADC_RES_10BIT  0b0000001000000000      // ADC Core Resolution = 10bit
#define REG_ADC_RES_8BIT   0b0000000100000000      // ADC Core Resolution = 8bit
#define REG_ADC_RES_6BIT   0b0000000000000000      // ADC Core Resolution = 6bit

// ( ADCORE_ADCS enumeration can be found under ADCON1H declarations )

#define REG_ADCS_MSK       0b0000000001111111      // ADC Core Clock Divider Filter Mask
#define REG_ADCS(x)        (((volatile uint16_t)(x>>1)) & REG_ADCS_MSK)  // ADC Core Clock Divider Value

// ( ADCORE_RES enumeration can be found under ADCON2L declarations )

// REGISTER 19-13: ADLVLTRGL: ADC LEVEL_SENSITIVE TRIGGER CONTROL REGISTER LOW

#define REG_ADLVLTRGL_RESET             0b0000000000000000      // Reset ADLVLTRGL Low Register
#define REG_ADLVLTRGL_VALID_DATA_MSK	0b1111111111111111		// Bit mask used to set unimplemented bits to zero

#define REG_ADLVLTRGL_ALL_LEVEL         0b1111111111111111      // All ANx inputs are Level-Triggered
#define REG_ADLVLTRGL_ALL_EDGE          0b0000000000000000      // All ANx inputs are Edge-Triggered

#define REG_ADLVLTRGL_AN0_LEVEL         0b0000000000000001      // AN0 is Level-Triggered
#define REG_ADLVLTRGL_AN0_EDGE          0b0000000000000000      // AN0 is Edge-Triggered
#define REG_ADLVLTRGL_AN1_LEVEL         0b0000000000000010      // AN1 is Level-Triggered
#define REG_ADLVLTRGL_AN1_EDGE          0b0000000000000000      // AN1 is Edge-Triggered
#define REG_ADLVLTRGL_AN2_LEVEL         0b0000000000000100      // AN2 is Level-Triggered
#define REG_ADLVLTRGL_AN2_EDGE          0b0000000000000000      // AN2 is Edge-Triggered
#define REG_ADLVLTRGL_AN3_LEVEL         0b0000000000001000      // AN3 is Level-Triggered
#define REG_ADLVLTRGL_AN3_EDGE          0b0000000000000000      // AN3 is Edge-Triggered
#define REG_ADLVLTRGL_AN4_LEVEL         0b0000000000010000      // AN4 is Level-Triggered
#define REG_ADLVLTRGL_AN4_EDGE          0b0000000000000000      // AN4 is Edge-Triggered
#define REG_ADLVLTRGL_AN5_LEVEL         0b0000000000100000      // AN5 is Level-Triggered
#define REG_ADLVLTRGL_AN5_EDGE          0b0000000000000000      // AN5 is Edge-Triggered
#define REG_ADLVLTRGL_AN6_LEVEL         0b0000000001000000      // AN6 is Level-Triggered
#define REG_ADLVLTRGL_AN6_EDGE          0b0000000000000000      // AN6 is Edge-Triggered
#define REG_ADLVLTRGL_AN7_LEVEL         0b0000000010000000      // AN7 is Level-Triggered
#define REG_ADLVLTRGL_AN7_EDGE          0b0000000000000000      // AN7 is Edge-Triggered
#define REG_ADLVLTRGL_AN8_LEVEL         0b0000000100000000      // AN8 is Level-Triggered
#define REG_ADLVLTRGL_AN8_EDGE          0b0000000000000000      // AN8 is Edge-Triggered
#define REG_ADLVLTRGL_AN9_LEVEL         0b0000001000000000      // AN9 is Level-Triggered
#define REG_ADLVLTRGL_AN9_EDGE          0b0000000000000000      // AN9 is Edge-Triggered
#define REG_ADLVLTRGL_AN10_LEVEL        0b0000010000000000      // AN10 is Level-Triggered
#define REG_ADLVLTRGL_AN10_EDGE         0b0000000000000000      // AN10 is Edge-Triggered
#define REG_ADLVLTRGL_AN11_LEVEL        0b0000100000000000      // AN11 is Level-Triggered
#define REG_ADLVLTRGL_AN11_EDGE         0b0000000000000000      // AN11 is Edge-Triggered
#define REG_ADLVLTRGL_AN12_LEVEL        0b0001000000000000      // AN12 is Level-Triggered
#define REG_ADLVLTRGL_AN12_EDGE         0b0000000000000000      // AN12 is Edge-Triggered
#define REG_ADLVLTRGL_AN13_LEVEL        0b0010000000000000      // AN13 is Level-Triggered
#define REG_ADLVLTRGL_AN13_EDGE         0b0000000000000000      // AN13 is Edge-Triggered
#define REG_ADLVLTRGL_AN14_LEVEL        0b0100000000000000      // AN14 is Level-Triggered
#define REG_ADLVLTRGL_AN14_EDGE         0b0000000000000000      // AN14 is Edge-Triggered
#define REG_ADLVLTRGL_AN15_LEVEL        0b1000000000000000      // AN15 is Level-Triggered
#define REG_ADLVLTRGL_AN15_EDGE         0b0000000000000000      // AN15 is Edge-Triggered

// REGISTER 19-14: ADLVLTRGH: ADC LEVEL_SENSITIVE TRIGGER CONTROL REGISTER HIGH

