microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_adc.h
#define REG_ADLVLTRGH_RESET             0b0000000000000000      // Reset ADLVLTRGH High Register
#define REG_ADLVLTRGH_VALID_DATA_MSK	0b0000000000111111		// Bit mask used to set unimplemented bits to zero

#define REG_ADLVLTRGH_ALL_LEVEL         0b1111111111111111      // All ANx inputs are Level-Triggered
#define REG_ADLVLTRGH_ALL_EDGE          0b0000000000000000      // All ANx inputs are Edge-Triggered

#define REG_ADLVLTRGH_AN16_LEVEL        0b0000000000000001      // AN16 is Level-Triggered
#define REG_ADLVLTRGH_AN16_EDGE         0b0000000000000000      // AN16 is Edge-Triggered
#define REG_ADLVLTRGH_AN17_LEVEL        0b0000000000000010      // AN17 is Level-Triggered
#define REG_ADLVLTRGH_AN17_EDGE         0b0000000000000000      // AN17 is Edge-Triggered
#define REG_ADLVLTRGH_AN18_LEVEL        0b0000000000000100      // AN18 is Level-Triggered
#define REG_ADLVLTRGH_AN18_EDGE         0b0000000000000000      // AN18 is Edge-Triggered
#define REG_ADLVLTRGH_AN19_LEVEL        0b0000000000001000      // AN19 is Level-Triggered
#define REG_ADLVLTRGH_AN19_EDGE         0b0000000000000000      // AN19 is Edge-Triggered
#define REG_ADLVLTRGH_AN20_LEVEL        0b0000000000010000      // AN20 is Level-Triggered
#define REG_ADLVLTRGH_AN20_EDGE         0b0000000000000000      // AN20 is Edge-Triggered
#define REG_ADLVLTRGH_AN21_LEVEL        0b0000000000100000      // AN21 is Level-Triggered
#define REG_ADLVLTRGH_AN21_EDGE         0b0000000000000000      // AN21 is Edge-Triggered
#define REG_ADLVLTRGH_AN22_LEVEL        0b0000000001000000      // AN22 is Level-Triggered
#define REG_ADLVLTRGH_AN22_EDGE         0b0000000000000000      // AN22 is Edge-Triggered
#define REG_ADLVLTRGH_AN23_LEVEL        0b0000000010000000      // AN23 is Level-Triggered
#define REG_ADLVLTRGH_AN23_EDGE         0b0000000000000000      // AN23 is Edge-Triggered
#define REG_ADLVLTRGH_AN24_LEVEL        0b0000000100000000      // AN24 is Level-Triggered
#define REG_ADLVLTRGH_AN24_EDGE         0b0000000000000000      // AN24 is Edge-Triggered
#define REG_ADLVLTRGH_AN25_LEVEL        0b0000001000000000      // AN25 is Level-Triggered
#define REG_ADLVLTRGH_AN25_EDGE         0b0000000000000000      // AN25 is Edge-Triggered
#define REG_ADLVLTRGH_AN26_LEVEL        0b0000010000000000      // AN26 is Level-Triggered
#define REG_ADLVLTRGH_AN26_EDGE         0b0000000000000000      // AN26 is Edge-Triggered
#define REG_ADLVLTRGH_AN27_LEVEL        0b0000100000000000      // AN27 is Level-Triggered
#define REG_ADLVLTRGH_AN27_EDGE         0b0000000000000000      // AN27 is Edge-Triggered
#define REG_ADLVLTRGH_AN28_LEVEL        0b0001000000000000      // AN28 is Level-Triggered
#define REG_ADLVLTRGH_AN28_EDGE         0b0000000000000000      // AN28 is Edge-Triggered
#define REG_ADLVLTRGH_AN29_LEVEL        0b0010000000000000      // AN29 is Level-Triggered
#define REG_ADLVLTRGH_AN29_EDGE         0b0000000000000000      // AN29 is Edge-Triggered
#define REG_ADLVLTRGH_AN30_LEVEL        0b0100000000000000      // AN30 is Level-Triggered
#define REG_ADLVLTRGH_AN30_EDGE         0b0000000000000000      // AN30 is Edge-Triggered
#define REG_ADLVLTRGH_AN31_LEVEL        0b1000000000000000      // AN31 is Level-Triggered
#define REG_ADLVLTRGH_AN31_EDGE         0b0000000000000000      // AN31 is Edge-Triggered

typedef enum {
    ADLVLTRG_ANx_LEVEL = 0b1, // ANx is Level-Triggered
    ADLVLTRG_ANx_EDGE = 0b0  // ANx is Edge-Triggered (default)
}ADLVLTRG_e; // Level Trigger for Corresponding Analog Input Enable bits


// REGISTER 19-15: ADEIEH: ADC EARLY INTERRUPT ENABLE REGISTER LOW

#define REG_ADEIEL_RESET                0b0000000000000000      // Reset ADLVLTRGH High Register
#define REG_ADEIEL_VALID_DATA_MSK		0b1111111111111111		// Bit mask used to set unimplemented bits to zero
#define REG_ADEIEH_VALID_DATA_MSK		0b0000000000111111		// Bit mask used to set unimplemented bits to zero

#define REG_ADEIEL_ALL_ENABLED          0b1111111111111111      // Early Interrupt Enabled for all ANx inputs
#define REG_ADEIEL_ALL_DISABLED         0b0000000000000000      // Early Interrupt Disabled for all ANx inputs

#define REG_ADEIEL_AN0_ENABLED          0b0000000000000001      // Early Interrupt Enabled for AN0 
#define REG_ADEIEL_AN0_DISABLED         0b0000000000000000      // Early Interrupt Disabled for AN0 
#define REG_ADEIEL_AN1_ENABLED          0b0000000000000010      // Early Interrupt Enabled for AN1
#define REG_ADEIEL_AN1_DISABLED         0b0000000000000000      // Early Interrupt Disabled for AN1 
#define REG_ADEIEL_AN2_ENABLED          0b0000000000000100      // Early Interrupt Enabled for AN2
#define REG_ADEIEL_AN2_DISABLED         0b0000000000000000      // Early Interrupt Disabled for AN2 
#define REG_ADEIEL_AN3_ENABLED          0b0000000000001000      // Early Interrupt Enabled for AN3
#define REG_ADEIEL_AN3_DISABLED         0b0000000000000000      // Early Interrupt Disabled for AN3 
#define REG_ADEIEL_AN4_ENABLED          0b0000000000010000      // Early Interrupt Enabled for AN4
#define REG_ADEIEL_AN4_DISABLED         0b0000000000000000      // Early Interrupt Disabled for AN4 
#define REG_ADEIEL_AN5_ENABLED          0b0000000000100000      // Early Interrupt Enabled for AN5
#define REG_ADEIEL_AN5_DISABLED         0b0000000000000000      // Early Interrupt Disabled for AN5 
#define REG_ADEIEL_AN6_ENABLED          0b0000000001000000      // Early Interrupt Enabled for AN6
#define REG_ADEIEL_AN6_DISABLED         0b0000000000000000      // Early Interrupt Disabled for AN6 
#define REG_ADEIEL_AN7_ENABLED          0b0000000010000000      // Early Interrupt Enabled for AN7
#define REG_ADEIEL_AN7_DISABLED         0b0000000000000000      // Early Interrupt Disabled for AN7 
#define REG_ADEIEL_AN8_ENABLED          0b0000000100000000      // Early Interrupt Enabled for AN8
#define REG_ADEIEL_AN8_DISABLED         0b0000000000000000      // Early Interrupt Disabled for AN8 
#define REG_ADEIEL_AN9_ENABLED          0b0000001000000000      // Early Interrupt Enabled for AN9
#define REG_ADEIEL_AN9_DISABLED         0b0000000000000000      // Early Interrupt Disabled for AN9 
#define REG_ADEIEL_AN10_ENABLED         0b0000010000000000      // Early Interrupt Enabled for AN10 
#define REG_ADEIEL_AN10_DISABLED        0b0000000000000000      // Early Interrupt Disabled for AN10 
#define REG_ADEIEL_AN11_ENABLED         0b0000100000000000      // Early Interrupt Enabled for AN11
#define REG_ADEIEL_AN11_DISABLED        0b0000000000000000      // Early Interrupt Disabled for AN11 
#define REG_ADEIEL_AN12_ENABLED         0b0001000000000000      // Early Interrupt Enabled for AN12
#define REG_ADEIEL_AN12_DISABLED        0b0000000000000000      // Early Interrupt Disabled for AN12 
#define REG_ADEIEL_AN13_ENABLED         0b0010000000000000      // Early Interrupt Enabled for AN13
#define REG_ADEIEL_AN13_DISABLED        0b0000000000000000      // Early Interrupt Disabled for AN13 
#define REG_ADEIEL_AN14_ENABLED         0b0100000000000000      // Early Interrupt Enabled for AN14
#define REG_ADEIEL_AN14_DISABLED        0b0000000000000000      // Early Interrupt Disabled for AN14 
#define REG_ADEIEL_AN15_ENABLED         0b1000000000000000      // Early Interrupt Enabled for AN15
#define REG_ADEIEL_AN15_DISABLED        0b0000000000000000      // Early Interrupt Disabled for AN15

// REGISTER 19-16: ADEIEH: ADC EARLY INTERRUPT ENABLE REGISTER HIGH

#define REG_ADEIEH_RESET                0b0000000000000000      // Reset ADLVLTRGH High Register
#define REG_ADEIEH_VALID_DATA_MSK		0b0000000000111111		// Bit mask used to set unimplemented bits to zero

#define REG_ADEIEH_ALL_ENABLED          0b1111111111111111      // Early Interrupt Enabled for all ANx inputs
#define REG_ADEIEH_ALL_DISABLED         0b0000000000000000      // Early Interrupt Disabled for all ANx inputs

#define REG_ADEIEH_AN16_ENABLED         0b0000000000000001      // Early Interrupt Enabled for AN16
#define REG_ADEIEH_AN16_DISABLED        0b0000000000000000      // Early Interrupt Disabled for AN16 
#define REG_ADEIEH_AN17_ENABLED         0b0000000000000010      // Early Interrupt Enabled for AN17
#define REG_ADEIEH_AN17_DISABLED        0b0000000000000000      // Early Interrupt Disabled for AN17 
#define REG_ADEIEH_AN18_ENABLED         0b0000000000000100      // Early Interrupt Enabled for AN18
#define REG_ADEIEH_AN18_DISABLED        0b0000000000000000      // Early Interrupt Disabled for AN18 
#define REG_ADEIEH_AN19_ENABLED         0b0000000000001000      // Early Interrupt Enabled for AN19
#define REG_ADEIEH_AN19_DISABLED        0b0000000000000000      // Early Interrupt Disabled for AN19 
#define REG_ADEIEH_AN20_ENABLED         0b0000000000010000      // Early Interrupt Enabled for AN20
#define REG_ADEIEH_AN20_DISABLED        0b0000000000000000      // Early Interrupt Disabled for AN20 
#define REG_ADEIEH_AN21_ENABLED         0b0000000000100000      // Early Interrupt Enabled for AN21
#define REG_ADEIEH_AN21_DISABLED        0b0000000000000000      // Early Interrupt Disabled for AN21 
#define REG_ADEIEH_AN22_ENABLED         0b0000000001000000      // Early Interrupt Enabled for AN22
#define REG_ADEIEH_AN22_DISABLED        0b0000000000000000      // Early Interrupt Disabled for AN22 
#define REG_ADEIEH_AN23_ENABLED         0b0000000010000000      // Early Interrupt Enabled for AN23
#define REG_ADEIEH_AN23_DISABLED        0b0000000000000000      // Early Interrupt Disabled for AN23 
#define REG_ADEIEH_AN24_ENABLED         0b0000000100000000      // Early Interrupt Enabled for AN24
#define REG_ADEIEH_AN24_DISABLED        0b0000000000000000      // Early Interrupt Disabled for AN24 
#define REG_ADEIEH_AN25_ENABLED         0b0000001000000000      // Early Interrupt Enabled for AN25
#define REG_ADEIEH_AN25_DISABLED        0b0000000000000000      // Early Interrupt Disabled for AN25 
#define REG_ADEIEH_AN26_ENABLED         0b0000010000000000      // Early Interrupt Enabled for AN26
#define REG_ADEIEH_AN26_DISABLED        0b0000000000000000      // Early Interrupt Disabled for AN26 
#define REG_ADEIEH_AN27_ENABLED         0b0000100000000000      // Early Interrupt Enabled for AN27
#define REG_ADEIEH_AN27_DISABLED        0b0000000000000000      // Early Interrupt Disabled for AN27 
#define REG_ADEIEH_AN28_ENABLED         0b0001000000000000      // Early Interrupt Enabled for AN28
#define REG_ADEIEH_AN28_DISABLED        0b0000000000000000      // Early Interrupt Disabled for AN28 
#define REG_ADEIEH_AN29_ENABLED         0b0010000000000000      // Early Interrupt Enabled for AN29
#define REG_ADEIEH_AN29_DISABLED        0b0000000000000000      // Early Interrupt Disabled for AN29 
#define REG_ADEIEH_AN30_ENABLED         0b0100000000000000      // Early Interrupt Enabled for AN30
#define REG_ADEIEH_AN30_DISABLED        0b0000000000000000      // Early Interrupt Disabled for AN30 
#define REG_ADEIEH_AN31_ENABLED         0b1000000000000000      // Early Interrupt Enabled for AN31
#define REG_ADEIEH_AN31_DISABLED        0b0000000000000000      // Early Interrupt Disabled for AN31

