microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_adc.h
typedef enum {
    ADEIE_ANx_ENABLED = 0b1,      // Early Interrupt Enabled for ANx 
    ADEIE_ANx_DISABLED = 0b0      // Early Interrupt Disabled for ANx 
}ADEIE_EIEN_e; 

typedef union {
    struct {
        // ---HIGH WORD---
        volatile ADEIE_EIEN_e AN0EIE : 1; // Enable/Disable AN0 Early Interrupt
        volatile ADEIE_EIEN_e AN1EIE : 1; // Enable/Disable AN1 Early Interrupt
        volatile ADEIE_EIEN_e AN2EIE : 1; // Enable/Disable AN2 Early Interrupt
        volatile ADEIE_EIEN_e AN3EIE : 1; // Enable/Disable AN3 Early Interrupt
        volatile ADEIE_EIEN_e AN4EIE : 1; // Enable/Disable AN4 Early Interrupt
        volatile ADEIE_EIEN_e AN5EIE : 1; // Enable/Disable AN5 Early Interrupt
        volatile ADEIE_EIEN_e AN6EIE : 1; // Enable/Disable AN6 Early Interrupt
        volatile ADEIE_EIEN_e AN7EIE : 1; // Enable/Disable AN7 Early Interrupt
        #if (ADC_ANINPUT_COUNT > 7)
        volatile ADEIE_EIEN_e AN8EIE : 1; // Enable/Disable AN8 Early Interrupt
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 8)
        volatile ADEIE_EIEN_e AN9EIE : 1; // Enable/Disable AN9 Early Interrupt
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 9)
        volatile ADEIE_EIEN_e AN10EIE : 1; // Enable/Disable AN10 Early Interrupt
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 10)
        volatile ADEIE_EIEN_e AN11EIE : 1; // Enable/Disable AN11 Early Interrupt
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 11)
        volatile ADEIE_EIEN_e AN12EIE : 1; // Enable/Disable AN12 Early Interrupt
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 12)
        volatile ADEIE_EIEN_e AN13EIE : 1; // Enable/Disable AN13 Early Interrupt
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 13)
        volatile ADEIE_EIEN_e AN14EIE : 1; // Enable/Disable AN14 Early Interrupt
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 14)
        volatile ADEIE_EIEN_e AN15EIE : 1; // Enable/Disable AN15 Early Interrupt
        #else
        volatile unsigned : 1; // reserved
        #endif

        // ---HIGH WORD---
        #if (ADC_ANINPUT_COUNT > 15)
        volatile ADEIE_EIEN_e AN16EIE : 1; // Enable/Disable AN16 Early Interrupt
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 16)
        volatile ADEIE_EIEN_e AN17EIE : 1; // Enable/Disable AN17 Early Interrupt
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 17)
        volatile ADEIE_EIEN_e AN18EIE : 1; // Enable/Disable AN18 Early Interrupt
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 18)
        volatile ADEIE_EIEN_e AN19EIE : 1; // Enable/Disable AN19 Early Interrupt
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 19)
        volatile ADEIE_EIEN_e AN20EIE : 1; // Enable/Disable AN20 Early Interrupt
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 20)
        volatile ADEIE_EIEN_e AN21EIE : 1; // Enable/Disable AN21 Early Interrupt
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 21)
        volatile ADEIE_EIEN_e AN22EIE : 1; // Enable/Disable AN22 Early Interrupt
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 22)
        volatile ADEIE_EIEN_e AN23EIE : 1; // Enable/Disable AN23 Early Interrupt
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 23)
        volatile ADEIE_EIEN_e AN24EIE : 1; // Enable/Disable AN24 Early Interrupt
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 24)
        volatile ADEIE_EIEN_e AN25EIE : 1; // Enable/Disable AN25 Early Interrupt
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 25)
        volatile ADEIE_EIEN_e AN26EIE : 1; // Enable/Disable AN26 Early Interrupt
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 26)
        volatile ADEIE_EIEN_e AN27EIE : 1; // Enable/Disable AN27 Early Interrupt
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 27)
        volatile ADEIE_EIEN_e AN28EIE : 1; // Enable/Disable AN28 Early Interrupt
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 28)
        volatile ADEIE_EIEN_e AN29EIE : 1; // Enable/Disable AN29 Early Interrupt
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 29)
        volatile ADEIE_EIEN_e AN30EIE : 1; // Enable/Disable AN30 Early Interrupt
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 30)
        volatile ADEIE_EIEN_e AN31EIE : 1; // Enable/Disable AN31 Early Interrupt
        #else
        volatile unsigned : 1; // reserved
        #endif

    }__attribute__((packed)) bits; // ADC EARLY INTERRUPT ENABLE REGISTER HIGH/LOW BIT FIELD
    volatile uint32_t value; // ADC EARLY INTERRUPT ENABLE REGISTER HIGH/LOW REGISTER VALUE
} ADEIE_t; // ADC EARLY INTERRUPT ENABLE REGISTER HIGH/LOW BIT FIELD AND REGISTER VALUE


// REGISTER 19-17: ADEISTATL: ADC EARLY INTERRUPT STATUS REGISTER LOW

#define REG_ADEISTATL_RESET             0b0000000000000000      // Reset ADLVLTRGH High Register
#define REG_ADEISTATL_VALID_DATA_MSK	0b1111111111111111		// Bit mask used to set unimplemented bits to zero

#define REG_ADEISTATL_AN0_SET           0b0000000000000001      // Early Interrupt Status SET for AN0 
#define REG_ADEISTATL_AN0_CLR           0b0000000000000000      // Early Interrupt Status CLEARED for AN0 
#define REG_ADEISTATL_AN1_SET           0b0000000000000010      // Early Interrupt Status SET for AN1
#define REG_ADEISTATL_AN1_CLR           0b0000000000000000      // Early Interrupt Status CLEARED for AN1 
#define REG_ADEISTATL_AN2_SET           0b0000000000000100      // Early Interrupt Status SET for AN2
#define REG_ADEISTATL_AN2_CLR           0b0000000000000000      // Early Interrupt Status CLEARED for AN2 
#define REG_ADEISTATL_AN3_SET           0b0000000000001000      // Early Interrupt Status SET for AN3
#define REG_ADEISTATL_AN3_CLR           0b0000000000000000      // Early Interrupt Status CLEARED for AN3 
#define REG_ADEISTATL_AN4_SET           0b0000000000010000      // Early Interrupt Status SET for AN4
#define REG_ADEISTATL_AN4_CLR           0b0000000000000000      // Early Interrupt Status CLEARED for AN4 
#define REG_ADEISTATL_AN5_SET           0b0000000000100000      // Early Interrupt Status SET for AN5
#define REG_ADEISTATL_AN5_CLR           0b0000000000000000      // Early Interrupt Status CLEARED for AN5 
#define REG_ADEISTATL_AN6_SET           0b0000000001000000      // Early Interrupt Status SET for AN6
#define REG_ADEISTATL_AN6_CLR           0b0000000000000000      // Early Interrupt Status CLEARED for AN6 
#define REG_ADEISTATL_AN7_SET           0b0000000010000000      // Early Interrupt Status SET for AN7
#define REG_ADEISTATL_AN7_CLR           0b0000000000000000      // Early Interrupt Status CLEARED for AN7 
#define REG_ADEISTATL_AN8_SET           0b0000000100000000      // Early Interrupt Status SET for AN8
#define REG_ADEISTATL_AN8_CLR           0b0000000000000000      // Early Interrupt Status CLEARED for AN8 
#define REG_ADEISTATL_AN9_SET           0b0000001000000000      // Early Interrupt Status SET for AN9
#define REG_ADEISTATL_AN9_CLR           0b0000000000000000      // Early Interrupt Status CLEARED for AN9 
#define REG_ADEISTATL_AN10_SET          0b0000010000000000      // Early Interrupt Status SET for AN10 
#define REG_ADEISTATL_AN10_CLR          0b0000000000000000      // Early Interrupt Status CLEARED for AN10 
#define REG_ADEISTATL_AN11_SET          0b0000100000000000      // Early Interrupt Status SET for AN11
#define REG_ADEISTATL_AN11_CLR          0b0000000000000000      // Early Interrupt Status CLEARED for AN11 
#define REG_ADEISTATL_AN12_SET          0b0001000000000000      // Early Interrupt Status SET for AN12
#define REG_ADEISTATL_AN12_CLR          0b0000000000000000      // Early Interrupt Status CLEARED for AN12 
#define REG_ADEISTATL_AN13_SET          0b0010000000000000      // Early Interrupt Status SET for AN13
#define REG_ADEISTATL_AN13_CLR          0b0000000000000000      // Early Interrupt Status CLEARED for AN13 
#define REG_ADEISTATL_AN14_SET          0b0100000000000000      // Early Interrupt Status SET for AN14
#define REG_ADEISTATL_AN14_CLR          0b0000000000000000      // Early Interrupt Status CLEARED for AN14 
#define REG_ADEISTATL_AN15_SET          0b1000000000000000      // Early Interrupt Status SET for AN15
#define REG_ADEISTATL_AN15_CLR          0b0000000000000000      // Early Interrupt Status CLEARED for AN15


