microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_adc.h
// REGISTER 19-18: ADEISTATH: ADC EARLY INTERRUPT STATUS REGISTER HIGH

#define REG_ADEISTATH_RESET             0b0000000000000000      // Reset ADLVLTRGH High Register
#define REG_ADEISTATH_VALID_DATA_MSK	0b0000000000111111		// Bit mask used to set unimplemented bits to zero

#define REG_ADEISTATH_AN16_SET          0b0000000000000001      // Early Interrupt Status SET for AN16
#define REG_ADEISTATH_AN16_CLR          0b0000000000000000      // Early Interrupt Status CLEARED for AN16 
#define REG_ADEISTATH_AN17_SET          0b0000000000000010      // Early Interrupt Status SET for AN17
#define REG_ADEISTATH_AN17_CLR          0b0000000000000000      // Early Interrupt Status CLEARED for AN17 
#define REG_ADEISTATH_AN18_SET          0b0000000000000100      // Early Interrupt Status SET for AN18
#define REG_ADEISTATH_AN18_CLR          0b0000000000000000      // Early Interrupt Status CLEARED for AN18 
#define REG_ADEISTATH_AN19_SET          0b0000000000001000      // Early Interrupt Status SET for AN19
#define REG_ADEISTATH_AN19_CLR          0b0000000000000000      // Early Interrupt Status CLEARED for AN19 
#define REG_ADEISTATH_AN20_SET          0b0000000000010000      // Early Interrupt Status SET for AN20
#define REG_ADEISTATH_AN20_CLR          0b0000000000000000      // Early Interrupt Status CLEARED for AN20 
#define REG_ADEISTATH_AN21_SET          0b0000000000100000      // Early Interrupt Status SET for AN21
#define REG_ADEISTATH_AN21_CLR          0b0000000000000000      // Early Interrupt Status CLEARED for AN21 
#define REG_ADEISTATH_AN22_SET          0b0000000001000000      // Early Interrupt Status SET for AN22
#define REG_ADEISTATH_AN22_CLR          0b0000000000000000      // Early Interrupt Status CLEARED for AN22 
#define REG_ADEISTATH_AN23_SET          0b0000000010000000      // Early Interrupt Status SET for AN23
#define REG_ADEISTATH_AN23_CLR          0b0000000000000000      // Early Interrupt Status CLEARED for AN23 
#define REG_ADEISTATH_AN24_SET          0b0000000100000000      // Early Interrupt Status SET for AN24
#define REG_ADEISTATH_AN24_CLR          0b0000000000000000      // Early Interrupt Status CLEARED for AN24 
#define REG_ADEISTATH_AN25_SET          0b0000001000000000      // Early Interrupt Status SET for AN25
#define REG_ADEISTATH_AN25_CLR          0b0000000000000000      // Early Interrupt Status CLEARED for AN25 
#define REG_ADEISTATH_AN26_SET          0b0000010000000000      // Early Interrupt Status SET for AN26
#define REG_ADEISTATH_AN26_CLR          0b0000000000000000      // Early Interrupt Status CLEARED for AN26 
#define REG_ADEISTATH_AN27_SET          0b0000100000000000      // Early Interrupt Status SET for AN27
#define REG_ADEISTATH_AN27_CLR          0b0000000000000000      // Early Interrupt Status CLEARED for AN27 
#define REG_ADEISTATH_AN28_SET          0b0001000000000000      // Early Interrupt Status SET for AN28
#define REG_ADEISTATH_AN28_CLR          0b0000000000000000      // Early Interrupt Status CLEARED for AN28 
#define REG_ADEISTATH_AN29_SET          0b0010000000000000      // Early Interrupt Status SET for AN29
#define REG_ADEISTATH_AN29_CLR          0b0000000000000000      // Early Interrupt Status CLEARED for AN29 
#define REG_ADEISTATH_AN30_SET          0b0100000000000000      // Early Interrupt Status SET for AN30
#define REG_ADEISTATH_AN30_CLR          0b0000000000000000      // Early Interrupt Status CLEARED for AN30 
#define REG_ADEISTATH_AN31_SET          0b1000000000000000      // Early Interrupt Status SET for AN31
#define REG_ADEISTATH_AN31_CLR          0b0000000000000000      // Early Interrupt Status CLEARED for AN31


// REGISTER 19-19: ADMOD0L: ADC INPUT MODE CONTROL REGISTER 0 LOW

#define REG_ADMOD0L_RESET                0b0000000000000000      // Reset ADLVLTRGH High Register
#define REG_ADMOD0L_VALID_DATA_MSK		 0b1111111111111111		// Bit mask used to set unimplemented bits to zero

#define REG_ADMOD0L_AN0_DIFF             0b0000000000000010      // AN0 operates in Differential mode
#define REG_ADMOD0L_AN0_SNGE             0b0000000000000000      // AN0 operates in single ended mode
#define REG_ADMOD0L_AN1_DIFF             0b0000000000001000      // AN1 operates in Differential mode
#define REG_ADMOD0L_AN1_SNGE             0b0000000000000000      // AN1 operates in single ended mode
#define REG_ADMOD0L_AN2_DIFF             0b0000000000100000      // AN2 operates in Differential mode
#define REG_ADMOD0L_AN2_SNGE             0b0000000000000000      // AN2 operates in single ended mode
#define REG_ADMOD0L_AN3_DIFF             0b0000000010000000      // AN3 operates in Differential mode
#define REG_ADMOD0L_AN3_SNGE             0b0000000000000000      // AN3 operates in single ended mode
#define REG_ADMOD0L_AN4_DIFF             0b0000001000000000      // AN4 operates in Differential mode
#define REG_ADMOD0L_AN4_SNGE             0b0000000000000000      // AN4 operates in single ended mode
#define REG_ADMOD0L_AN5_DIFF             0b0000100000000000      // AN5 operates in Differential mode
#define REG_ADMOD0L_AN5_SNGE             0b0000000000000000      // AN5 operates in single ended mode
#define REG_ADMOD0L_AN6_DIFF             0b0010000000000000      // AN6 operates in Differential mode
#define REG_ADMOD0L_AN6_SNGE             0b0000000000000000      // AN6 operates in single ended mode
#define REG_ADMOD0L_AN7_DIFF             0b1000000000000000      // AN7 operates in Differential mode
#define REG_ADMOD0L_AN7_SNGE             0b0000000000000000      // AN7 operates in single ended mode

#define REG_ADMOD0L_AN0_SIGNED           0b0000000000000001      // In differential mode AN0 output will be signed
#define REG_ADMOD0L_AN0_UNSIGNED         0b0000000000000000      // In differential mode AN0 output will be unsigned
#define REG_ADMOD0L_AN1_SIGNED           0b0000000000000100      // In differential mode AN1 output will be signed
#define REG_ADMOD0L_AN1_UNSIGNED         0b0000000000000000      // In differential mode AN1 output will be unsigned
#define REG_ADMOD0L_AN2_SIGNED           0b0000000000010000      // In differential mode AN2 output will be signed
#define REG_ADMOD0L_AN2_UNSIGNED         0b0000000000000000      // In differential mode AN2 output will be unsigned
#define REG_ADMOD0L_AN3_SIGNED           0b0000000001000000      // In differential mode AN3 output will be signed
#define REG_ADMOD0L_AN3_UNSIGNED         0b0000000000000000      // In differential mode AN3 output will be unsigned
#define REG_ADMOD0L_AN4_SIGNED           0b0000000100000000      // In differential mode AN4 output will be signed
#define REG_ADMOD0L_AN4_UNSIGNED         0b0000000000000000      // In differential mode AN4 output will be unsigned
#define REG_ADMOD0L_AN5_SIGNED           0b0000010000000000      // In differential mode AN5 output will be signed
#define REG_ADMOD0L_AN5_UNSIGNED         0b0000000000000000      // In differential mode AN5 output will be unsigned
#define REG_ADMOD0L_AN6_SIGNED           0b0001000000000000      // In differential mode AN6 output will be signed
#define REG_ADMOD0L_AN6_UNSIGNED         0b0000000000000000      // In differential mode AN6 output will be unsigned
#define REG_ADMOD0L_AN7_SIGNED           0b0100000000000000      // In differential mode AN7 output will be signed
#define REG_ADMOD0L_AN7_UNSIGNED         0b0000000000000000      // In differential mode AN7 output will be unsigned


