microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_adc.h
// REGISTER 19-20: ADMOD0H: ADC INPUT MODE CONTROL REGISTER 0 HIGH

#define REG_ADMOD0H_RESET                0b0000000000000000      // Reset ADMOD0H High Register
#define REG_ADMOD0H_VALID_DATA_MSK		 0b1111111111111111		// Bit mask used to set unimplemented bits to zero

#define REG_ADMOD0H_AN8_DIFF             0b0000000000000010      // AN8 operates in Differential mode
#define REG_ADMOD0H_AN8_SNGE             0b0000000000000000      // AN8 operates in single ended mode
#define REG_ADMOD0H_AN9_DIFF             0b0000000000001000      // AN9 operates in Differential mode
#define REG_ADMOD0H_AN9_SNGE             0b0000000000000000      // AN9 operates in single ended mode
#define REG_ADMOD0H_AN10_DIFF            0b0000000000100000      // AN10 operates in Differential mode
#define REG_ADMOD0H_AN10_SNGE            0b0000000000000000      // AN10 operates in single ended mode
#define REG_ADMOD0H_AN11_DIFF            0b0000000010000000      // AN11 operates in Differential mode
#define REG_ADMOD0H_AN11_SNGE            0b0000000000000000      // AN11 operates in single ended mode
#define REG_ADMOD0H_AN12_DIFF            0b0000001000000000      // AN12 operates in Differential mode
#define REG_ADMOD0H_AN12_SNGE            0b0000000000000000      // AN12 operates in single ended mode
#define REG_ADMOD0H_AN13_DIFF            0b0000100000000000      // AN13 operates in Differential mode
#define REG_ADMOD0H_AN13_SNGE            0b0000000000000000      // AN13 operates in single ended mode
#define REG_ADMOD0H_AN14_DIFF            0b0010000000000000      // AN14 operates in Differential mode
#define REG_ADMOD0H_AN14_SNGE            0b0000000000000000      // AN14 operates in single ended mode
#define REG_ADMOD0H_AN15_DIFF            0b1000000000000000      // AN15 operates in Differential mode
#define REG_ADMOD0H_AN15_SNGE            0b0000000000000000      // AN15 operates in single ended mode

#define REG_ADMOD0H_AN8_SIGNED           0b0000000000000001      // In differential mode AN8 output will be signed
#define REG_ADMOD0H_AN8_UNSIGNED         0b0000000000000000      // In differential mode AN8 output will be unsigned
#define REG_ADMOD0H_AN9_SIGNED           0b0000000000000100      // In differential mode AN9 output will be signed
#define REG_ADMOD0H_AN9_UNSIGNED         0b0000000000000000      // In differential mode AN9 output will be unsigned
#define REG_ADMOD0H_AN10_SIGNED          0b0000000000010000      // In differential mode AN10 output will be signed
#define REG_ADMOD0H_AN10_UNSIGNED        0b0000000000000000      // In differential mode AN10 output will be unsigned
#define REG_ADMOD0H_AN11_SIGNED          0b0000000001000000      // In differential mode AN11 output will be signed
#define REG_ADMOD0H_AN11_UNSIGNED        0b0000000000000000      // In differential mode AN11 output will be unsigned
#define REG_ADMOD0H_AN12_SIGNED          0b0000000100000000      // In differential mode AN12 output will be signed
#define REG_ADMOD0H_AN12_UNSIGNED        0b0000000000000000      // In differential mode AN12 output will be unsigned
#define REG_ADMOD0H_AN13_SIGNED          0b0000010000000000      // In differential mode AN13 output will be signed
#define REG_ADMOD0H_AN13_UNSIGNED        0b0000000000000000      // In differential mode AN13 output will be unsigned
#define REG_ADMOD0H_AN14_SIGNED          0b0001000000000000      // In differential mode AN14 output will be signed
#define REG_ADMOD0H_AN14_UNSIGNED        0b0000000000000000      // In differential mode AN14 output will be unsigned
#define REG_ADMOD0H_AN15_SIGNED          0b0100000000000000      // In differential mode AN15 output will be signed
#define REG_ADMOD0H_AN15_UNSIGNED        0b0000000000000000      // In differential mode AN15 output will be unsigned


#define REG_ADMOD0_AN_SET(x)   ((uint32_t)(pow(2, x)))	// Macro to set register bit based on ANx input number

typedef enum {
	ADMOD0H_DIFF_DIFF = 0b1,	// ANx operates in Differential mode
	ADMOD0H_DIFF_SNGE = 0b0		// ANx operates in single ended mode
} ADMOD0_DIFF_e;	

typedef enum {
	ADMOD0_SIGN_SIGNED = 0b1,	// ANx AN8 output value will be signed
	ADMOD0_SIGN_UNSIGNED = 0b0	// ANx AN8 output value will be unsigned
} ADMOD0_SIGN_e;	

typedef union {
    
    struct {
        volatile ADMOD0_DIFF_e AN0DIFF : 1; // Differential/Single Ended mode selection bit
        volatile ADMOD0_SIGN_e AN0SIGN : 1; // signed/unsigned ANx result selection bit
        volatile ADMOD0_DIFF_e AN1DIFF : 1; // Differential/Single Ended mode selection bit
        volatile ADMOD0_SIGN_e AN1SIGN : 1; // signed/unsigned ANx result selection bit
        volatile ADMOD0_DIFF_e AN2DIFF : 1; // Differential/Single Ended mode selection bit
        volatile ADMOD0_SIGN_e AN2SIGN : 1; // signed/unsigned ANx result selection bit
        volatile ADMOD0_DIFF_e AN3DIFF : 1; // Differential/Single Ended mode selection bit
        volatile ADMOD0_SIGN_e AN3SIGN : 1; // signed/unsigned ANx result selection bit

        volatile ADMOD0_DIFF_e AN4DIFF : 1; // Differential/Single Ended mode selection bit
        volatile ADMOD0_SIGN_e AN4SIGN : 1; // signed/unsigned ANx result selection bit
        volatile ADMOD0_DIFF_e AN5DIFF : 1; // Differential/Single Ended mode selection bit
        volatile ADMOD0_SIGN_e AN5SIGN : 1; // signed/unsigned ANx result selection bit
        volatile ADMOD0_DIFF_e AN6DIFF : 1; // Differential/Single Ended mode selection bit
        volatile ADMOD0_SIGN_e AN6SIGN : 1; // signed/unsigned ANx result selection bit
        volatile ADMOD0_DIFF_e AN7DIFF : 1; // Differential/Single Ended mode selection bit
        volatile ADMOD0_SIGN_e AN7SIGN : 1; // signed/unsigned ANx result selection bit

        volatile ADMOD0_DIFF_e AN8DIFF : 1; // Differential/Single Ended mode selection bit
        volatile ADMOD0_SIGN_e AN8SIGN : 1; // signed/unsigned ANx result selection bit
        volatile ADMOD0_DIFF_e AN9DIFF : 1; // Differential/Single Ended mode selection bit
        volatile ADMOD0_SIGN_e AN9SIGN : 1; // signed/unsigned ANx result selection bit
        volatile ADMOD0_DIFF_e AN10DIFF : 1; // Differential/Single Ended mode selection bit
        volatile ADMOD0_SIGN_e AN10SIGN : 1; // signed/unsigned ANx result selection bit
        volatile ADMOD0_DIFF_e AN11DIFF : 1; // Differential/Single Ended mode selection bit
        volatile ADMOD0_SIGN_e AN11SIGN : 1; // signed/unsigned ANx result selection bit

        volatile ADMOD0_DIFF_e AN12DIFF : 1; // Differential/Single Ended mode selection bit
        volatile ADMOD0_SIGN_e AN12SIGN : 1; // signed/unsigned ANx result selection bit
        volatile ADMOD0_DIFF_e AN13DIFF : 1; // Differential/Single Ended mode selection bit
        volatile ADMOD0_SIGN_e AN13SIGN : 1; // signed/unsigned ANx result selection bit
        volatile ADMOD0_DIFF_e AN14DIFF : 1; // Differential/Single Ended mode selection bit
        volatile ADMOD0_SIGN_e AN14SIGN : 1; // signed/unsigned ANx result selection bit
        volatile ADMOD0_DIFF_e AN15DIFF : 1; // Differential/Single Ended mode selection bit
        volatile ADMOD0_SIGN_e AN15SIGN : 1; // signed/unsigned ANx result selection bit

