microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_adc.h
    }__attribute__((packed))bits;
    volatile uint32_t value;
} ADMOD0_t;


// REGISTER 19-21: ADMOD1L: ADC INPUT MODE CONTROL REGISTER 1 LOW

#define REG_ADMOD1L_RESET                0b0000000000000000      // Reset ADLVLTRGH High Register
#define REG_ADMOD1L_VALID_DATA_MSK		 0b0000111111111111		// Bit mask used to set unimplemented bits to zero

#define REG_ADMOD1L_AN16_DIFF            0b0000000000000010      // AN16 operates in Differential mode
#define REG_ADMOD1L_AN16_SNGE            0b0000000000000000      // AN16 operates in single ended mode
#define REG_ADMOD1L_AN17_DIFF            0b0000000000001000      // AN17 operates in Differential mode
#define REG_ADMOD1L_AN17_SNGE            0b0000000000000000      // AN17 operates in single ended mode
#define REG_ADMOD1L_AN18_DIFF            0b0000000000100000      // AN18 operates in Differential mode
#define REG_ADMOD1L_AN18_SNGE            0b0000000000000000      // AN18 operates in single ended mode
#define REG_ADMOD1L_AN19_DIFF            0b0000000010000000      // AN19 operates in Differential mode
#define REG_ADMOD1L_AN19_SNGE            0b0000000000000000      // AN19 operates in single ended mode
#define REG_ADMOD1L_AN20_DIFF            0b0000001000000000      // AN20 operates in Differential mode
#define REG_ADMOD1L_AN20_SNGE            0b0000000000000000      // AN20 operates in single ended mode
#define REG_ADMOD1L_AN21_DIFF            0b0000100000000000      // AN21 operates in Differential mode
#define REG_ADMOD1L_AN21_SNGE            0b0000000000000000      // AN21 operates in single ended mode
#define REG_ADMOD1L_AN22_DIFF            0b0010000000000000      // AN22 operates in Differential mode
#define REG_ADMOD1L_AN22_SNGE            0b0000000000000000      // AN22 operates in single ended mode
#define REG_ADMOD1L_AN23_DIFF            0b1000000000000000      // AN23 operates in Differential mode
#define REG_ADMOD1L_AN23_SNGE            0b0000000000000000      // AN23 operates in single ended mode

#define REG_ADMOD1L_AN16_SIGNED          0b0000000000000001      // In differential mode AN8 output will be signed
#define REG_ADMOD1L_AN16_UNSIGNED        0b0000000000000000      // In differential mode AN8 output will be unsigned
#define REG_ADMOD1L_AN17_SIGNED          0b0000000000000100      // In differential mode AN9 output will be signed
#define REG_ADMOD1L_AN17_UNSIGNED        0b0000000000000000      // In differential mode AN9 output will be unsigned
#define REG_ADMOD1L_AN18_SIGNED          0b0000000000010000      // In differential mode AN10 output will be signed
#define REG_ADMOD1L_AN18_UNSIGNED        0b0000000000000000      // In differential mode AN10 output will be unsigned
#define REG_ADMOD1L_AN19_SIGNED          0b0000000001000000      // In differential mode AN11 output will be signed
#define REG_ADMOD1L_AN19_UNSIGNED        0b0000000000000000      // In differential mode AN11 output will be unsigned
#define REG_ADMOD1L_AN20_SIGNED          0b0000000100000000      // In differential mode AN12 output will be signed
#define REG_ADMOD1L_AN20_UNSIGNED        0b0000000000000000      // In differential mode AN12 output will be unsigned
#define REG_ADMOD1L_AN21_SIGNED          0b0000010000000000      // In differential mode AN13 output will be signed
#define REG_ADMOD1L_AN21_UNSIGNED        0b0000000000000000      // In differential mode AN13 output will be unsigned
#define REG_ADMOD1L_AN22_SIGNED          0b0001000000000000      // In differential mode AN14 output will be signed
#define REG_ADMOD1L_AN22_UNSIGNED        0b0000000000000000      // In differential mode AN14 output will be unsigned
#define REG_ADMOD1L_AN23_SIGNED          0b0100000000000000      // In differential mode AN15 output will be signed
#define REG_ADMOD1L_AN23_UNSIGNED        0b0000000000000000      // In differential mode AN15 output will be unsigned


#ifdef ADMOD1H
// REGISTER 19-xx: ADMOD1H: ADC INPUT MODE CONTROL REGISTER 1 HIGH

#define REG_ADMOD1H_RESET                0b0000000000000000      // Reset ADMOD0H High Register
#define REG_ADMOD1H_VALID_DATA_MSK		 0b1111111111111111		// Bit mask used to set unimplemented bits to zero

#define REG_ADMOD1H_AN24_DIFF            0b0000000000000010      // AN24 operates in Differential mode
#define REG_ADMOD1H_AN24_SNGE            0b0000000000000000      // AN24 operates in single ended mode
#define REG_ADMOD1H_AN25_DIFF            0b0000000000001000      // AN25 operates in Differential mode
#define REG_ADMOD1H_AN25_SNGE            0b0000000000000000      // AN25 operates in single ended mode
#define REG_ADMOD1H_AN26_DIFF            0b0000000000100000      // AN26 operates in Differential mode
#define REG_ADMOD1H_AN26_SNGE            0b0000000000000000      // AN26 operates in single ended mode
#define REG_ADMOD1H_AN27_DIFF            0b0000000010000000      // AN27 operates in Differential mode
#define REG_ADMOD1H_AN27_SNGE            0b0000000000000000      // AN27 operates in single ended mode
#define REG_ADMOD1H_AN28_DIFF            0b0000001000000000      // AN28 operates in Differential mode
#define REG_ADMOD1H_AN28_SNGE            0b0000000000000000      // AN28 operates in single ended mode
#define REG_ADMOD1H_AN29_DIFF            0b0000100000000000      // AN29 operates in Differential mode
#define REG_ADMOD1H_AN29_SNGE            0b0000000000000000      // AN29 operates in single ended mode
#define REG_ADMOD1H_AN30_DIFF            0b0010000000000000      // AN30 operates in Differential mode
#define REG_ADMOD1H_AN30_SNGE            0b0000000000000000      // AN30 operates in single ended mode
#define REG_ADMOD1H_AN31_DIFF            0b1000000000000000      // AN31 operates in Differential mode
#define REG_ADMOD1H_AN31_SNGE            0b0000000000000000      // AN31 operates in single ended mode

#define REG_ADMOD1H_AN24_SIGNED          0b0000000000000001      // In differential mode AN24 output will be signed
#define REG_ADMOD1H_AN24_UNSIGNED        0b0000000000000000      // In differential mode AN24 output will be unsigned
#define REG_ADMOD1H_AN25_SIGNED          0b0000000000000100      // In differential mode AN25 output will be signed
#define REG_ADMOD1H_AN25_UNSIGNED        0b0000000000000000      // In differential mode AN25 output will be unsigned
#define REG_ADMOD1H_AN26_SIGNED          0b0000000000010000      // In differential mode AN26 output will be signed
#define REG_ADMOD1H_AN26_UNSIGNED        0b0000000000000000      // In differential mode AN26 output will be unsigned
#define REG_ADMOD1H_AN27_SIGNED          0b0000000001000000      // In differential mode AN27 output will be signed
#define REG_ADMOD1H_AN27_UNSIGNED        0b0000000000000000      // In differential mode AN27 output will be unsigned
#define REG_ADMOD1H_AN28_SIGNED          0b0000000100000000      // In differential mode AN28 output will be signed
#define REG_ADMOD1H_AN28_UNSIGNED        0b0000000000000000      // In differential mode AN28 output will be unsigned
#define REG_ADMOD1H_AN29_SIGNED          0b0000010000000000      // In differential mode AN29 output will be signed
#define REG_ADMOD1H_AN29_UNSIGNED        0b0000000000000000      // In differential mode AN29 output will be unsigned
#define REG_ADMOD1H_AN30_SIGNED          0b0001000000000000      // In differential mode AN30 output will be signed
#define REG_ADMOD1H_AN30_UNSIGNED        0b0000000000000000      // In differential mode AN30 output will be unsigned
#define REG_ADMOD1H_AN31_SIGNED          0b0100000000000000      // In differential mode AN31 output will be signed
#define REG_ADMOD1H_AN31_UNSIGNED        0b0000000000000000      // In differential mode AN31 output will be unsigned

#endif

// REGISTER 19-22: ADIEL: ADC INTERRUPT ENABLE REGISTER LOW

#define REG_ADIEL_RESET                 0b0000000000000000      // Reset ADIEL Low Register
#define REG_ADIEL_VALID_DATA_MSK		0b1111111111111111		// Bit mask used to set unimplemented bits to zero

#define REG_ADIEL_ALL_ENABLED           0b1111111111111111      // Interrupt enabled for all ANx inputs
#define REG_ADIEL_ALL_DISABLED          0b0000000000000000      // Interrupt disabled for all ANx inputs 

