microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_adc.h
#define REG_ADIEL_AN0_ENABLED           0b0000000000000001      // Interrupt enabled for AN0 
#define REG_ADIEL_AN0_DISABLED          0b0000000000000000      // Interrupt disabled for AN0 
#define REG_ADIEL_AN1_ENABLED           0b0000000000000010      // Interrupt enabled for AN1
#define REG_ADIEL_AN1_DISABLED          0b0000000000000000      // Interrupt disabled for AN1 
#define REG_ADIEL_AN2_ENABLED           0b0000000000000100      // Interrupt enabled for AN2
#define REG_ADIEL_AN2_DISABLED          0b0000000000000000      // Interrupt disabled for AN2 
#define REG_ADIEL_AN3_ENABLED           0b0000000000001000      // Interrupt enabled for AN3
#define REG_ADIEL_AN3_DISABLED          0b0000000000000000      // Interrupt disabled for AN3 
#define REG_ADIEL_AN4_ENABLED           0b0000000000010000      // Interrupt enabled for AN4
#define REG_ADIEL_AN4_DISABLED          0b0000000000000000      // Interrupt disabled for AN4 
#define REG_ADIEL_AN5_ENABLED           0b0000000000100000      // Interrupt enabled for AN5
#define REG_ADIEL_AN5_DISABLED          0b0000000000000000      // Interrupt disabled for AN5 
#define REG_ADIEL_AN6_ENABLED           0b0000000001000000      // Interrupt enabled for AN6
#define REG_ADIEL_AN6_DISABLED          0b0000000000000000      // Interrupt disabled for AN6 
#define REG_ADIEL_AN7_ENABLED           0b0000000010000000      // Interrupt enabled for AN7
#define REG_ADIEL_AN7_DISABLED          0b0000000000000000      // Interrupt disabled for AN7 
#define REG_ADIEL_AN8_ENABLED           0b0000000100000000      // Interrupt enabled for AN8
#define REG_ADIEL_AN8_DISABLED          0b0000000000000000      // Interrupt disabled for AN8 
#define REG_ADIEL_AN9_ENABLED           0b0000001000000000      // Interrupt enabled for AN9
#define REG_ADIEL_AN9_DISABLED          0b0000000000000000      // Interrupt disabled for AN9 
#define REG_ADIEL_AN10_ENABLED          0b0000010000000000      // Interrupt enabled for AN10 
#define REG_ADIEL_AN10_DISABLED         0b0000000000000000      // Interrupt disabled for AN10 
#define REG_ADIEL_AN11_ENABLED          0b0000100000000000      // Interrupt enabled for AN11
#define REG_ADIEL_AN11_DISABLED         0b0000000000000000      // Interrupt disabled for AN11 
#define REG_ADIEL_AN12_ENABLED          0b0001000000000000      // Interrupt enabled for AN12
#define REG_ADIEL_AN12_DISABLED         0b0000000000000000      // Interrupt disabled for AN12 
#define REG_ADIEL_AN13_ENABLED          0b0010000000000000      // Interrupt enabled for AN13
#define REG_ADIEL_AN13_DISABLED         0b0000000000000000      // Interrupt disabled for AN13 
#define REG_ADIEL_AN14_ENABLED          0b0100000000000000      // Interrupt enabled for AN14
#define REG_ADIEL_AN14_DISABLED         0b0000000000000000      // Interrupt disabled for AN14 
#define REG_ADIEL_AN15_ENABLED          0b1000000000000000      // Interrupt enabled for AN15
#define REG_ADIEL_AN15_DISABLED         0b0000000000000000      // Interrupt disabled for AN15


// REGISTER 19-23: ADIEH: ADC INTERRUPT ENABLE REGISTER HIGH

#define REG_ADIEH_RESET                 0b0000000000000000      // Reset ADIEH High Register
#define REG_ADIEH_VALID_DATA_MSK		0b0000000000111111		// Bit mask used to set unimplemented bits to zero

#define REG_ADIEH_ALL_DISABLED          0b0000000000000000      // Interrupt disabled for all ANx inputs
#define REG_ADIEH_ALL_ENABLED           0b1111111111111111      // Interrupt enabled for all ANx inputs

#define REG_ADIEH_AN16_ENABLED          0b0000000000000001      // Interrupt enabled for AN16
#define REG_ADIEH_AN16_DISABLED         0b0000000000000000      // Interrupt disabled for AN16 
#define REG_ADIEH_AN17_ENABLED          0b0000000000000010      // Interrupt enabled for AN17
#define REG_ADIEH_AN17_DISABLED         0b0000000000000000      // Interrupt disabled for AN17 
#define REG_ADIEH_AN18_ENABLED          0b0000000000000100      // Interrupt enabled for AN18
#define REG_ADIEH_AN18_DISABLED         0b0000000000000000      // Interrupt disabled for AN18 
#define REG_ADIEH_AN19_ENABLED          0b0000000000001000      // Interrupt enabled for AN19
#define REG_ADIEH_AN19_DISABLED         0b0000000000000000      // Interrupt disabled for AN19 
#define REG_ADIEH_AN20_ENABLED          0b0000000000010000      // Interrupt enabled for AN20
#define REG_ADIEH_AN20_DISABLED         0b0000000000000000      // Interrupt disabled for AN20 
#define REG_ADIEH_AN21_ENABLED          0b0000000000100000      // Interrupt enabled for AN21
#define REG_ADIEH_AN21_DISABLED         0b0000000000000000      // Interrupt disabled for AN21 
#define REG_ADIEH_AN22_ENABLED          0b0000000001000000      // Interrupt enabled for AN22
#define REG_ADIEH_AN22_DISABLED         0b0000000000000000      // Interrupt disabled for AN22 
#define REG_ADIEH_AN23_ENABLED          0b0000000010000000      // Interrupt enabled for AN23
#define REG_ADIEH_AN23_DISABLED         0b0000000000000000      // Interrupt disabled for AN23 
#define REG_ADIEH_AN24_ENABLED          0b0000000100000000      // Interrupt enabled for AN24
#define REG_ADIEH_AN24_DISABLED         0b0000000000000000      // Interrupt disabled for AN24 
#define REG_ADIEH_AN25_ENABLED          0b0000001000000000      // Interrupt enabled for AN25
#define REG_ADIEH_AN25_DISABLED         0b0000000000000000      // Interrupt disabled for AN25 
#define REG_ADIEH_AN26_ENABLED          0b0000010000000000      // Interrupt enabled for AN26
#define REG_ADIEH_AN26_DISABLED         0b0000000000000000      // Interrupt disabled for AN26 
#define REG_ADIEH_AN27_ENABLED          0b0000100000000000      // Interrupt enabled for AN27
#define REG_ADIEH_AN27_DISABLED         0b0000000000000000      // Interrupt disabled for AN27 
#define REG_ADIEH_AN28_ENABLED          0b0001000000000000      // Interrupt enabled for AN28
#define REG_ADIEH_AN28_DISABLED         0b0000000000000000      // Interrupt disabled for AN28 
#define REG_ADIEH_AN29_ENABLED          0b0010000000000000      // Interrupt enabled for AN29
#define REG_ADIEH_AN29_DISABLED         0b0000000000000000      // Interrupt disabled for AN29 
#define REG_ADIEH_AN30_ENABLED          0b0100000000000000      // Interrupt enabled for AN30
#define REG_ADIEH_AN30_DISABLED         0b0000000000000000      // Interrupt disabled for AN30 
#define REG_ADIEH_AN31_ENABLED          0b1000000000000000      // Interrupt enabled for AN31
#define REG_ADIEH_AN31_DISABLED         0b0000000000000000      // Interrupt disabled for AN31


