microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_adc.h
typedef enum {
    ADIE_ANx_ENABLED = 0b1,      // Interrupt Generation Enabled for ANx 
    ADIE_ANx_DISABLED = 0b0      // Interrupt Generation Disabled for ANx 
}ADIE_IE_e; 

typedef union {
    struct {
        volatile ADIE_IE_e an0ie : 1; // Enable/Disable AN0 Interrupt Generation
        volatile ADIE_IE_e an1ie : 1; // Enable/Disable AN1 Interrupt Generation
        volatile ADIE_IE_e an2ie : 1; // Enable/Disable AN2 Interrupt Generation
        volatile ADIE_IE_e an3ie : 1; // Enable/Disable AN3 Interrupt Generation
        volatile ADIE_IE_e an4ie : 1; // Enable/Disable AN4 Interrupt Generation
        volatile ADIE_IE_e an5ie : 1; // Enable/Disable AN5 Interrupt Generation
        volatile ADIE_IE_e an6ie : 1; // Enable/Disable AN6 Interrupt Generation
        volatile ADIE_IE_e an7ie : 1; // Enable/Disable AN7 Interrupt Generation
        #if (ADC_ANINPUT_COUNT > 7)
        volatile ADIE_IE_e an8ie : 1; // Enable/Disable AN8 Interrupt Generation
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 8)
        volatile ADIE_IE_e an9ie : 1; // Enable/Disable AN9 Interrupt Generation
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 9)
        volatile ADIE_IE_e an10ie : 1; // Enable/Disable AN10 Interrupt Generation
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 10)
        volatile ADIE_IE_e an11ie : 1; // Enable/Disable AN11 Interrupt Generation
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 11)
        volatile ADIE_IE_e an12ie : 1; // Enable/Disable AN12 Interrupt Generation
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 12)
        volatile ADIE_IE_e an13ie : 1; // Enable/Disable AN13 Interrupt Generation
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 13)
        volatile ADIE_IE_e an14ie : 1; // Enable/Disable AN14 Interrupt Generation
        #else
        volatile unsigned : 1; // reserved
        #endif

        #if (ADC_ANINPUT_COUNT > 14)
        volatile ADIE_IE_e an15ie : 1; // Enable/Disable AN15 Interrupt Generation
        #else
        volatile unsigned : 1; // reserved
        #endif
        // ---------------------------
        #if (ADC_ANINPUT_COUNT > 15)
        volatile ADIE_IE_e an16ie : 1; // Enable/Disable AN16 Interrupt Generation
        #else
        volatile unsigned : 1; // reserved
        #endif

        #if (ADC_ANINPUT_COUNT > 16)
        volatile ADIE_IE_e an17ie : 1; // Enable/Disable AN17 Interrupt Generation
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 17)
        volatile ADIE_IE_e an18ie : 1; // Enable/Disable AN18 Interrupt Generation
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 18)
        volatile ADIE_IE_e an19ie : 1; // Enable/Disable AN19 Interrupt Generation
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 19)
        volatile ADIE_IE_e an20ie : 1; // Enable/Disable AN20 Interrupt Generation
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 20)
        volatile ADIE_IE_e an21ie : 1; // Enable/Disable AN21 Interrupt Generation
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 21)
        volatile ADIE_IE_e an22ie : 1; // Enable/Disable AN22 Interrupt Generation
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 22)
        volatile ADIE_IE_e an23ie : 1; // Enable/Disable AN23 Interrupt Generation
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 23)
        volatile ADIE_IE_e an24ie : 1; // Enable/Disable AN24 Interrupt Generation
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 24)
        volatile ADIE_IE_e an25ie : 1; // Enable/Disable AN25 Interrupt Generation
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 25)
        volatile ADIE_IE_e an26ie : 1; // Enable/Disable AN26 Interrupt Generation
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 26)
        volatile ADIE_IE_e an27ie : 1; // Enable/Disable AN27 Interrupt Generation
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 27)
        volatile ADIE_IE_e an28ie : 1; // Enable/Disable AN28 Interrupt Generation
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 28)
        volatile ADIE_IE_e an29ie : 1; // Enable/Disable AN29 Interrupt Generation
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 29)
        volatile ADIE_IE_e an30ie : 1; // Enable/Disable AN30 Interrupt Generation
        #else
        volatile unsigned : 1; // reserved
        #endif
        #if (ADC_ANINPUT_COUNT > 30)
        volatile ADIE_IE_e an31ie : 1; // Enable/Disable AN31 Interrupt Generation
        #else
        volatile unsigned : 1; // reserved
        #endif

    }__attribute__((packed))bits;
    volatile uint32_t value;
} ADIE_t;


// REGISTER 19-24: ADSTATL: ADC DATA READY STATUS REGISTER LOW

#define REG_ADSTATL_RESET               0b0000000000000000      // Reset ADSTATL Low Register
#define REG_ADSTATL_VALID_DATA_MSK		0b1111111111111111		// Bit mask used to set unimplemented bits to zero

#define REG_ADSTATL_AN0_SET             0b0000000000000001      // DATA READY bit is set for AN0 
#define REG_ADSTATL_AN0_CLR             0b0000000000000000      // DATA READY bit is cleared for AN0 
#define REG_ADSTATL_AN1_SET             0b0000000000000010      // DATA READY bit is set AN1
#define REG_ADSTATL_AN1_CLR             0b0000000000000000      // DATA READY bit is cleared for AN1 
#define REG_ADSTATL_AN2_SET             0b0000000000000100      // DATA READY bit is set for AN2
#define REG_ADSTATL_AN2_CLR             0b0000000000000000      // DATA READY bit is cleared for AN2 
#define REG_ADSTATL_AN3_SET             0b0000000000001000      // DATA READY bit is set for AN3
#define REG_ADSTATL_AN3_CLR             0b0000000000000000      // DATA READY bit is cleared for AN3 
#define REG_ADSTATL_AN4_SET             0b0000000000010000      // DATA READY bit is set for AN4
#define REG_ADSTATL_AN4_CLR             0b0000000000000000      // DATA READY bit is cleared for AN4 
#define REG_ADSTATL_AN5_SET             0b0000000000100000      // DATA READY bit is set for AN5
#define REG_ADSTATL_AN5_CLR             0b0000000000000000      // DATA READY bit is cleared for AN5 
#define REG_ADSTATL_AN6_SET             0b0000000001000000      // DATA READY bit is set for AN6
#define REG_ADSTATL_AN6_CLR             0b0000000000000000      // DATA READY bit is cleared for AN6 
#define REG_ADSTATL_AN7_SET             0b0000000010000000      // DATA READY bit is set for AN7
#define REG_ADSTATL_AN7_CLR             0b0000000000000000      // DATA READY bit is cleared for AN7 
#define REG_ADSTATL_AN8_SET             0b0000000100000000      // DATA READY bit is set for AN8
#define REG_ADSTATL_AN8_CLR             0b0000000000000000      // DATA READY bit is cleared for AN8 
#define REG_ADSTATL_AN9_SET             0b0000001000000000      // DATA READY bit is set for AN9
#define REG_ADSTATL_AN9_CLR             0b0000000000000000      // DATA READY bit is cleared for AN9 
#define REG_ADSTATL_AN10_SET            0b0000010000000000      // DATA READY bit is set for AN10 
#define REG_ADSTATL_AN10_CLR            0b0000000000000000      // DATA READY bit is cleared for AN10 
#define REG_ADSTATL_AN11_SET            0b0000100000000000      // DATA READY bit is set for AN11
#define REG_ADSTATL_AN11_CLR            0b0000000000000000      // DATA READY bit is cleared for AN11 
#define REG_ADSTATL_AN12_SET            0b0001000000000000      // DATA READY bit is set for AN12
#define REG_ADSTATL_AN12_CLR            0b0000000000000000      // DATA READY bit is cleared for AN12 
#define REG_ADSTATL_AN13_SET            0b0010000000000000      // DATA READY bit is set for AN13
#define REG_ADSTATL_AN13_CLR            0b0000000000000000      // DATA READY bit is cleared for AN13 
#define REG_ADSTATL_AN14_SET            0b0100000000000000      // DATA READY bit is set for AN14
#define REG_ADSTATL_AN14_CLR            0b0000000000000000      // DATA READY bit is cleared for AN14 
#define REG_ADSTATL_AN15_SET            0b1000000000000000      // DATA READY bit is set for AN15
#define REG_ADSTATL_AN15_CLR            0b0000000000000000      // DATA READY bit is cleared for AN15


