microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_adc.h
// REGISTER 19-25: ADSTATH: ADC DATA READY STATUS REGISTER HIGH

#define REG_ADSTATH_RESET               0b0000000000000000      // Reset ADLVLTRGH High Register
#define REG_ADSTATH_VALID_DATA_MSK		0b0000000000111111		// Bit mask used to set unimplemented bits to zero

#define REG_ADSTATH_AN16_SET            0b0000000000000001      // DATA READY bit is set for AN16
#define REG_ADSTATH_AN16_CLR            0b0000000000000000      // DATA READY bit is cleared for AN16 
#define REG_ADSTATH_AN17_SET            0b0000000000000010      // DATA READY bit is set for AN17
#define REG_ADSTATH_AN17_CLR            0b0000000000000000      // DATA READY bit is cleared for AN17 
#define REG_ADSTATH_AN18_SET            0b0000000000000100      // DATA READY bit is set for AN18
#define REG_ADSTATH_AN18_CLR            0b0000000000000000      // DATA READY bit is cleared for AN18 
#define REG_ADSTATH_AN19_SET            0b0000000000001000      // DATA READY bit is set for AN19
#define REG_ADSTATH_AN19_CLR            0b0000000000000000      // DATA READY bit is cleared for AN19 
#define REG_ADSTATH_AN20_SET            0b0000000000010000      // DATA READY bit is set for AN20
#define REG_ADSTATH_AN20_CLR            0b0000000000000000      // DATA READY bit is cleared for AN20 
#define REG_ADSTATH_AN21_SET            0b0000000000100000      // DATA READY bit is set for AN21
#define REG_ADSTATH_AN21_CLR            0b0000000000000000      // DATA READY bit is cleared for AN21 
#define REG_ADSTATH_AN22_SET            0b0000000001000000      // DATA READY bit is set for AN22
#define REG_ADSTATH_AN22_CLR            0b0000000000000000      // DATA READY bit is cleared for AN22 
#define REG_ADSTATH_AN23_SET            0b0000000010000000      // DATA READY bit is set for AN23
#define REG_ADSTATH_AN23_CLR            0b0000000000000000      // DATA READY bit is cleared for AN23 
#define REG_ADSTATH_AN24_SET            0b0000000100000000      // DATA READY bit is set for AN24
#define REG_ADSTATH_AN24_CLR            0b0000000000000000      // DATA READY bit is cleared for AN24 
#define REG_ADSTATH_AN25_SET            0b0000001000000000      // DATA READY bit is set for AN25
#define REG_ADSTATH_AN25_CLR            0b0000000000000000      // DATA READY bit is cleared for AN25 
#define REG_ADSTATH_AN26_SET            0b0000010000000000      // DATA READY bit is set for AN26
#define REG_ADSTATH_AN26_CLR            0b0000000000000000      // DATA READY bit is cleared for AN26 
#define REG_ADSTATH_AN27_SET            0b0000100000000000      // DATA READY bit is set for AN27
#define REG_ADSTATH_AN27_CLR            0b0000000000000000      // DATA READY bit is cleared for AN27 
#define REG_ADSTATH_AN28_SET            0b0001000000000000      // DATA READY bit is set for AN28
#define REG_ADSTATH_AN28_CLR            0b0000000000000000      // DATA READY bit is cleared for AN28 
#define REG_ADSTATH_AN29_SET            0b0010000000000000      // DATA READY bit is set for AN29
#define REG_ADSTATH_AN29_CLR            0b0000000000000000      // DATA READY bit is cleared for AN29 
#define REG_ADSTATH_AN30_SET            0b0100000000000000      // DATA READY bit is set for AN30
#define REG_ADSTATH_AN30_CLR            0b0000000000000000      // DATA READY bit is cleared for AN30 
#define REG_ADSTATH_AN31_SET            0b1000000000000000      // DATA READY bit is set for AN31
#define REG_ADSTATH_AN31_CLR            0b0000000000000000      // DATA READY bit is cleared for AN31


#define REG_ADSTAT_AN_SET(x)   ((uint32_t)(pow(2, x)))	// Macro to set register bit based on ANx input number

typedef enum {
	ADSTAT_ANx_SET = 0b1,	// DATA READY bit is set for ANx
	ADSTAT_ANx_CLR = 0b0	// DATA READY bit is cleared for ANx
} ADSTAT_e;	

typedef union {
    struct {
        volatile ADSTAT_e an0rdy : 1; // DATA READY bit AN0
        volatile ADSTAT_e an1rdy : 1; // DATA READY bit AN1
        volatile ADSTAT_e an2rdy : 1; // DATA READY bit AN2
        volatile ADSTAT_e an3rdy : 1; // DATA READY bit AN3
        volatile ADSTAT_e an4rdy : 1; // DATA READY bit AN4
        volatile ADSTAT_e an5rdy : 1; // DATA READY bit AN5
        volatile ADSTAT_e an6rdy : 1; // DATA READY bit AN6
        volatile ADSTAT_e an7rdy : 1; // DATA READY bit AN7
        volatile ADSTAT_e an8rdy : 1; // DATA READY bit AN8
        volatile ADSTAT_e an9rdy : 1; // DATA READY bit AN9
        volatile ADSTAT_e an10rdy : 1; // DATA READY bit AN10
        volatile ADSTAT_e an11rdy : 1; // DATA READY bit AN11
        volatile ADSTAT_e an12rdy : 1; // DATA READY bit AN12
        volatile ADSTAT_e an13rdy : 1; // DATA READY bit AN13
        volatile ADSTAT_e an14rdy : 1; // DATA READY bit AN14
        volatile ADSTAT_e an15rdy : 1; // DATA READY bit AN15

        volatile ADSTAT_e an16rdy : 1; // DATA READY bit AN16
        volatile ADSTAT_e an17rdy : 1; // DATA READY bit AN17
        volatile ADSTAT_e an18rdy : 1; // DATA READY bit AN18
        volatile ADSTAT_e an19rdy : 1; // DATA READY bit AN19
        volatile ADSTAT_e an20rdy : 1; // DATA READY bit AN20
        volatile ADSTAT_e an21rdy : 1; // DATA READY bit AN21
        volatile ADSTAT_e an22rdy : 1; // DATA READY bit AN22
        volatile ADSTAT_e an23rdy : 1; // DATA READY bit AN23
        volatile ADSTAT_e an24rdy : 1; // DATA READY bit AN24
        volatile ADSTAT_e an25rdy : 1; // DATA READY bit AN25
        volatile ADSTAT_e an26rdy : 1; // DATA READY bit AN26
        volatile ADSTAT_e an27rdy : 1; // DATA READY bit AN27
        volatile ADSTAT_e an28rdy : 1; // DATA READY bit AN28
        volatile ADSTAT_e an29rdy : 1; // DATA READY bit AN29
        volatile ADSTAT_e an30rdy : 1; // DATA READY bit AN30
        volatile ADSTAT_e an31rdy : 1; // DATA READY bit AN31
    }__attribute__((packed)) bits;
    volatile uint32_t value;
} ADSTAT_t;


// REGISTER 19-26: ADTRGxH: ADC CHANNEL x TRIGGER SOURCE SELECTION REGISTER 

#define REG_ADTRIGx_VALID_DATA_MSK          0b0001111100011111 // =0x1F1F
#define REG_ADTRIGxH_VALID_DATA_MSK         0b0001111100000000 // =0x1F00

#define REG_ADTRIGx_VALID_DATA_LOW_MSK      0b0000000000011111 // =0x001F
#define REG_ADTRIGx_VALID_DATA_HIGH_MSK     0b0001111100000000 // =0x1F00


#if defined (__MA330049_dsPIC33CH_DPPIM__)

#define REG_ADTRIGxH_TRGSRC_MSTR_PTG        0b0001111000000000 // Master PTG
#define REG_ADTRIGxH_TRGSRC_SLV_CLC1        0b0001110100000000 // Slave CLC1
#define REG_ADTRIGxH_TRGSRC_MSTR_CLC1       0b0001110000000000 // Master CLC1
#define REG_ADTRIGxH_TRGSRC_SLV_PWM8_TRIG2  0b0001101100000000 // Slave PWM8 Trigger 2
#define REG_ADTRIGxH_TRGSRC_SLV_PWM5_TRIG2  0b0001101000000000 // Slave PWM5 Trigger 2
#define REG_ADTRIGxH_TRGSRC_SLV_PWM3_TRIG2  0b0001100100000000 // Slave PWM3 Trigger 2
#define REG_ADTRIGxH_TRGSRC_SLV_PWM1_TRIG2  0b0001100000000000 // Slave PWM1 Trigger 2
#define REG_ADTRIGxH_TRGSRC_SCCP4_PWM       0b0001011100000000 // Master SCCP4 PWM interrupt
#define REG_ADTRIGxH_TRGSRC_SCCP3_PWM       0b0001011000000000 // Master SCCP3 PWM interrupt
#define REG_ADTRIGxH_TRGSRC_SCCP2_PWM       0b0001010100000000 // Master SCCP2 PWM interrupt
#define REG_ADTRIGxH_TRGSRC_SCCP1_PWM       0b0001010000000000 // Master SCCP1 PWM interrupt

#define REG_ADTRIGxH_TRGSRC_MSTR_PWM4_TRIG2 0b0000101100000000 // Master PWM4 Trigger 2
#define REG_ADTRIGxH_TRGSRC_MSTR_PWM4_TRIG1 0b0000101000000000 // Master PWM4 Trigger 1
#define REG_ADTRIGxH_TRGSRC_MSTR_PWM3_TRIG2 0b0000100100000000 // Master PWM3 Trigger 2
#define REG_ADTRIGxH_TRGSRC_MSTR_PWM3_TRIG1 0b0000100000000000 // Master PWM3 Trigger 1
#define REG_ADTRIGxH_TRGSRC_MSTR_PWM2_TRIG2 0b0000011100000000 // Master PWM2 Trigger 2
#define REG_ADTRIGxH_TRGSRC_MSTR_PWM2_TRIG1 0b0000011000000000 // Master PWM2 Trigger 1
#define REG_ADTRIGxH_TRGSRC_MSTR_PWM1_TRIG2 0b0000010100000000 // Master PWM1 Trigger 2
#define REG_ADTRIGxH_TRGSRC_MSTR_PWM1_TRIG1 0b0000010000000000 // Master PWM1 Trigger 1

#elif defined (__MA330048_dsPIC33CK_DPPIM__)

#define REG_ADTRIGxH_TRGSRC_PTG             0b0001111000000000 // PTG
#define REG_ADTRIGxH_TRGSRC_CLC2            0b0001110100000000 // CLC2
#define REG_ADTRIGxH_TRGSRC_CLC1            0b0001110000000000 // CLC1
#define REG_ADTRIGxH_TRGSRC_MCCP9           0b0001101100000000 // MCCP9
#define REG_ADTRIGxH_TRGSRC_SCCP7           0b0001101000000000 // SCCP7
#define REG_ADTRIGxH_TRGSRC_SCCP6           0b0001100100000000 // SCCP6
#define REG_ADTRIGxH_TRGSRC_SCCP5           0b0001100000000000 // SCCP5
#define REG_ADTRIGxH_TRGSRC_SCCP4           0b0001011100000000 // SCCP4
#define REG_ADTRIGxH_TRGSRC_SCCP3           0b0001011000000000 // SCCP3
#define REG_ADTRIGxH_TRGSRC_SCCP2           0b0001010100000000 // SCCP2
#define REG_ADTRIGxH_TRGSRC_SCCP1           0b0001010000000000 // SCCP1
#define REG_ADTRIGxH_TRGSRC_PWM8_TRIG2      0b0001001100000000 // PWM8 Trigger 2
#define REG_ADTRIGxH_TRGSRC_PWM8_TRIG1      0b0001001000000000 // PWM8 Trigger 1
#define REG_ADTRIGxH_TRGSRC_PWM7_TRIG2      0b0001000100000000 // PWM7 Trigger 2
#define REG_ADTRIGxH_TRGSRC_PWM7_TRIG1      0b0001000000000000 // PWM7 Trigger 1
#define REG_ADTRIGxH_TRGSRC_PWM6_TRIG2      0b0000111100000000 // PWM6 Trigger 2
#define REG_ADTRIGxH_TRGSRC_PWM6_TRIG1      0b0000111000000000 // PWM6 Trigger 1
#define REG_ADTRIGxH_TRGSRC_PWM5_TRIG2      0b0000110100000000 // PWM5 Trigger 2
#define REG_ADTRIGxH_TRGSRC_PWM5_TRIG1      0b0000110000000000 // PWM5 Trigger 1
#define REG_ADTRIGxH_TRGSRC_PWM4_TRIG2      0b0000101100000000 // PWM4 Trigger 2
#define REG_ADTRIGxH_TRGSRC_PWM4_TRIG1      0b0000101000000000 // PWM4 Trigger 1
#define REG_ADTRIGxH_TRGSRC_PWM3_TRIG2      0b0000100100000000 // PWM3 Trigger 2
#define REG_ADTRIGxH_TRGSRC_PWM3_TRIG1      0b0000100000000000 // PWM3 Trigger 1
#define REG_ADTRIGxH_TRGSRC_PWM2_TRIG2      0b0000011100000000 // PWM2 Trigger 2
#define REG_ADTRIGxH_TRGSRC_PWM2_TRIG1      0b0000011000000000 // PWM2 Trigger 1
#define REG_ADTRIGxH_TRGSRC_PWM1_TRIG2      0b0000010100000000 // PWM1 Trigger 2
#define REG_ADTRIGxH_TRGSRC_PWM1_TRIG1      0b0000010000000000 // PWM1 Trigger 1

#endif

#define REG_ADTRIGxH_TRGSRC_LSWTRG          0b0000001000000000 // Level software trigger
#define REG_ADTRIGxH_TRGSRC_CSWTRG          0b0000000100000000 // Common Software Trigger
#define REG_ADTRIGxH_TRGSRC_NONE            0b0000000000000000 // No trigger is selected




