microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_adc.h
// REGISTER 19-26: ADTRGxL: ADC CHANNEL x TRIGGER SELECTION REGISTER LOW
#define REG_ADTRIGxL_RESET                  0b0000000000000000 // =0x0000
#define REG_ADTRIGxL_VALID_DATA_MSK         0b0000000000011111 // =0x001F


#define REG_ADTRIGxL_TRGSRC_ADTRG31         0b0000000000011111 // ADC Trigger #31 (PPS input))

#if defined (__MA330049_dsPIC33CH_DPPIM__)

#define REG_ADTRIGxL_TRGSRC_MSTR_PTG        0b0000000000011110 // Master PTG
#define REG_ADTRIGxL_TRGSRC_SLV_CLC1        0b0000000000011101 // Slave CLC1
#define REG_ADTRIGxL_TRGSRC_MSTR_CLC1       0b0000000000011100 // Master CLC1
#define REG_ADTRIGxL_TRGSRC_SLV_PWM8_TRIG2  0b0000000000011011 // Slave PWM8 Trigger 2
#define REG_ADTRIGxL_TRGSRC_SLV_PWM5_TRIG2  0b0000000000011010 // Slave PWM5 Trigger 2
#define REG_ADTRIGxL_TRGSRC_SLV_PWM3_TRIG2  0b0000000000011001 // Slave PWM3 Trigger 2
#define REG_ADTRIGxL_TRGSRC_SLV_PWM1_TRIG2  0b0000000000011000 // Slave PWM1 Trigger 2
#define REG_ADTRIGxL_TRGSRC_SCCP4_PWM       0b0000000000010111 // Master SCCP4 PWM interrupt
#define REG_ADTRIGxL_TRGSRC_SCCP3_PWM       0b0000000000010110 // Master SCCP3 PWM interrupt
#define REG_ADTRIGxL_TRGSRC_SCCP2_PWM       0b0000000000010101 // Master SCCP2 PWM interrupt
#define REG_ADTRIGxL_TRGSRC_SCCP1_PWM       0b0000000000010100 // Master SCCP1 PWM interrupt

#define REG_ADTRIGxL_TRGSRC_MSTR_PWM4_TRIG2 0b0000000000001011 // Master PWM4 Trigger 2
#define REG_ADTRIGxL_TRGSRC_MSTR_PWM4_TRIG1 0b0000000000001010 // Master PWM4 Trigger 1
#define REG_ADTRIGxL_TRGSRC_MSTR_PWM3_TRIG2 0b0000000000001001 // Master PWM3 Trigger 2
#define REG_ADTRIGxL_TRGSRC_MSTR_PWM3_TRIG1 0b0000000000001000 // Master PWM3 Trigger 1
#define REG_ADTRIGxL_TRGSRC_MSTR_PWM2_TRIG2 0b0000000000000111 // Master PWM2 Trigger 2
#define REG_ADTRIGxL_TRGSRC_MSTR_PWM2_TRIG1 0b0000000000000110 // Master PWM2 Trigger 1
#define REG_ADTRIGxL_TRGSRC_MSTR_PWM1_TRIG2 0b0000000000000101 // Master PWM1 Trigger 2
#define REG_ADTRIGxL_TRGSRC_MSTR_PWM1_TRIG1 0b0000000000000100 // Master PWM1 Trigger 1

#elif defined (__MA330048_dsPIC33CK_DPPIM__)

#define REG_ADTRIGxL_TRGSRC_PTG             0b0000000000011110 // PTG
#define REG_ADTRIGxL_TRGSRC_CLC2            0b0000000000011101 // CLC2
#define REG_ADTRIGxL_TRGSRC_CLC1            0b0000000000011100 // CLC1
#define REG_ADTRIGxL_TRGSRC_MCCP9           0b0000000000011011 // MCCP9
#define REG_ADTRIGxL_TRGSRC_SCCP7           0b0000000000011010 // SCCP7
#define REG_ADTRIGxL_TRGSRC_SCCP6           0b0000000000011001 // SCCP6
#define REG_ADTRIGxL_TRGSRC_SCCP5           0b0000000000011000 // SCCP5
#define REG_ADTRIGxL_TRGSRC_SCCP4           0b0000000000010111 // SCCP4
#define REG_ADTRIGxL_TRGSRC_SCCP3           0b0000000000010110 // SCCP3
#define REG_ADTRIGxL_TRGSRC_SCCP2           0b0000000000010101 // SCCP2
#define REG_ADTRIGxL_TRGSRC_SCCP1           0b0000000000010100 // SCCP1
#define REG_ADTRIGxL_TRGSRC_PWM8_TRIG2      0b0000000000010011 // PWM8 Trigger 2
#define REG_ADTRIGxL_TRGSRC_PWM8_TRIG1      0b0000000000010010 // PWM8 Trigger 1
#define REG_ADTRIGxL_TRGSRC_PWM7_TRIG2      0b0000000000010001 // PWM7 Trigger 2
#define REG_ADTRIGxL_TRGSRC_PWM7_TRIG1      0b0000000000010000 // PWM7 Trigger 1
#define REG_ADTRIGxL_TRGSRC_PWM6_TRIG2      0b0000000000001111 // PWM6 Trigger 2
#define REG_ADTRIGxL_TRGSRC_PWM6_TRIG1      0b0000000000001110 // PWM6 Trigger 1
#define REG_ADTRIGxL_TRGSRC_PWM5_TRIG2      0b0000000000001101 // PWM5 Trigger 2
#define REG_ADTRIGxL_TRGSRC_PWM5_TRIG1      0b0000000000001100 // PWM5 Trigger 1
#define REG_ADTRIGxL_TRGSRC_PWM4_TRIG2      0b0000000000001011 // PWM4 Trigger 2
#define REG_ADTRIGxL_TRGSRC_PWM4_TRIG1      0b0000000000001010 // PWM4 Trigger 1
#define REG_ADTRIGxL_TRGSRC_PWM3_TRIG2      0b0000000000001001 // PWM3 Trigger 2
#define REG_ADTRIGxL_TRGSRC_PWM3_TRIG1      0b0000000000001000 // PWM3 Trigger 1
#define REG_ADTRIGxL_TRGSRC_PWM2_TRIG2      0b0000000000000111 // PWM2 Trigger 2
#define REG_ADTRIGxL_TRGSRC_PWM2_TRIG1      0b0000000000000110 // PWM2 Trigger 1
#define REG_ADTRIGxL_TRGSRC_PWM1_TRIG2      0b0000000000000101 // PWM1 Trigger 2
#define REG_ADTRIGxL_TRGSRC_PWM1_TRIG1      0b0000000000000100 // PWM1 Trigger 1

#endif

#define REG_ADTRIGxL_TRGSRC_LSWTRG          0b0000000000000010 // Level software trigger
#define REG_ADTRIGxL_TRGSRC_CSWTRG          0b0000000000000001 // Common Software Trigger
#define REG_ADTRIGxL_TRGSRC_NONE            0b0000000000000000 // No trigger is selected

typedef enum {

    ADTRIGx_TRGSRC_ADTRG31    = 0b11111, // ADC Trigger #31 (PPS input)
    ADTRIGx_TRGSRC_LSWTRG     = 0b00010, // Level software trigger
    ADTRIGx_TRGSRC_CSWTRG     = 0b00001, // Common Software Trigger

#if defined (__MA330049_dsPIC33CH_DPPIM__)

    ADTRIGx_TRGSRC_MSTR_PTG = 0b11110, // Master PTG
    ADTRIGx_TRGSRC_SLV_CLC1 = 0b11101, // Slave CLC1
    ADTRIGx_TRGSRC_MSTR_CLC1 = 0b11100, // Master CLC1
    ADTRIGx_TRGSRC_SLV_PWM8_TRIG2 = 0b11011, // Slave PWM8 Trigger 2
    ADTRIGx_TRGSRC_SLV_PWM5_TRIG2 = 0b11010, // Slave PWM5 Trigger 2
    ADTRIGx_TRGSRC_SLV_PWM3_TRIG2 = 0b11001, // Slave PWM3 Trigger 2
    ADTRIGx_TRGSRC_SLV_PWM1_TRIG2 = 0b11000, // Slave PWM1 Trigger 2
    ADTRIGx_TRGSRC_SCCP4_PWM = 0b10111, // Master SCCP4 PWM interrupt
    ADTRIGx_TRGSRC_SCCP3_PWM = 0b10110, // Master SCCP3 PWM interrupt
    ADTRIGx_TRGSRC_SCCP2_PWM = 0b10101, // Master SCCP2 PWM interrupt
    ADTRIGx_TRGSRC_SCCP1_PWM = 0b10100, // Master SCCP1 PWM interrupt

    ADTRIGx_TRGSRC_MSTR_PWM4_TRIG2 = 0b01011, // Master PWM4 Trigger 2
    ADTRIGx_TRGSRC_MSTR_PWM4_TRIG1 = 0b01010, // Master PWM4 Trigger 1
    ADTRIGx_TRGSRC_MSTR_PWM3_TRIG2 = 0b01001, // Master PWM3 Trigger 2
    ADTRIGx_TRGSRC_MSTR_PWM3_TRIG1 = 0b01000, // Master PWM3 Trigger 1
    ADTRIGx_TRGSRC_MSTR_PWM2_TRIG2 = 0b00111, // Master PWM2 Trigger 2
    ADTRIGx_TRGSRC_MSTR_PWM2_TRIG1 = 0b00110, // Master PWM2 Trigger 1
    ADTRIGx_TRGSRC_MSTR_PWM1_TRIG2 = 0b00101, // Master PWM1 Trigger 2
    ADTRIGx_TRGSRC_MSTR_PWM1_TRIG1 = 0b00100, // Master PWM1 Trigger 1

#elif defined (__MA330048_dsPIC33CK_DPPIM__)

    ADTRIGx_TRGSRC_PTG        = 0b11110, // AD trigger source: PTG
    ADTRIGx_TRGSRC_CLC2       = 0b11101, // AD trigger source: CLC2
    ADTRIGx_TRGSRC_CLC1       = 0b11100, // AD trigger source: CLC1
    ADTRIGx_TRGSRC_MCCP9      = 0b11011, // AD trigger source: MCCP9
    ADTRIGx_TRGSRC_SCCP7      = 0b11010, // AD trigger source: SCCP7
    ADTRIGx_TRGSRC_SCCP6      = 0b11001, // AD trigger source: SCCP6
    ADTRIGx_TRGSRC_SCCP5      = 0b11000, // AD trigger source: SCCP5
    ADTRIGx_TRGSRC_SCCP4      = 0b10111, // AD trigger source: SCCP4
    ADTRIGx_TRGSRC_SCCP3      = 0b10110, // AD trigger source: SCCP3
    ADTRIGx_TRGSRC_SCCP2      = 0b10101, // AD trigger source: SCCP2
    ADTRIGx_TRGSRC_SCCP1      = 0b10100, // AD trigger source: SCCP1
    ADTRIGx_TRGSRC_PWM8_TRIG2 = 0b10011, // AD trigger source: PWM8 Trigger 2
    ADTRIGx_TRGSRC_PWM8_TRIG1 = 0b10010, // AD trigger source: PWM8 Trigger 1
    ADTRIGx_TRGSRC_PWM7_TRIG2 = 0b10001, // AD trigger source: PWM7 Trigger 2
    ADTRIGx_TRGSRC_PWM7_TRIG1 = 0b10000, // AD trigger source: PWM7 Trigger 1
    ADTRIGx_TRGSRC_PWM6_TRIG2 = 0b01111, // AD trigger source: PWM6 Trigger 2
    ADTRIGx_TRGSRC_PWM6_TRIG1 = 0b01110, // AD trigger source: PWM6 Trigger 1
    ADTRIGx_TRGSRC_PWM5_TRIG2 = 0b01101, // AD trigger source: PWM5 Trigger 2
    ADTRIGx_TRGSRC_PWM5_TRIG1 = 0b01100, // AD trigger source: PWM5 Trigger 1
    ADTRIGx_TRGSRC_PWM4_TRIG2 = 0b01011, // AD trigger source: PWM4 Trigger 2
    ADTRIGx_TRGSRC_PWM4_TRIG1 = 0b01010, // AD trigger source: PWM4 Trigger 1
    ADTRIGx_TRGSRC_PWM3_TRIG2 = 0b01001, // AD trigger source: PWM3 Trigger 2
    ADTRIGx_TRGSRC_PWM3_TRIG1 = 0b01000, // AD trigger source: PWM3 Trigger 1
    ADTRIGx_TRGSRC_PWM2_TRIG2 = 0b00111, // AD trigger source: PWM2 Trigger 2
    ADTRIGx_TRGSRC_PWM2_TRIG1 = 0b00110, // AD trigger source: PWM2 Trigger 1
    ADTRIGx_TRGSRC_PWM1_TRIG2 = 0b00101, // AD trigger source: PWM1 Trigger 2
    ADTRIGx_TRGSRC_PWM1_TRIG1 = 0b00100, // AD trigger source: PWM1 Trigger 1

#endif

    ADTRIGx_TRGSRC_NONE       = 0b00000 // No trigger is selected
        
} ADTRIG_TRGSRC_e;


