microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_adc.h
// REGISTER 19-27: ADCAL0L: ADC CALIBRATION REGISTER 0 LOW

#define REG_ADCAL0L_RESET               0b0000000000000000      // ADC core #0 & #1 calibration reset
#define REG_ADCAL0L_VALID_DATA_MSK		0b1000111110001111		// Bit mask used to set unimplemented bits to zero

#define REG_ADCAL0L_CAL1RDY_DONE        0b1000000000000000      // ADC core #1 calibration completed
#define REG_ADCAL0L_CAL1RDY_PEND        0b0000000000000000      // ADC core #1 calibration pending

#define REG_ADCAL0L_CAL1SKIP_BYPASS     0b0000100000000000      // ADC core #1 calibration will be skipped
#define REG_ADCAL0L_CAL1SKIP_CALIB      0b0000000000000000      // ADC core #1 calibration will be performed

#define REG_ADCAL0L_CAL1DIFF_DIFF       0b0000010000000000      // ADC core #1 differential input calibration 
#define REG_ADCAL0L_CAL1DIFF_SNGM       0b0000000000000000      // ADC core #1 single ended input calibration 

#define REG_ADCAL0L_CAL1EN_UNLOCKED     0b0000001000000000      // ADC core #1 calibration bits accessable
#define REG_ADCAL0L_CAL1EN_LOCKED       0b0000000000000000      // ADC core #1 calibration bits blocked 

#define REG_ADCAL0L_CAL1RUN_EXECUTE     0b0000000100000000      // ADC core #1 execute calibration 
#define REG_ADCAL0L_CAL1RUN_READY       0b0000000000000000      // ADC core #1 ready for calibration 

#define REG_ADCAL0L_CAL0RDY_DONE        0b0000000010000000      // ADC core #0 calibration completed
#define REG_ADCAL0L_CAL0RDY_PEND        0b0000000000000000      // ADC core #0 calibration pending

#define REG_ADCAL0L_CAL0SKIP_BYPASS     0b0000000000001000      // ADC core #0 calibration will be skipped
#define REG_ADCAL0L_CAL0SKIP_CALIB      0b0000000000000000      // ADC core #0 calibration will be performed

#define REG_ADCAL0L_CAL0DIFF_DIFF       0b0000000000000100      // ADC core #0 differential input calibration 
#define REG_ADCAL0L_CAL0DIFF_SNGM       0b0000000000000000      // ADC core #0 single ended input calibration 

#define REG_ADCAL0L_CAL0EN_UNLOCKED     0b0000000000000010      // ADC core #0 calibration bits accessable
#define REG_ADCAL0L_CAL0EN_LOCKED       0b0000000000000000      // ADC core #0 calibration bits blocked 

#define REG_ADCAL0L_CAL0RUN_EXECUTE     0b0000000000000001      // ADC core #0 execute calibration 
#define REG_ADCAL0L_CAL0RUN_READY       0b0000000000000000      // ADC core #0 ready for calibration 


// REGISTER 19-28: ADCAL0H: ADC CALIBRATION REGISTER 0 HIGH
#define REG_ADCAL0H_RESET               0b0000000000000000      // ADC core #2 & #3 calibration reset
#define REG_ADCAL0H_VALID_DATA_MSK		0b1000111110001111		// Bit mask used to set unimplemented bits to zero

#define REG_ADCAL0H_CAL3RDY_DONE        0b1000000000000000      // ADC core #3 calibration completed
#define REG_ADCAL0H_CAL3RDY_PEND        0b0000000000000000      // ADC core #3 calibration pending

#define REG_ADCAL0H_CAL3SKIP_BYPASS     0b0000100000000000      // ADC core #3 calibration will be skipped
#define REG_ADCAL0H_CAL3SKIP_CALIB      0b0000000000000000      // ADC core #3 calibration will be performed

#define REG_ADCAL0H_CAL3DIFF_DIFF       0b0000010000000000      // ADC core #3 differential input calibration 
#define REG_ADCAL0H_CAL3DIFF_SNGM       0b0000000000000000      // ADC core #3 single ended input calibration 

#define REG_ADCAL0H_CAL3EN_UNLOCKED     0b0000001000000000      // ADC core #3 calibration bits accessable
#define REG_ADCAL0H_CAL3EN_LOCKED       0b0000000000000000      // ADC core #3 calibration bits blocked 

#define REG_ADCAL0H_CAL3RUN_EXECUTE     0b0000000100000000      // ADC core #3 execute calibration 
#define REG_ADCAL0H_CAL3RUN_READY       0b0000000000000000      // ADC core #3 ready for calibration 

#define REG_ADCAL0H_CAL2RDY_DONE        0b0000000010000000      // ADC core #2 calibration completed
#define REG_ADCAL0H_CAL2RDY_PEND        0b0000000000000000      // ADC core #2 calibration pending

#define REG_ADCAL0H_CAL2SKIP_BYPASS     0b0000000000001000      // ADC core #2 calibration will be skipped
#define REG_ADCAL0H_CAL2SKIP_CALIB      0b0000000000000000      // ADC core #2 calibration will be performed

#define REG_ADCAL0H_CAL2DIFF_DIFF       0b0000000000000100      // ADC core #2 differential input calibration 
#define REG_ADCAL0H_CAL2DIFF_SNGM       0b0000000000000000      // ADC core #2 single ended input calibration 

#define REG_ADCAL0H_CAL2EN_UNLOCKED     0b0000000000000010      // ADC core #2 calibration bits accessable
#define REG_ADCAL0H_CAL2EN_LOCKED       0b0000000000000000      // ADC core #2 calibration bits blocked 

#define REG_ADCAL0H_CAL2RUN_EXECUTE     0b0000000000000001      // ADC core #2 execute calibration 
#define REG_ADCAL0H_CAL2RUN_READY       0b0000000000000000      // ADC core #2 ready for calibration 


// REGISTER 19-29: ADCAL1H: ADC CALIBRATION REGISTER 1 HIGH
#define REG_ADCAL1H_RESET               0b0000000000000000      // ADC shared core calibration reset
#define REG_ADCAL1H_VALID_DATA_MSK		0b1000111100000000		// Bit mask used to set unimplemented bits to zero

#define REG_ADCAL1H_CSHRRDY_DONE        0b1000000000000000      // ADC shared core calibration completed
#define REG_ADCAL1H_CSHRRDY_PEND        0b0000000000000000      // ADC shared core calibration pending

#define REG_ADCAL1H_CSHRSKIP_BYPASS     0b0000100000000000      // ADC shared core calibration will be skipped
#define REG_ADCAL1H_CSHRSKIP_CALIB      0b0000000000000000      // ADC shared core calibration will be performed

#define REG_ADCAL1H_CSHRDIFF_DIFF       0b0000010000000000      // ADC shared core differential input calibration 
#define REG_ADCAL1H_CSHRDIFF_SNGM       0b0000000000000000      // ADC shared core single ended input calibration 

#define REG_ADCAL1H_CSHREN_UNLOCKED     0b0000001000000000      // ADC shared core calibration bits accessable
#define REG_ADCAL1H_CSHREN_LOCKED       0b0000000000000000      // ADC shared core calibration bits blocked 

#define REG_ADCAL1H_CSHRRUN_EXECUTE     0b0000000100000000      // ADC shared core execute calibration 
#define REG_ADCAL1H_CSHRRUN_READY       0b0000000000000000      // ADC shared core ready for calibration 


