microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_adc.h
// EXTENSION TO REGISTERS 19-27/28/29: ADCAL0L/ADCAL0H/ADCAL1L: ADC CALIBRATION REGISTERS
#define REG_ADCALx_LB_VALID_DATA_MSK	 0b0000000010001111		// Low Byte Bit mask used to set unimplemented bits to zero
#define REG_ADCALx_VALID_DATA_MSK		 0b1000111110001111		// Word Bit mask used to set unimplemented bits to zero

#define REG_ADC_CALIB_MODE_SINGLE_ENDED  0b1000101110001011 // Single Ended Mode Calibration
#define REG_ADC_CALIB_MODE_DIFFERENTIAL  0b1000111110001111 // Differenial Mode Calibration

#define REG_ADCALx_LB_CALxRDY_SET_MSK    0b0000000010000000
#define REG_ADCALx_LB_CALxRDY_CLR_MSK   (0b1111111101111111  & REG_ADCALx_VALID_DATA_MSK)

#define REG_ADCALx_LB_CALxSKIP_SET_MSK   0b0000000000001000
#define REG_ADCALx_LB_CALxSKIP_CLR_MSK  (0b1111111111110111  & REG_ADCALx_VALID_DATA_MSK)

#define REG_ADCALx_LB_CALxDIFF_SET_MSK   0b0000000000000100
#define REG_ADCALx_LB_CALxDIFF_CLR_MSK  (0b1111111111111011 & REG_ADCALx_VALID_DATA_MSK)

#define REG_ADCALx_LB_CALxEN_SET_MSK     0b0000000000000010
#define REG_ADCALx_LB_CALxEN_CLR_MSK    (0b1111111111111101 & REG_ADCALx_VALID_DATA_MSK)

#define REG_ADCALx_LB_CALxRUN_SET_MSK    0b0000000000000001
#define REG_ADCALx_LB_CALxRUN_CLR_MSK   (0b1111111111111110 & REG_ADCALx_VALID_DATA_MSK)

#define REG_ADCALx_HB_VALID_DATA_MSK	 0b1000111100000000		// High Byte Bit mask used to set unimplemented bits to zero

#define REG_ADCALx_HB_CALxRDY_SET_MSK    0b1000000000000000
#define REG_ADCALx_HB_CALxRDY_CLR_MSK   (0b0111111111111111  & REG_ADCALx_VALID_DATA_MSK)

#define REG_ADCALx_HB_CALxSKIP_SET_MSK   0b0000100000000000
#define REG_ADCALx_HB_CALxSKIP_CLR_MSK  (0b1111011111111111  & REG_ADCALx_VALID_DATA_MSK)

#define REG_ADCALx_HB_CALxDIFF_SET_MSK   0b0000010000000000
#define REG_ADCALx_HB_CALxDIFF_CLR_MSK  (0b1111101111111111 & REG_ADCALx_VALID_DATA_MSK)

#define REG_ADCALx_HB_CALxEN_SET_MSK     0b0000001000000000
#define REG_ADCALx_HB_CALxEN_CLR_MSK    (0b1111110111111111 & REG_ADCALx_VALID_DATA_MSK)

#define REG_ADCALx_HB_CALxRUN_SET_MSK    0b0000000100000000
#define REG_ADCALx_HB_CALxRUN_CLR_MSK   (0b1111111011111111 & REG_ADCALx_VALID_DATA_MSK)


// REGISTER 19-30: ADCMPxCON: ADC DIGITAL COMPARATOR x CONTROL REGISTER

#define REG_ADCMPxCON_RESET             0b0000000000000000      // ADC Digital Comparator Configuration Reset
#define REG_ADCMPxCON_VALID_DATA_RD_MSK	0b0001111111111111		// Bit mask used to set unimplemented bits to zero
#define REG_ADCMPxCON_VALID_DATA_WR_MSK	0b0000000011011111		// Bit mask used to set unimplemented bits to zero

#define REG_ADCMPxLO_RESET              0b0000000000000000      // ADC Digital Comparator Lower Compare Value Reset
#define REG_ADCMPxLO_VALID_DATA_MSK     0b1111111111111111      // Bit mask used to set unimplemented bits to zero

#define REG_ADCMPxHI_RESET              0b0000000000000000      // ADC Digital Comparator Upper Compare Value Reset
#define REG_ADCMPxHI_VALID_DATA_MSK     0b1111111111111111      // Bit mask used to set unimplemented bits to zero

#define REG_ADCMPxCON_CHNL_MSK			0b0001111100000000		// ADC Input Number used for comparison
#define REG_ADCMPxCON_CHNL(x)        ((x << 8) & REG_ADCMPxCON_CHNL_MSK)    // ADC Input Number used for comparison
#define REG_ADCMPxCON_CHNL_NO(x)     ((x & REG_ADCMPxCON_CHNL_MSK) >> 8)    // Macro to extract the active ANx input channel no

#define REG_ADCMPxCON_CHNL_AN31         0b0001111100000000      // ADC Input Number used for comparison
#define REG_ADCMPxCON_CHNL_AN30         0b0001111000000000      // ADC Input Number used for comparison
#define REG_ADCMPxCON_CHNL_AN29         0b0001110100000000      // ADC Input Number used for comparison
#define REG_ADCMPxCON_CHNL_AN28         0b0001110000000000      // ADC Input Number used for comparison
#define REG_ADCMPxCON_CHNL_AN27         0b0001101100000000      // ADC Input Number used for comparison
#define REG_ADCMPxCON_CHNL_AN26         0b0001101000000000      // ADC Input Number used for comparison
#define REG_ADCMPxCON_CHNL_AN25         0b0001100100000000      // ADC Input Number used for comparison
#define REG_ADCMPxCON_CHNL_AN24         0b0001100000000000      // ADC Input Number used for comparison
#define REG_ADCMPxCON_CHNL_AN23         0b0001011100000000      // ADC Input Number used for comparison
#define REG_ADCMPxCON_CHNL_AN22         0b0001011000000000      // ADC Input Number used for comparison
#define REG_ADCMPxCON_CHNL_AN21         0b0001010100000000      // ADC Input Number used for comparison
#define REG_ADCMPxCON_CHNL_AN20         0b0001010000000000      // ADC Input Number used for comparison
#define REG_ADCMPxCON_CHNL_AN19         0b0001001100000000      // ADC Input Number used for comparison
#define REG_ADCMPxCON_CHNL_AN18         0b0001001000000000      // ADC Input Number used for comparison
#define REG_ADCMPxCON_CHNL_AN17         0b0001000100000000      // ADC Input Number used for comparison
#define REG_ADCMPxCON_CHNL_AN16         0b0001000000000000      // ADC Input Number used for comparison
#define REG_ADCMPxCON_CHNL_AN15         0b0000111100000000      // ADC Input Number used for comparison
#define REG_ADCMPxCON_CHNL_AN14         0b0000111000000000      // ADC Input Number used for comparison
#define REG_ADCMPxCON_CHNL_AN13         0b0000110100000000      // ADC Input Number used for comparison
#define REG_ADCMPxCON_CHNL_AN12         0b0000110000000000      // ADC Input Number used for comparison
#define REG_ADCMPxCON_CHNL_AN11         0b0000101100000000      // ADC Input Number used for comparison
#define REG_ADCMPxCON_CHNL_AN10         0b0000101000000000      // ADC Input Number used for comparison
#define REG_ADCMPxCON_CHNL_AN9          0b0000100100000000      // ADC Input Number used for comparison
#define REG_ADCMPxCON_CHNL_AN8          0b0000100000000000      // ADC Input Number used for comparison
#define REG_ADCMPxCON_CHNL_AN7          0b0000011100000000      // ADC Input Number used for comparison
#define REG_ADCMPxCON_CHNL_AN6          0b0000011000000000      // ADC Input Number used for comparison
#define REG_ADCMPxCON_CHNL_AN5          0b0000010100000000      // ADC Input Number used for comparison
#define REG_ADCMPxCON_CHNL_AN4          0b0000010000000000      // ADC Input Number used for comparison
#define REG_ADCMPxCON_CHNL_AN3          0b0000001100000000      // ADC Input Number used for comparison
#define REG_ADCMPxCON_CHNL_AN2          0b0000001000000000      // ADC Input Number used for comparison
#define REG_ADCMPxCON_CHNL_AN1          0b0000000100000000      // ADC Input Number used for comparison
#define REG_ADCMPxCON_CHNL_AN0          0b0000000000000000      // ADC Input Number used for comparison

