microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_adc.h
typedef enum {
    ADCMPxCON_CHNL_AN31 = 0b11111,      // ADC Input Number used for comparison
    ADCMPxCON_CHNL_AN30 = 0b11110,      // ADC Input Number used for comparison
    ADCMPxCON_CHNL_AN29 = 0b11101,      // ADC Input Number used for comparison
    ADCMPxCON_CHNL_AN28 = 0b11100,      // ADC Input Number used for comparison
    ADCMPxCON_CHNL_AN27 = 0b11011,      // ADC Input Number used for comparison
    ADCMPxCON_CHNL_AN26 = 0b11010,      // ADC Input Number used for comparison
    ADCMPxCON_CHNL_AN25 = 0b11001,      // ADC Input Number used for comparison
    ADCMPxCON_CHNL_AN24 = 0b11000,      // ADC Input Number used for comparison
    ADCMPxCON_CHNL_AN23 = 0b10111,      // ADC Input Number used for comparison
    ADCMPxCON_CHNL_AN22 = 0b10110,      // ADC Input Number used for comparison
    ADCMPxCON_CHNL_AN21 = 0b10101,      // ADC Input Number used for comparison
    ADCMPxCON_CHNL_AN20 = 0b10100,      // ADC Input Number used for comparison
    ADCMPxCON_CHNL_AN19 = 0b10011,      // ADC Input Number used for comparison
    ADCMPxCON_CHNL_AN18 = 0b10010,      // ADC Input Number used for comparison
    ADCMPxCON_CHNL_AN17 = 0b10001,      // ADC Input Number used for comparison
    ADCMPxCON_CHNL_AN16 = 0b10000,      // ADC Input Number used for comparison
    ADCMPxCON_CHNL_AN15 = 0b01111,      // ADC Input Number used for comparison
    ADCMPxCON_CHNL_AN14 = 0b01110,      // ADC Input Number used for comparison
    ADCMPxCON_CHNL_AN13 = 0b01101,      // ADC Input Number used for comparison
    ADCMPxCON_CHNL_AN12 = 0b01100,      // ADC Input Number used for comparison
    ADCMPxCON_CHNL_AN11 = 0b01011,      // ADC Input Number used for comparison
    ADCMPxCON_CHNL_AN10 = 0b01010,      // ADC Input Number used for comparison
    ADCMPxCON_CHNL_AN9  = 0b01001,      // ADC Input Number used for comparison
    ADCMPxCON_CHNL_AN8  = 0b01000,      // ADC Input Number used for comparison
    ADCMPxCON_CHNL_AN7  = 0b00111,      // ADC Input Number used for comparison
    ADCMPxCON_CHNL_AN6  = 0b00110,      // ADC Input Number used for comparison
    ADCMPxCON_CHNL_AN5  = 0b00101,      // ADC Input Number used for comparison
    ADCMPxCON_CHNL_AN4  = 0b00100,      // ADC Input Number used for comparison
    ADCMPxCON_CHNL_AN3  = 0b00011,      // ADC Input Number used for comparison
    ADCMPxCON_CHNL_AN2  = 0b00010,      // ADC Input Number used for comparison
    ADCMPxCON_CHNL_AN1  = 0b00001,      // ADC Input Number used for comparison
    ADCMPxCON_CHNL_AN0  = 0b00000       // ADC Input Number used for comparison
}ADCMPxCON_CHNL_e; // Input Channel Number bits

#define REG_ADCMPxCON_CMPEN_ENABLED     0b0000000010000000      // ADC Digital Comparator Enabled
#define REG_ADCMPxCON_CMPEN_DISABLED    0b0000000000000000      // ADC Digital Comparator Disabled

typedef enum {
    ADCMPxCON_CMPEN_ENABLED  = 0b1, // ADC Digital Comparator Enabled
    ADCMPxCON_CMPEN_DISABLED = 0b0  // ADC Digital Comparator Disabled
}ADCMPxCON_CMPEN_e; // Digital Comparator Enable bit

#define REG_ADCMPxCON_IE_ENABLED        0b0000000001000000      // ADC Digital Comparator Common Interrupt Enabled
#define REG_ADCMPxCON_IE_DISABLED       0b0000000000000000      // ADC Digital Comparator Common Interrupt Disabled

typedef enum {
    ADCMPxCON_IE_ENABLED  = 0b1, // ADC Digital Comparator Common Interrupt Enabled
    ADCMPxCON_IE_DISABLED = 0b0  // ADC Digital Comparator Common Interrupt Disabled
}ADCMPxCON_IE_e; // Digital Comparator Common ADC Interrupt Enable bit

#define REG_ADCMPxCON_STAT_ACTIVE       0b0000000000100000      // ADC Digital Comparator Common Interrupt Active
#define REG_ADCMPxCON_STAT_READY        0b0000000000000000      // ADC Digital Comparator Common Interrupt Pending

typedef enum {
    ADCMPxCON_STAT_ACTIVE = 0b1, // ADC Digital Comparator event active
    ADCMPxCON_STAT_READY  = 0b0  // ADC Digital Comparator event not active
}ADCMPxCON_STAT_e; // Digital Comparator Event Status bit

#define REG_ADCMPxCON_BTWN_ENABLED      0b0000000000010000      // Generate Interrupt when ADC buffer between min & max
#define REG_ADCMPxCON_BTWN_DISABLED     0b0000000000000000      // No Interrupt when ADC buffer between min & max

typedef enum {
    ADCMPxCON_BTWN_ACTIVE = 0b1, // Generate Interrupt when ADC buffer between min & max
    ADCMPxCON_BTWN_READY  = 0b0  // No Interrupt when ADC buffer between min & max
}ADCMPxCON_BTWN_e; // Digital Comparator Between Low/High Comparator Event bit

#define REG_ADCMPxCON_HIHI_ENABLED      0b0000000000001000      // Generate Interrupt when ADC buffer >= max
#define REG_ADCMPxCON_HIHI_DISABLED     0b0000000000000000      // No Interrupt when ADC buffer >= max

typedef enum {
    ADCMPxCON_HIHI_ACTIVE = 0b1, // Generate Interrupt when ADC buffer >= max
    ADCMPxCON_HIHI_READY  = 0b0  // No Interrupt when ADC buffer >= max
}ADCMPxCON_HIHI_e; // Digital Comparator Above High Comparator Event bit

#define REG_ADCMPxCON_HILO_ENABLED      0b0000000000000100      // Generate Interrupt when ADC buffer < max
#define REG_ADCMPxCON_HILO_DISABLED     0b0000000000000000      // No Interrupt when ADC buffer < max

typedef enum {
    ADCMPxCON_HILO_ACTIVE = 0b1, // Generate Interrupt when ADC buffer ? max
    ADCMPxCON_HILO_READY  = 0b0  // No Interrupt when ADC buffer ? max
}ADCMPxCON_HILO_e; // Digital Comparator Below High Comparator Event bit

#define REG_ADCMPxCON_LOHI_ENABLED      0b0000000000000010      // Generate Interrupt when ADC buffer ? min
#define REG_ADCMPxCON_LOHI_DISABLED     0b0000000000000000      // No Interrupt when ADC buffer ? min

typedef enum {
    ADCMPxCON_LOHI_ACTIVE = 0b1, // Generate Interrupt when ADC buffer ? min
    ADCMPxCON_LOHI_READY  = 0b0  // No Interrupt when ADC buffer ? min
}ADCMPxCON_LOHI_e; // Digital Comparator Above Low Comparator Event bit

#define REG_ADCMPxCON_LOLO_ENABLED      0b0000000000000001      // Generate Interrupt when ADC buffer < min
#define REG_ADCMPxCON_LOLO_DISABLED     0b0000000000000000      // No Interrupt when ADC buffer < min

