microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_adc.h
typedef enum {
    ADCMPxCON_LOLO_ACTIVE = 0b1, // Generate Interrupt when ADC buffer ? min
    ADCMPxCON_LOLO_READY  = 0b0  // No Interrupt when ADC buffer ? min
}ADCMPxCON_LOLO_e; // Digital Comparator Below Low Comparator Event bit

typedef union {
    struct {
        volatile ADCMPxCON_LOLO_e lolo   : 1; // Bit 0: Low/Low Comparator Event bit
        volatile ADCMPxCON_LOHI_e lohi   : 1; // Bit 1: Low/High Comparator Event bit
        volatile ADCMPxCON_HILO_e hilo   : 1; // Bit 2: High/Low Comparator Event bit
        volatile ADCMPxCON_HIHI_e hihi   : 1; // Bit 3: High/High Comparator Event bit
        volatile ADCMPxCON_BTWN_e btwn   : 1; // Bit 4: Between Low/High Comparator Event bit
        volatile ADCMPxCON_STAT_e stat   : 1; // Bit 5: Comparator Event Status bit
        volatile ADCMPxCON_IE_e   ie     : 1; // Bit 6: Comparator Common ADC Interrupt Enable bit
        volatile ADCMPxCON_CMPEN_e cmpen : 1; // Bit 7: Comparator Enable bit
        volatile ADCMPxCON_CHNL_e chnl   : 5; // Bit 12-8: Input Channel Number bits
        volatile unsigned                : 3; // Bit 15-13: (reserved)
    }__attribute__((packed)) bits; // ADC DIGITAL COMPARATOR x CONTROL REGISTER
    volatile uint16_t value; // Analog-To-Digital input index (e.g. 3 for AN3)
} ADCMPxCON_t; // ADC DIGITAL COMPARATOR Settings 


// REGISTER 19-31: ADCMPxENL: ADC DIGITAL COMPARATOR x CHANNEL ENABLE REGISTER LOW

#define REG_ADCMPxENL_RESET             0b0000000000000000      // Reset ADCMPxENL Register
#define REG_ADCMPxENL_VALID_DATA_MSK	0b1111111111111111		// Bit mask used to set unimplemented bits to zero

#define REG_ADCMPxENL_ALL_ENABLED       0b1111111111111111      // Interrupt enabled for AN0 
#define REG_ADCMPxENL_ALL_DISABLED      0b0000000000000000      // Interrupt disabled for AN0 

#define REG_ADCMPxENL_AN0_ENABLED       0b0000000000000001      // Interrupt enabled for AN0 
#define REG_ADCMPxENL_AN0_DISABLED      0b0000000000000000      // Interrupt disabled for AN0 
#define REG_ADCMPxENL_AN1_ENABLED       0b0000000000000010      // Interrupt enabled for AN1
#define REG_ADCMPxENL_AN1_DISABLED      0b0000000000000000      // Interrupt disabled for AN1 
#define REG_ADCMPxENL_AN2_ENABLED       0b0000000000000100      // Interrupt enabled for AN2
#define REG_ADCMPxENL_AN2_DISABLED      0b0000000000000000      // Interrupt disabled for AN2 
#define REG_ADCMPxENL_AN3_ENABLED       0b0000000000001000      // Interrupt enabled for AN3
#define REG_ADCMPxENL_AN3_DISABLED      0b0000000000000000      // Interrupt disabled for AN3 
#define REG_ADCMPxENL_AN4_ENABLED       0b0000000000010000      // Interrupt enabled for AN4
#define REG_ADCMPxENL_AN4_DISABLED      0b0000000000000000      // Interrupt disabled for AN4 
#define REG_ADCMPxENL_AN5_ENABLED       0b0000000000100000      // Interrupt enabled for AN5
#define REG_ADCMPxENL_AN5_DISABLED      0b0000000000000000      // Interrupt disabled for AN5 
#define REG_ADCMPxENL_AN6_ENABLED       0b0000000001000000      // Interrupt enabled for AN6
#define REG_ADCMPxENL_AN6_DISABLED      0b0000000000000000      // Interrupt disabled for AN6 
#define REG_ADCMPxENL_AN7_ENABLED       0b0000000010000000      // Interrupt enabled for AN7
#define REG_ADCMPxENL_AN7_DISABLED      0b0000000000000000      // Interrupt disabled for AN7 
#define REG_ADCMPxENL_AN8_ENABLED       0b0000000100000000      // Interrupt enabled for AN8
#define REG_ADCMPxENL_AN8_DISABLED      0b0000000000000000      // Interrupt disabled for AN8 
#define REG_ADCMPxENL_AN9_ENABLED       0b0000001000000000      // Interrupt enabled for AN9
#define REG_ADCMPxENL_AN9_DISABLED      0b0000000000000000      // Interrupt disabled for AN9 
#define REG_ADCMPxENL_AN10_ENABLED      0b0000010000000000      // Interrupt enabled for AN10 
#define REG_ADCMPxENL_AN10_DISABLED     0b0000000000000000      // Interrupt disabled for AN10 
#define REG_ADCMPxENL_AN11_ENABLED      0b0000100000000000      // Interrupt enabled for AN11
#define REG_ADCMPxENL_AN11_DISABLED     0b0000000000000000      // Interrupt disabled for AN11 
#define REG_ADCMPxENL_AN12_ENABLED      0b0001000000000000      // Interrupt enabled for AN12
#define REG_ADCMPxENL_AN12_DISABLED     0b0000000000000000      // Interrupt disabled for AN12 
#define REG_ADCMPxENL_AN13_ENABLED      0b0010000000000000      // Interrupt enabled for AN13
#define REG_ADCMPxENL_AN13_DISABLED     0b0000000000000000      // Interrupt disabled for AN13 
#define REG_ADCMPxENL_AN14_ENABLED      0b0100000000000000      // Interrupt enabled for AN14
#define REG_ADCMPxENL_AN14_DISABLED     0b0000000000000000      // Interrupt disabled for AN14 
#define REG_ADCMPxENL_AN15_ENABLED      0b1000000000000000      // Interrupt enabled for AN15
#define REG_ADCMPxENL_AN15_DISABLED     0b0000000000000000      // Interrupt disabled for AN15

typedef enum {
    ADCMPxENL_ANx_ENABLED  = 0b1,     // Interrupt enabled for ANx 
    ADCMPxENL_ANx_DISABLED = 0b0      // Interrupt disabled for ANx 
}ADCMPxENL_e;

// REGISTER 19-32: ADCMPxENH: ADC DIGITAL COMPARATOR x CHANNEL ENABLE REGISTER HIGH

#define REG_ADCMPxENH_RESET             0b0000000000000000      // Reset ADCMPxENH High Register
#define REG_ADCMPxENH_VALID_DATA_MSK	0b0000000000111111		// Bit mask used to set unimplemented bits to zero

#define REG_ADCMPxENH_ALL_ENABLED       0b1111111111111111      // Interrupt enabled for all ANx inputs
#define REG_ADCMPxENH_ALL_DISABLED      0b0000000000000000      // Interrupt disabled for all ANx inputs

#define REG_ADCMPxENH_AN16_ENABLED      0b0000000000000001      // Interrupt enabled for AN16
#define REG_ADCMPxENH_AN16_DISABLED     0b0000000000000000      // Interrupt disabled for AN16 
#define REG_ADCMPxENH_AN17_ENABLED      0b0000000000000010      // Interrupt enabled for AN17
#define REG_ADCMPxENH_AN17_DISABLED     0b0000000000000000      // Interrupt disabled for AN17 
#define REG_ADCMPxENH_AN18_ENABLED      0b0000000000000100      // Interrupt enabled for AN18
#define REG_ADCMPxENH_AN18_DISABLED     0b0000000000000000      // Interrupt disabled for AN18 
#define REG_ADCMPxENH_AN19_ENABLED      0b0000000000001000      // Interrupt enabled for AN19
#define REG_ADCMPxENH_AN19_DISABLED     0b0000000000000000      // Interrupt disabled for AN19 
#define REG_ADCMPxENH_AN20_ENABLED      0b0000000000010000      // Interrupt enabled for AN20
#define REG_ADCMPxENH_AN20_DISABLED     0b0000000000000000      // Interrupt disabled for AN20 
#define REG_ADCMPxENH_AN21_ENABLED      0b0000000000100000      // Interrupt enabled for AN21
#define REG_ADCMPxENH_AN21_DISABLED     0b0000000000000000      // Interrupt disabled for AN21 
#define REG_ADCMPxENH_AN22_ENABLED      0b0000000001000000      // Interrupt enabled for AN22
#define REG_ADCMPxENH_AN22_DISABLED     0b0000000000000000      // Interrupt disabled for AN22 
#define REG_ADCMPxENH_AN23_ENABLED      0b0000000010000000      // Interrupt enabled for AN23
#define REG_ADCMPxENH_AN23_DISABLED     0b0000000000000000      // Interrupt disabled for AN23 
#define REG_ADCMPxENH_AN24_ENABLED      0b0000000100000000      // Interrupt enabled for AN24
#define REG_ADCMPxENH_AN24_DISABLED     0b0000000000000000      // Interrupt disabled for AN24 
#define REG_ADCMPxENH_AN25_ENABLED      0b0000001000000000      // Interrupt enabled for AN25
#define REG_ADCMPxENH_AN25_DISABLED     0b0000000000000000      // Interrupt disabled for AN25 
#define REG_ADCMPxENH_AN26_ENABLED      0b0000010000000000      // Interrupt enabled for AN26
#define REG_ADCMPxENH_AN26_DISABLED     0b0000000000000000      // Interrupt disabled for AN26 
#define REG_ADCMPxENH_AN27_ENABLED      0b0000100000000000      // Interrupt enabled for AN27
#define REG_ADCMPxENH_AN27_DISABLED     0b0000000000000000      // Interrupt disabled for AN27 
#define REG_ADCMPxENH_AN28_ENABLED      0b0001000000000000      // Interrupt enabled for AN28
#define REG_ADCMPxENH_AN28_DISABLED     0b0000000000000000      // Interrupt disabled for AN28 
#define REG_ADCMPxENH_AN29_ENABLED      0b0010000000000000      // Interrupt enabled for AN29
#define REG_ADCMPxENH_AN29_DISABLED     0b0000000000000000      // Interrupt disabled for AN29 
#define REG_ADCMPxENH_AN30_ENABLED      0b0100000000000000      // Interrupt enabled for AN30
#define REG_ADCMPxENH_AN30_DISABLED     0b0000000000000000      // Interrupt disabled for AN30 
#define REG_ADCMPxENH_AN31_ENABLED      0b1000000000000000      // Interrupt enabled for AN31
#define REG_ADCMPxENH_AN31_DISABLED     0b0000000000000000      // Interrupt disabled for AN31

