microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_adc.h
typedef enum {
	ADCMPxEN_ANx_ENABLED = 0b1,      // Conversion result for corresponding channel is used by the comparator
	ADCMPxEN_ANx_DISABLED = 0b0      // Conversion result for corresponding channel is not used by the comparator
} ADCMPxEN_e;   // Comparator Enable for Corresponding Input Channels bits

typedef union {
    
    struct {
        volatile ADCMPxEN_e an0cmpen : 1;    // Bit 0: Enable ANx as digital comparator input source
        volatile ADCMPxEN_e an1cmpen : 1;    // Bit 1: Enable ANx as digital comparator input source
        volatile ADCMPxEN_e an2cmpen : 1;    // Bit 2: Enable ANx as digital comparator input source
        volatile ADCMPxEN_e an3cmpen : 1;    // Bit 3: Enable ANx as digital comparator input source
        volatile ADCMPxEN_e an4cmpen : 1;    // Bit 4: Enable ANx as digital comparator input source
        volatile ADCMPxEN_e an5cmpen : 1;    // Bit 5: Enable ANx as digital comparator input source
        volatile ADCMPxEN_e an6cmpen : 1;    // Bit 6: Enable ANx as digital comparator input source
        volatile ADCMPxEN_e an7cmpen : 1;    // Bit 7: Enable ANx as digital comparator input source
        volatile ADCMPxEN_e an8cmpen : 1;    // Bit 8: Enable ANx as digital comparator input source
        volatile ADCMPxEN_e an9cmpen : 1;    // Bit 9: Enable ANx as digital comparator input source
        volatile ADCMPxEN_e an10cmpen : 1;    // Bit 10: Enable ANx as digital comparator input source
        volatile ADCMPxEN_e an11cmpen : 1;    // Bit 11: Enable ANx as digital comparator input source
        volatile ADCMPxEN_e an12cmpen : 1;    // Bit 12: Enable ANx as digital comparator input source
        volatile ADCMPxEN_e an13cmpen : 1;    // Bit 13: Enable ANx as digital comparator input source
        volatile ADCMPxEN_e an14cmpen : 1;    // Bit 14: Enable ANx as digital comparator input source
        volatile ADCMPxEN_e an15cmpen : 1;    // Bit 15: Enable ANx as digital comparator input source

        volatile ADCMPxEN_e an16cmpen : 1;    // Bit 0: Enable ANx as digital comparator input source
        volatile ADCMPxEN_e an17cmpen : 1;    // Bit 1: Enable ANx as digital comparator input source
        volatile ADCMPxEN_e an18cmpen : 1;    // Bit 2: Enable ANx as digital comparator input source
        volatile ADCMPxEN_e an19cmpen : 1;    // Bit 3: Enable ANx as digital comparator input source
        volatile ADCMPxEN_e an20cmpen : 1;    // Bit 4: Enable ANx as digital comparator input source
        volatile ADCMPxEN_e an21cmpen : 1;    // Bit 5: Enable ANx as digital comparator input source
        volatile ADCMPxEN_e an22cmpen : 1;    // Bit 6: Enable ANx as digital comparator input source
        volatile ADCMPxEN_e an23cmpen : 1;    // Bit 7: Enable ANx as digital comparator input source
        volatile ADCMPxEN_e an24cmpen : 1;    // Bit 8: Enable ANx as digital comparator input source
        volatile ADCMPxEN_e an25cmpen : 1;    // Bit 9: Enable ANx as digital comparator input source
        volatile ADCMPxEN_e an26cmpen : 1;    // Bit 10: Enable ANx as digital comparator input source
        volatile ADCMPxEN_e an27cmpen : 1;    // Bit 11: Enable ANx as digital comparator input source
        volatile ADCMPxEN_e an28cmpen : 1;    // Bit 12: Enable ANx as digital comparator input source
        volatile ADCMPxEN_e an29cmpen : 1;    // Bit 13: Enable ANx as digital comparator input source
        volatile ADCMPxEN_e an30cmpen : 1;    // Bit 14: Enable ANx as digital comparator input source
        volatile ADCMPxEN_e an31cmpen : 1;    // Bit 15: Enable ANx as digital comparator input source

    }__attribute__((packed)) bits;  // Digital Comparator Input Source Selection
    volatile uint32_t value;
}ADCMPxEN_t; // Comparator Enable for Corresponding Input Channels bits

// REGISTER 19-33: ADFLxCON: ADC DIGITAL FILTER x CONTROL REGISTER

#define REG_ADFLxDAT_RESET                  0b0000000000000000      // Reset ADFLxDAT Register
#define REG_ADFLxCON_RESET                  0b0000000000000000      // Reset ADFLxCON Register
#define REG_ADFLxCON_VALID_DATA_WR_MSK		0b1111111100011111		// Bit mask used to set unimplemented bits to zero
#define REG_ADFLxCON_VALID_DATA_RD_MSK		0b1111111100011111		// Bit mask used to set unimplemented bits to zero
#define REG_ADFLxDAT_VALID_DATA_MSK			0b1111111111111111		// Bit mask used to set unimplemented bits to zero


#define REG_ADFLxCON_FLEN_ENABLED           0b1000000000000000      // Digital filter enabled
#define REG_ADFLxCON_FLEN_DISABLED          0b0000000000000000      // Digital filter disabled

typedef enum {
    ADFLxCON_FLEN_ENABLED  = 0b1, // Analog filter x is enabled
    ADFLxCON_FLEN_DISABLED = 0b0  // Analog filter x is disabled
}ADFLxCON_FLEN_e; // Filter Enable bit

#define REG_ADFLxCON_MODE_AVERAGE           0b0110000000000000      // Digital filter operates in Averaging mode
#define REG_ADFLxCON_MODE_OVERSAMPLE        0b0000000000000000      // Digital filter operates in Oversampling mode

typedef enum {
    ADFLxCON_MODE_AVERAGE    = 0b11, // Analog filter x is enabled
    ADFLxCON_MODE_OVERSAMPLE = 0b00  // Analog filter x is disabled
}ADFLxCON_MODE_e; // Filter Enable bit


#define REG_ADFLxCON_OVRSAM_LEFT_ALIGN_256X    0b0000110000000000      // Digital filter result alignment left
#define REG_ADFLxCON_OVRSAM_LEFT_ALIGN_128X    0b0001110000000000      // Digital filter result alignment left
#define REG_ADFLxCON_OVRSAM_LEFT_ALIGN_64X     0b0000100000000000      // Digital filter result alignment left
#define REG_ADFLxCON_OVRSAM_LEFT_ALIGN_32X     0b0001100000000000      // Digital filter result alignment left
#define REG_ADFLxCON_OVRSAM_LEFT_ALIGN_16      0b0000010000000000      // Digital filter result alignment left
#define REG_ADFLxCON_OVRSAM_LEFT_ALIGN_8X      0b0001010000000000      // Digital filter result alignment left
#define REG_ADFLxCON_OVRSAM_LEFT_ALIGN_4X      0b0000000000000000      // Digital filter result alignment left
#define REG_ADFLxCON_OVRSAM_LEFT_ALIGN_2X      0b0001000000000000      // Digital filter result alignment left

