microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_adc.h
#define REG_ADFLxCON_AVERAGE_RIGHT_ALIGN_256X  0b0111110000000000      // Digital filter result alignment right
#define REG_ADFLxCON_AVERAGE_RIGHT_ALIGN_128X  0b0111100000000000      // Digital filter result alignment right
#define REG_ADFLxCON_AVERAGE_RIGHT_ALIGN_64X   0b0111010000000000      // Digital filter result alignment right
#define REG_ADFLxCON_AVERAGE_RIGHT_ALIGN_32X   0b0111000000000000      // Digital filter result alignment right
#define REG_ADFLxCON_AVERAGE_RIGHT_ALIGN_16X   0b0110110000000000      // Digital filter result alignment right
#define REG_ADFLxCON_AVERAGE_RIGHT_ALIGN_8X    0b0111100000000000      // Digital filter result alignment right
#define REG_ADFLxCON_AVERAGE_RIGHT_ALIGN_4X    0b0110010000000000      // Digital filter result alignment right
#define REG_ADFLxCON_AVERAGE_RIGHT_ALIGN_2X    0b0110000000000000      // Digital filter result alignment right

typedef enum {
    ADFLxCON_AVERAGE_RIGHT_ALIGN_256X = 0b11111,      // Digital filter result alignment right
    ADFLxCON_AVERAGE_RIGHT_ALIGN_128X = 0b11110,      // Digital filter result alignment right
    ADFLxCON_AVERAGE_RIGHT_ALIGN_64X  = 0b11101,      // Digital filter result alignment right
    ADFLxCON_AVERAGE_RIGHT_ALIGN_32X  = 0b11100,      // Digital filter result alignment right
    ADFLxCON_AVERAGE_RIGHT_ALIGN_16X  = 0b11011,      // Digital filter result alignment right
    ADFLxCON_AVERAGE_RIGHT_ALIGN_8X   = 0b11110,      // Digital filter result alignment right
    ADFLxCON_AVERAGE_RIGHT_ALIGN_4X   = 0b11001,      // Digital filter result alignment right
    ADFLxCON_AVERAGE_RIGHT_ALIGN_2X   = 0b11000,       // Digital filter result alignment right

    ADFLxCON_OVRSAM_LEFT_ALIGN_256X   = 0b00011,      // Digital filter result alignment left
    ADFLxCON_OVRSAM_LEFT_ALIGN_128X   = 0b00111,      // Digital filter result alignment left
    ADFLxCON_OVRSAM_LEFT_ALIGN_64X    = 0b00010,      // Digital filter result alignment left
    ADFLxCON_OVRSAM_LEFT_ALIGN_32X    = 0b00110,      // Digital filter result alignment left
    ADFLxCON_OVRSAM_LEFT_ALIGN_16     = 0b00001,      // Digital filter result alignment left
    ADFLxCON_OVRSAM_LEFT_ALIGN_8X     = 0b00101,      // Digital filter result alignment left
    ADFLxCON_OVRSAM_LEFT_ALIGN_4X     = 0b00000,      // Digital filter result alignment left
    ADFLxCON_OVRSAM_LEFT_ALIGN_2X     = 0b00100       // Digital filter result alignment left
}ADFLxCON_OVRSAM_e;

#define REG_ADFLxCON_IE_ENABLED             0b0000001000000000      // Digital filter result ready interrupt enabled
#define REG_ADFLxCON_IE_DISABLED            0b0000000000000000      // Digital filter result ready interrupt disabled

typedef enum {
    ADFLxCON_IE_ENABLED  = 0b1, // Digital filter result ready interrupt enabled
    ADFLxCON_IE_DISABLED = 0b0  // Digital filter result ready interrupt disabled
}ADFLxCON_IE_e; // Filter Common ADC Interrupt Enable bit

#define REG_ADFLxCON_RDY_READY              0b0000000100000000      // Digital filter result ready 
#define REG_ADFLxCON_RDY_PEND               0b0000000000000000      // Digital filter result pending

typedef enum {
    ADFLxCON_RDY_READY  = 0b1, // Digital filter result ready 
    ADFLxCON_RDY_PEND   = 0b0  // Digital filter result pending
}ADFLxCON_RDY_e; // Oversampling Filter Data Ready Flag bit

#define REG_ADFLxCON_INPUT_MSK              0b0000000001111111      // ADC Core Clock Divider Filter Mask
#define REG_ADFLxCON_INPUT(x)            (x & REG_ADFLxCON_INPUT_MSK)     // Digital Filter ADC Input Number

#define REG_ADFLxCON_INPUT_AN31             0b0000000000011111      // Digital Filter ADC Input Number 
#define REG_ADFLxCON_INPUT_AN30             0b0000000000011110      // Digital Filter ADC Input Number 
#define REG_ADFLxCON_INPUT_AN29             0b0000000000011101      // Digital Filter ADC Input Number 
#define REG_ADFLxCON_INPUT_AN28             0b0000000000011100      // Digital Filter ADC Input Number 
#define REG_ADFLxCON_INPUT_AN27             0b0000000000011011      // Digital Filter ADC Input Number 
#define REG_ADFLxCON_INPUT_AN26             0b0000000000011010      // Digital Filter ADC Input Number 
#define REG_ADFLxCON_INPUT_AN25             0b0000000000011001      // Digital Filter ADC Input Number 
#define REG_ADFLxCON_INPUT_AN24             0b0000000000011000      // Digital Filter ADC Input Number 
#define REG_ADFLxCON_INPUT_AN23             0b0000000000010111      // Digital Filter ADC Input Number 
#define REG_ADFLxCON_INPUT_AN22             0b0000000000010110      // Digital Filter ADC Input Number 
#define REG_ADFLxCON_INPUT_AN21             0b0000000000010101      // Digital Filter ADC Input Number 
#define REG_ADFLxCON_INPUT_AN20             0b0000000000010100      // Digital Filter ADC Input Number 
#define REG_ADFLxCON_INPUT_AN19             0b0000000000010011      // Digital Filter ADC Input Number 
#define REG_ADFLxCON_INPUT_AN18             0b0000000000010010      // Digital Filter ADC Input Number 
#define REG_ADFLxCON_INPUT_AN17             0b0000000000010001      // Digital Filter ADC Input Number 
#define REG_ADFLxCON_INPUT_AN16             0b0000000000010000      // Digital Filter ADC Input Number 
#define REG_ADFLxCON_INPUT_AN15             0b0000000000001111      // Digital Filter ADC Input Number 
#define REG_ADFLxCON_INPUT_AN14             0b0000000000001110      // Digital Filter ADC Input Number 
#define REG_ADFLxCON_INPUT_AN13             0b0000000000001101      // Digital Filter ADC Input Number 
#define REG_ADFLxCON_INPUT_AN12             0b0000000000001100      // Digital Filter ADC Input Number 
#define REG_ADFLxCON_INPUT_AN11             0b0000000000001011      // Digital Filter ADC Input Number 
#define REG_ADFLxCON_INPUT_AN10             0b0000000000001010      // Digital Filter ADC Input Number 
#define REG_ADFLxCON_INPUT_AN9              0b0000000000001001      // Digital Filter ADC Input Number 
#define REG_ADFLxCON_INPUT_AN8              0b0000000000001000      // Digital Filter ADC Input Number 
#define REG_ADFLxCON_INPUT_AN7              0b0000000000000111      // Digital Filter ADC Input Number 
#define REG_ADFLxCON_INPUT_AN6              0b0000000000000110      // Digital Filter ADC Input Number 
#define REG_ADFLxCON_INPUT_AN5              0b0000000000000101      // Digital Filter ADC Input Number 
#define REG_ADFLxCON_INPUT_AN4              0b0000000000000100      // Digital Filter ADC Input Number 
#define REG_ADFLxCON_INPUT_AN3              0b0000000000000011      // Digital Filter ADC Input Number 
#define REG_ADFLxCON_INPUT_AN2              0b0000000000000010      // Digital Filter ADC Input Number 
#define REG_ADFLxCON_INPUT_AN1              0b0000000000000001      // Digital Filter ADC Input Number 
#define REG_ADFLxCON_INPUT_AN0              0b0000000000000000      // Digital Filter ADC Input Number 

