microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_adc.h
typedef enum {
    ADFLxCON_INPUT_AN25 = 0b11001,      // Digital Filter ADC Input Number 
    ADFLxCON_INPUT_AN24 = 0b11000,      // Digital Filter ADC Input Number 
    ADFLxCON_INPUT_AN23 = 0b10111,      // Digital Filter ADC Input Number 
    ADFLxCON_INPUT_AN22 = 0b10110,      // Digital Filter ADC Input Number 
    ADFLxCON_INPUT_AN21 = 0b10101,      // Digital Filter ADC Input Number 
    ADFLxCON_INPUT_AN20 = 0b10100,      // Digital Filter ADC Input Number 
    ADFLxCON_INPUT_AN19 = 0b10011,      // Digital Filter ADC Input Number 
    ADFLxCON_INPUT_AN18 = 0b10010,      // Digital Filter ADC Input Number 
    ADFLxCON_INPUT_AN17 = 0b10001,      // Digital Filter ADC Input Number 
    ADFLxCON_INPUT_AN16 = 0b10000,      // Digital Filter ADC Input Number 
    ADFLxCON_INPUT_AN15 = 0b01111,      // Digital Filter ADC Input Number 
    ADFLxCON_INPUT_AN14 = 0b01110,      // Digital Filter ADC Input Number 
    ADFLxCON_INPUT_AN13 = 0b01101,      // Digital Filter ADC Input Number 
    ADFLxCON_INPUT_AN12 = 0b01100,      // Digital Filter ADC Input Number 
    ADFLxCON_INPUT_AN11 = 0b01011,      // Digital Filter ADC Input Number 
    ADFLxCON_INPUT_AN10 = 0b01010,      // Digital Filter ADC Input Number 
    ADFLxCON_INPUT_AN9  = 0b01001,      // Digital Filter ADC Input Number 
    ADFLxCON_INPUT_AN8  = 0b01000,      // Digital Filter ADC Input Number 
    ADFLxCON_INPUT_AN7  = 0b00111,      // Digital Filter ADC Input Number 
    ADFLxCON_INPUT_AN6  = 0b00110,      // Digital Filter ADC Input Number 
    ADFLxCON_INPUT_AN5  = 0b00101,      // Digital Filter ADC Input Number 
    ADFLxCON_INPUT_AN4  = 0b00100,      // Digital Filter ADC Input Number 
    ADFLxCON_INPUT_AN3  = 0b00011,      // Digital Filter ADC Input Number 
    ADFLxCON_INPUT_AN2  = 0b00010,      // Digital Filter ADC Input Number 
    ADFLxCON_INPUT_AN1  = 0b00001,      // Digital Filter ADC Input Number 
    ADFLxCON_INPUT_AN0  = 0b00000       // Digital Filter ADC Input Number 
}ADFLxCON_INPUT_e;

typedef union {
    
    struct {
        volatile ADFLxCON_INPUT_e flchsel : 5;  // Bit 4-0: Oversampling Filter Input Channel Selection bits
        volatile unsigned  : 3;                 // Bit 7-5: (reserved)
        volatile ADFLxCON_RDY_e rdy : 1;        // Bit 8: Oversampling Filter Data Ready Flag bit
        volatile ADFLxCON_IE_e ie : 1;          // Bit 9: Filter Common ADC Interrupt Enable bit
        volatile ADFLxCON_OVRSAM_e ovrsam : 5;  // Bit 14-10: Filter Mode bits + Filter Averaging/Oversampling Ratio bits
        volatile ADFLxCON_FLEN_e flen : 1;      // Bit 15: Filter Enable bit
    }__attribute__((packed)) bits;        // ADFLxCON: ADC DIGITAL FILTER x CONTROL REGISTER
    volatile uint16_t value;
} ADFLxCON_t;    // ADFLxCON: ADC DIGITAL FILTER x CONTROL REGISTER


// ==============================================================================================
// Global macros 
// ==============================================================================================
#define ADCBUFx_ADDR(x)  ((x) * ((volatile uint16_t)&ADCBUF1 - (volatile uint16_t)&ADCBUF0)) /// ADCBUFx_ADDR: ADC result buffer address


// ==============================================================================================
// High Speed ADC Core Settings Data Structure (Dedicated ADC Code 0-6 and Shared ADC Core)
// ==============================================================================================

typedef union {
    struct {
        volatile ADCOREx_SAMC_e samc : 10;  // Bit 9-0: Dedicated ADC Core x Conversion Delay Selection bits
        volatile unsigned : 6;              // Bit 15-10: (reserved)
    } __attribute__((packed)) bits;   // DEDICATED ADC CORE x CONTROL REGISTER LOW BIT FIELD
    volatile uint16_t value;  // DEDICATED ADC CORE x CONTROL REGISTER LOW VALUE
}ADCORExL_t; // DEDICATED ADC CORE x CONTROL REGISTER LOW BIT FIELD AND REGISTER VALUE

typedef union {
    struct {
        volatile ADCOREx_ADCS_e adcs : 7;   // Bit 6-0: ADC Core x Input Clock Divider bits
        volatile unsigned : 1;              // Bit 7: (reserved)
        volatile ADCOREx_RES_e res : 2;     // Bit 9-8: ADC Core x Resolution Selection bits
        volatile ADCOREx_EISEL_e eisel : 3; // Bit 12-10: ADC Core x Early Interrupt Time Selection bits
        volatile unsigned : 3;              // Bit 15-13: (reserved)
    }__attribute__((packed)) bits;    // DEDICATED ADC CORE x CONTROL REGISTER HIGH BIT FIELD
    volatile uint16_t value;  // DEDICATED ADC CORE x CONTROL REGISTER VALUE
}ADCORExH_t; // DEDICATED ADC CORE x CONTROL REGISTER HIGH BIT FIELD AND REGISTER VALUE

typedef union {
    struct {
        // --- LOW-WORD ---
        volatile ADCOREx_SAMC_e samc : 10;  // Bit 9-0: Dedicated ADC Core x Conversion Delay Selection bits
        volatile unsigned : 6;              // Bit 15-10: (reserved)
        // --- HIGH-WORD ---
        volatile ADCOREx_ADCS_e adcs : 7;   // Bit 6-0: ADC Core x Input Clock Divider bits
        volatile unsigned : 1;              // Bit 7: (reserved)
        volatile ADCOREx_RES_e res : 2;     // Bit 9-8: ADC Core x Resolution Selection bits
        volatile ADCOREx_EISEL_e eisel : 3; // Bit 12-10: ADC Core x Early Interrupt Time Selection bits
        volatile unsigned : 3;              // Bit 15-13: (reserved)
    }__attribute__((packed)) bits;     // DEDICATED ADC CORE x CONTROL REGISTER HIGH BIT FIELD
    volatile uint32_t value;  // REGISTER HIGH/LOW VALUE (32-bit)
}ADCOREx_t; // DEDICATED ADC CORE x CONTROL REGISTER HIGH/LOW BIT FIELD AND REGISTER VALUE


/*!HSADC_ADCORECFG_t
 * These generic data structures allow the creation of independent, generic configurations
 * for dedicated and shared ADC cores. These data structures are required as function call 
 * parameter. The library functions are internally distributing the settings into the correct 
 * registers.
 */
//
//typedef enum {
//    ADCORE_TYPE_SHARED    = 0b1, // ADC core is Shared ADC core
//    ADCORE_TYPE_DEDICATED = 0b0  // ADC core is Dedicated ADC core
//}ADCORE_TYPE_e; // User enumeration distinguishing between dedicated and shared ADC cores
//
//typedef enum {
//    ADCORE_ENABLED  = 0b1, // ADC core is/will be enabled (powered on and checked)
//    ADCORE_DISABLED = 0b0  // ADC core is/will be disabled (powered off)
//}ADCORE_ENABLE_e; // User enumeration distinguishing between dedicated and shared ADC cores
//
//typedef struct {
//    volatile ADCOREx_SAMC_e samc : 10;      // Bit 9-0: Dedicated ADC Core x Conversion Delay Selection bits
//    volatile ADCON4_SAMCxEN_e samc_en : 1;  // Bit 10: Flag indicating if sample delay should be enabled/disabled
//    volatile ADCOREx_RES_e res : 2;         // Bit 12-11: ADC Core x Resolution Selection bits
//    volatile ADCOREx_EISEL_e eisel : 3;     // Bit 15-13: ADC Core x Early Interrupt Time Selection bits
//    
//    volatile ADCOREx_ADCS_e adcs : 7;       // Bit 6-0: ADC Core x Input Clock Divider bits
//    volatile ADCON4_SYNCTRGx_e synctrg : 1; // Bit 7: Synchronous trigger
//    volatile ADCORE_TYPE_e type : 1;        // Bit 8: Flag indicating if this is a shared or dedicated core
//    volatile ADCON5_WARMTIME_e warmtime : 4; // Bit 12-9: ADC Dedicated Core x Power-up Delay bits
//    volatile unsigned : 2;                  // Bit 14-13: (reserved)
//    volatile ADCORE_ENABLE_e enable : 1;    // Bit 15: ADC core enable bit
//}__attribute__((packed)) ADCORE_CONFIG_t;   // Generic core configuration data structure
//
//typedef struct {
//    volatile uint16_t index;     // ADC core index
//    volatile ADCORE_CONFIG_t config; // ADC core configuration (32 bit)
//}HSADC_ADCORECFG_t; // Generic DEDICATED/SHARED ADC CORE configuration
//
//typedef struct {
//    #if defined (ADCORE0L)
//    volatile HSADC_ADCORECFG_t core0; // ADC core configuration of dedicated ADC core #0
//    #endif
//    #if defined (ADCORE1L)
//    volatile HSADC_ADCORECFG_t core1; // ADC core configuration of dedicated ADC core #1
//    #endif
//    #if defined (ADCORE2L)
//    volatile HSADC_ADCORECFG_t core2; // ADC core configuration of dedicated ADC core #2
//    #endif
//    #if defined (ADCORE3L)
//    volatile HSADC_ADCORECFG_t core3; // ADC core configuration of dedicated ADC core #3
//    #endif
//    #if defined (ADCORE4L)
//    volatile HSADC_ADCORECFG_t core4; // ADC core configuration of dedicated ADC core #4
//    #endif
//    #if defined (ADCORE5L)
//    volatile HSADC_ADCORECFG_t core5; // ADC core configuration of dedicated ADC core #5
//    #endif
//    #if defined (ADCORE6L)
//    volatile HSADC_ADCORECFG_t core6; // ADC core configuration of dedicated ADC core #6
//    #endif
//    volatile HSADC_ADCORECFG_t shared_core; // ADC core configuration of shared ADC core
//}HSADC_ADCORES_t; // Generic DEDICATED/SHARED ADC CORE configuration

// ==============================================================================================
// High Speed ADC Module Base Register Data Structure (ADCONx Registers)
// ==============================================================================================
 typedef struct {
    volatile ADCOREx_SAMC_e samc;       // Shared/Dedicated ADC Core Conversion Delay Selection bits
    #if ADC_CORE_COUNT > 1
    volatile ADCON4_SAMCxEN_e samc_en;  // Flag indicating if sample delay should be enabled/disabled
    #endif
    volatile ADCOREx_EISEL_e eisel;     // ADC Core x Early Interrupt Time Selection bits
    volatile ADCOREx_ADCS_e adcs;       // Shared ADC Core Input Clock Divider bits
    volatile ADCOREx_RES_e res;         // ADC Core x Resolution Selection bits
} HSADC_CORE_CONFIG_t; // GENERIC ADC CORE CONFIGURAITON REGISTER SETTINGS

