microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_adc.h
typedef struct {
    #if defined (ADCORE0L)
    volatile HSADC_CORE_CONFIG_t core0;    // DEDICATED ADC CORE #0 CLOCK CONFIGURAITON REGISTER SETTINGS
    #endif
    #if defined (ADCORE1L)
    volatile HSADC_CORE_CONFIG_t core1;    // DEDICATED ADC CORE #1 CLOCK CONFIGURAITON REGISTER SETTINGS
    #endif
    volatile HSADC_CORE_CONFIG_t shared_core; // SHARED ADC CORE CLOCK CONFIGURAITON REGISTER SETTINGS
    volatile ADCON3_CLKDIV_e clkdiv;    // ADC Module Clock Source Divider bits
    volatile ADCON3_CLKSEL_e clksel;    // ADC Module Clock Source Selection bits
} HSADC_CLOCK_CONFIG_t; // ADC CLOCK CONFIGURAITON REGISTER SETTINGS

typedef struct {
    volatile ADCON2_REFERCIE_e refercie;    // Band Gap or Reference Voltage Error Common Interrupt Enable bit
    volatile ADCON2_REFCIE_e refcie;        // Band Gap and Reference Voltage Ready Common Interrupt Enable bit
    volatile ADCON3_REFSEL_e refsel;        // ADC Reference Voltage Selection bits
} HSADC_REFERENCE_CONFIG_t; // ADC REFERENCE CONFIGURAITON REGISTER SETTINGS

typedef struct {
    volatile ADCON3_CNVCHSEL_e cnvchsel;    // Channel Number Selection for Software Individual Channel Conversion Trigger bits
    volatile ADCON3_SUSPCIE_e suspcie;      // All ADC Core Triggers Disable bit
    volatile ADCON3_SUSPEND_e suspend;      // All ADC Core Triggers Disable bit
} HSADC_SWTRIG_CONFIG_t; // ADC SOFTWARE TRIGGER CONFIGURAITON REGISTER SETTINGS

typedef struct {
    volatile ADCON5_WARMTIME_e warmtime; // ADC Dedicated Core x Power-up Delay
    volatile ADCON2_PTGEN_e ptgen;      // External Conversion Request Interface bit
    volatile ADCON2_EIEN_e eien;        // Early Interrupts Enable bit
    volatile ADCON1_FORM_e form;        // Fractional Data Output Format bit
    volatile ADCON1_ADSIDL_e adsidl;    // ADC Stop in Idle Mode bit
    volatile ADCON1_ADON_e adon;        // ADC Enable bit
} HSADC_CONTROL_CONFIG_t; // BASIC ADC MODULE CONTROL REGISTER SETTINGS

typedef struct {
    volatile HSADC_CLOCK_CONFIG_t cores;      // ADC CLOCK CONFIGURAITON REGISTER SETTINGS
    volatile HSADC_REFERENCE_CONFIG_t refcfg; // ADC REFERENCE CONFIGURAITON REGISTER SETTINGS
    volatile HSADC_SWTRIG_CONFIG_t swtrig;    // ADC SOFTWARE TRIGGER CONFIGURAITON REGISTER SETTINGS
    volatile HSADC_CONTROL_CONFIG_t config;   // BASIC ADC MODULE CONTROL REGISTER SETTINGS
} HSADC_ADMODCFG_t; // ADC module base register set


// ==============================================================================================
// High Speed ADC Input Channel Settings Data Structure (ANx inputs 0-31)
// ==============================================================================================

typedef enum {
    ANx_CORE_ASSIGNMENT_DEDICATED = 0b1, // Input pin ANx is tied to Dedicated ADC core
    ANx_CORE_ASSIGNMENT_SHARED = 0b1     // Input pin ANx is tied to Shared ADC core
}ADCORE_ASSIGNMENT_e;

typedef enum {
    ANx_DIFFERENTIAL = 0b1, // Input pin ANx is configured in differential mode
    ANx_SINGLE_ENDED = 0b0  // Input pin ANx is configured in single-ended mode
}ADMOD_INPUT_MODE_e;

typedef enum {
    ANx_DATA_SIGNED = 0b1, // Input pin ANx output data is signed
    ANx_DATA_UNSIGNED = 0b0  // Input pin ANx output data is unsigned
}ADMOD_OUTPUT_DATA_MODE_e; // Input pin ANx output data mode

typedef struct {
    volatile uint16_t core_index;                   // Index of the ADC core the analog input is connected to
    volatile ADCORE_ASSIGNMENT_e core_assigmnment;  // Pin ANx is tied to dedicated or shared ADC core bit (read only)
    volatile ADMOD_INPUT_MODE_e input_mode;         // Input ANx input mode is differential or single-ended bit
    volatile ADMOD_OUTPUT_DATA_MODE_e data_mode;    // Input ANx output data mode bit
    volatile ADLVLTRG_e trigger_mode;               // Level Trigger for corresponding Analog Input Enable bit
    volatile ADIE_IE_e interrupt_enable;            // Input ANx interrupt enable bit
    volatile ADEIE_EIEN_e early_interrupt_enable;   // Input ANx early interrupt enable bit
    volatile ADTRIG_TRGSRC_e trigger_source;        // Input ANx trigger source bits
} ADCAN_CONFIG_t; // ADC Input Channel Settings 

typedef struct {
    volatile ADCAN_CONFIG_t config; // Analog input configuration
    volatile uint16_t ad_input; // Analog-To-Digital input index (e.g. 3 for AN3)
}HSADC_ADCANCFG_t; // ADC Input Channel Settings 

// ==============================================================================================
// ADC Digital Comparator Object
// ==============================================================================================

typedef struct {
    volatile ADCMPxCON_t ADCMPxCON; // ADC digital comparator configuration
    volatile ADCMPxEN_t ADCMPxEN;   // Analog input source enable selection
    volatile uint16_t ADCMPxLO;   // ADC digital comparator Lower Threshold register
    volatile uint16_t ADCMPxHI;   // ADC digital comparator Upper Threshold register
}HSADC_ADCMP_CONFIG_t; // ADC DIGITAL COMPARATOR Settings 

// ==============================================================================================
// ADC Digital Comparator Object
// ==============================================================================================

typedef struct {
    volatile ADFLxCON_t ADFLxCON;    // ADC digital filter configuration
    volatile uint16_t ADFLxDAT;             // ADC digital filter result register
}HSADC_ADFLT_CONFIG_t; // ADC DIGITAL FILTER Settings 

// ==============================================================================================
// Global Function Prototypes
// ==============================================================================================
extern volatile uint16_t ADC_Module_Initialize( volatile HSADC_ADMODCFG_t adc_cfg );
extern volatile uint16_t ADC_ADInput_Initialize( volatile HSADC_ADCANCFG_t adin_cfg );


extern volatile uint16_t ADC_Module_PowerUp(void);
extern volatile uint16_t ADC_Module_PowerDown(void);
extern volatile uint16_t ADC_Module_Enable(void);
extern volatile uint16_t ADC_Module_Disable(void);
extern volatile uint16_t ADC_Module_Reset(void);

extern volatile uint16_t ADC_Core_PowerUp(volatile uint16_t index);
extern volatile uint16_t ADC_Core_CheckReady(void);

extern volatile uint16_t ADC_ADInput_SetMode(volatile HSADC_ADCANCFG_t adin_cfg);
extern volatile uint16_t ADC_ADInput_SetTriggerSource(volatile HSADC_ADCANCFG_t adin_cfg);
extern volatile uint16_t ADC_ADInput_SetTriggerMode(volatile HSADC_ADCANCFG_t adin_cfg);
extern volatile uint16_t ADC_ADInput_SetInterrupt(volatile HSADC_ADCANCFG_t adin_cfg);

extern volatile uint16_t ADC_ADComp_Initialize(volatile uint16_t index, volatile HSADC_ADCMP_CONFIG_t adcmp_cfg);
extern volatile uint16_t ADC_ADFilter_Initialize(volatile uint16_t index, volatile HSADC_ADFLT_CONFIG_t adflt_cfg);


#endif /* dsPIC33CH/CK only */
#endif /* end of MCAL_P33SMPS_HSADC_H */

// END OF FILE
